{
  "id": 253,
  "name": "Bulwark",
  "mtype": "secondary",
  "ruleset": 0,
  "options": [
    {
      "id": 1568,
      "name": "Bulwark",
      "description": "While you are wielding a Heavy Shield, you also gain partial cover from Ray Attacks. Additionally, if you take the Defense Action, the bonus you receive from partial cover is doubled until the start of your next turn while you are wielding a Heavy Shield.",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": "TD"
    },
    {
      "id": 1569,
      "name": "Shield Expert",
      "description": "Remove Dodge, Stealth and Movement Speed Penalties while using Shields",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": "W5DR=1"
    },
    {
      "id": 1570,
      "name": "Hearty",
      "description": "Gain +5 Health",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "AH=5"
    },
    {
      "id": 1571,
      "name": "Shield Master",
      "description": "Gain +1 Block while wielding a Shield",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "W5D3=1"
    },
    {
      "id": 1572,
      "name": "Action : Hold the Line",
      "description": "Your Movement Speed becomes 0. You can maintain this indefinitely until you are Knocked Prone, or Stunned.  It costs 1 Action per turn to round the line, otherwise the effect ends.  While this ability is active, hostile Creatures cannot pass through an area in a 1 Unit radius around you.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1573,
      "name": "Action : Shield Charge",
      "description": "You Move up to your Movement Speed, but at least 4 Units towards a Creature and make a Shove Attack. If successful, the Creature takes 1d6 Fall Damage and lands prone 1 Unit behind you.",
      "mtype": "sub",
      "location": "4b",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1574,
      "name": "Reaction : Critical Block",
      "description": "When you roll a 12 on a Block Check, the Attack misses, regardless of the enemy roll. Additionally, if the Creature that Attacked you is within your Melee Range, you can make a counter Attack with a 1-Handed Weapon that is upgraded to a True Hit if it hits.",
      "mtype": "sub",
      "location": "5",
      "cost": 3,
      "data": "ZX2"
    }
  ]
}