{
  "id": 229,
  "name": "Knight",
  "mtype": "secondary",
  "ruleset": 0,
  "options": [
    {
      "id": 1407,
      "name": "Vow",
      "description": "You make a Vow to an Order that is willing to accept you, agreeing to abide by their code and rules. While your Vow is satisifed, you can take refuge within any establishment dedicated to your order, in which you are fed and boarded. A Full Rest within any establishment associated with your order is Favorable and you gain extra Health and Power equal to your Level.",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1408,
      "name": "Armored Knight",
      "description": "Gain +1 Resilience and gain +1 Physical Mitigation while wearing Medium and Heavy Armor.",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": "AS6=1:W2D4=1"
    },
    {
      "id": 1409,
      "name": "Beacon of the Order",
      "description": "Gain +1 Persuasion and +1 Strength",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "ASC=1:AS2=1"
    },
    {
      "id": 1410,
      "name": "Squire",
      "description": "You are appointed a Squire by your Order who follows your commands as long as it does not break your Vow. Should the Squire die, you can be assigned another within any establishment dedicated to your order at the cost of 50 Gold. Upon reaching Level 9, your Squire can be upgraded to a Knight for 500 Gold.",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1411,
      "name": "Know No Fear",
      "description": "While you are not Maddened or Confused, you and any Ally within 6 Units are Immune to the Afraid Condition, ending the Condition if an Afraid Ally moves within this Radius.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1412,
      "name": "Boon of the Vanguard",
      "description": "While you and your Squire are within 4 Units of each other, your True Hit threshold is increased by 1 and you gain a 1d4 Bonus to Resilience Checks. If your Squire is a Knight, they get this Bonus as well.",
      "mtype": "sub",
      "location": "4b",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1413,
      "name": "Free Action : Honor Strike",
      "description": "Make an Attack with a Weapon with no Bonus Damage Modifier. If the Attack hits, that Target has a 1d4 Penalty to Attacks against anyone other than you on their next Action or Bonus Action.",
      "mtype": "sub",
      "location": "5",
      "cost": 3,
      "data": "Y"
    }
  ]
}