{
  "id": 281,
  "name": "Summoner",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "id": 2225,
      "name": "Summoner",
      "description": "Gain the Summoner Familiar",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": ""
    },
    {
      "id": 2226,
      "name": "Free Action : Greater Summoning",
      "description": "Instead of using a quartz worth 5gp and an action, you can utilize a beginner catalyst gem to summon the corresponding elemental. When summoned this way, the elemental gains Temporary Health equal to your level. This ability can also be used to summon a higher level elemental using the Master Summoner trait with the appropriate catalyst.",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": "Y"
    },
    {
      "id": 2227,
      "name": "Elemental Weapon",
      "description": "You spend 1 minute and designate a weapon as your elemental weapon. When you have an active summon, the weapon's primary damage is converted to the damage type of the corresponding elemental and gains the magical property. You can only have one elemental weapon at a time.",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "TO"
    },
    {
      "id": 2228,
      "name": "Elemental Magic",
      "description": "Gain +1 Arcanum and +1 Spell Damage",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "AZ4=1:AS7=1"
    },
    {
      "id": 2229,
      "name": "Reaction : Divert Elements",
      "description": "In response to taking elemental, arcane or physical damage when you have an active summon, you add their mitigation to yours when calculating damage.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "ZX2"
    },
    {
      "id": 2230,
      "name": "Free Action : Focused Elements",
      "description": "When you have an active elemental and channel an evocation spell of the subschool of your elemental, it becomes charged, has it's true hit threshold increased and can critically hit.",
      "mtype": "sub",
      "location": "4b",
      "cost": 2,
      "data": "Y"
    },
    {
      "id": 2231,
      "name": "Master Summoner",
      "description": "Your summoning skills allow you to use an action to transform your familiar into an elementaling by using a 50gp gem or catalyst or an Elemental by using a 300gp gem or catalyst. This can only be used to summon an elemental that is lower than your level.",
      "mtype": "sub",
      "location": "5",
      "cost": 3,
      "data": "TG"
    }
  ]
}