{
  "id": 201,
  "name": "Biomancer",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Toxic Studies",
      "description": "Your deep study of toxins and diseases grants medical insight. Gain +1 skill with medicine. You can identify poisons and diseases with a medicine check and craft antidotes if you have identified the toxin.",
      "location": "1",
      "data": "SSP=1:TO"
    },
    {
      "name": "Action : Plague Touch",
      "description": "You inflict a minor disease with your touch. Make a brawling attack that deals no damage. If it hits, the target must make a resilience check of 8 or suffer -1 die on all fitness and endurance checks for the next hour.",
      "location": "2a",
      "data": "X"
    },
    {
      "name": "Reaction : Bio-Ward",
      "description": "When you or an adjacent ally would be poisoned or diseased, you can attempt an alchemy check against the effect's threshold to neutralize it. Additionally, gain +1 toxic mitigation permanently.",
      "location": "2b",
      "data": "Z:M9=1"
    },
    {
      "name": "Anatomical Precision",
      "description": "Your medical knowledge grants insight into weak points. Gain +1 skill with logic. When you successfully hit with a weapon that deals toxic damage, you can identify the target's lowest mitigation type.",
      "location": "3",
      "data": "SSL=1:TO"
    },
    {
      "name": "Virulent Alchemist",
      "description": "Your alchemical creations are exceptionally potent. Gain +1 skill with alchemy. Poisons you craft deal +1 damage and have their threshold increased by 2.",
      "location": "4a",
      "data": "CS3=1:TO"
    },
    {
      "name": "Symbiotic Organisms",
      "description": "You cultivate beneficial microorganisms in your body. Gain +1 skill with wildcraft and +2 toxic mitigation. You are immune to non-magical diseases.",
      "location": "4b",
      "data": "SSM=1:M9=2:IH"
    },
    {
      "name": "Action : Bioshape Creature",
      "description": "Shape living tissue to create a small creature (minion tier) that obeys your commands for 1 hour. Requires a bioshaping check of 10. The creature has stats based on what you shape it from. Gain +1 skill with bioshaping.",
      "location": "5",
      "data": "X:CS6=1"
    },
    {
      "name": "Master Plague Doctor",
      "description": "Your diseases can spread between victims. Gain +1 skill with black magic. When a creature fails a check against your plague effects, creatures within 5 units must also check at -2 or contract a lesser version.",
      "location": "6a",
      "data": "YS1=1:TO"
    },
    {
      "name": "Master Biomancer",
      "description": "You can shape willing creatures temporarily. Gain +1 skill with primal magic. As an action, grant an ally one mutation for 1 hour: +1 physical mitigation, claws (d6 brawling damage), or +2 movement speed.",
      "location": "6b",
      "data": "YS2=1:TO"
    },
    {
      "name": "Genesis",
      "description": "Master of life and death. Gain +1 skill with alchemy and +1 skill with bioshaping. Once per day, perform a 10-minute ritual to either: cure all diseases and poisons in a 10-unit radius, or unleash a plague forcing all enemies within 10 units to make a resilience check of 12 or take 2 toxic damage per round for 5 rounds.",
      "location": "7",
      "data": "CS3=1:CS6=1:X"
    }
  ]
}