{
  "id": 105,
  "name": "Bounty Hunter",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Action : Mark Quarry",
      "description": "You designate a creature you can see as your quarry. You gain +1 dice on all senses and insight checks to track or gather information about your quarry. You also know the general direction and approximate distance to your quarry if they are within distant range. This mark lasts until the quarry is captured, killed, or you complete a full rest.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Relentless Pursuit",
      "description": "Gain +1 skill with wildcraft. You can track creatures across any natural terrain without penalty, and your movement is not slowed by difficult terrain while following a trail.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "SSM=1:TG"
    },
    {
      "name": "Urban Hunter",
      "description": "Gain +1 skill with insight. You excel at tracking quarry through cities and settlements. You can gather information about a person's whereabouts, associates, or habits by spending 2 hours networking in an urban area.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "SSS=1:TG"
    },
    {
      "name": "Prepared Hunter",
      "description": "You never go into a hunt unprepared. Gain +1 energy. At the start of each day, you can designate one type of creature (humanoid, beast, undead, etc.). You gain +1 dice on all attack rolls against creatures of that type until your next full rest.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "A3=1:TO"
    },
    {
      "name": "Reaction : Hunter's Reflexes",
      "description": "When your quarry moves away from you, you can immediately move up to your movement speed toward them without provoking reactions. You must end this movement closer to your quarry than when you started.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Action : Capture Alive",
      "description": "You make a specialized non-lethal attack designed to incapacitate rather than kill. Make a weapon attack. If it hits, instead of dealing damage, the target must make a resilience check with DC equal to your attack result. On failure, they are stunned until the end of their next turn.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "TO"
    },
    {
      "name": "Beast Hunter",
      "description": "You specialize in hunting wild creatures. Gain +1 skill with medicine. You can harvest valuable materials from slain beasts, gaining resources worth 50 gold per creature tier (minion=50, thrall=100, etc.).",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "SSP=1:TG"
    },
    {
      "name": "Manhunter",
      "description": "You specialize in hunting intelligent prey. Gain +1 skill with throwing weapons. When fighting humanoids or creatures with intelligence comparable to humans, you deal +1 damage with all attacks.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "WS2=1:TO"
    },
    {
      "name": "Trapper",
      "description": "Gain +1 skill with engineering. When you",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Trophy Collector",
      "description": "You wear trophies from your most dangerous kills, drawing strength from your victories. After each full rest, if you wear a trophy from a creature you've taken part in slaying, you gain temporary health based on its tier: foe (2), champion (5), elite (8), or legend (15). This benefit is lost if you reach 0 health or 0 resolve and you must seek out a new trophy. You can only wear one trophy at a time.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "TD"
    }
  ]
}