{
  "id": 205,
  "name": "Scholar",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Well-Read",
      "description": "You have extensive knowledge of history, culture, and lore. Gain +1 skill with academics and learn one additional language of your choice.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "SSN=1:LG"
    },
    {
      "name": "Action : Tactical Analysis",
      "description": "Study a visible enemy. Make a logic check (DC 8). On success, learn their highest skill, lowest defense, and one damage type they have mitigation against. Share this knowledge with allies.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "X"
    },
    {
      "name": "Reaction : Recall Knowledge",
      "description": "When an ally within earshot attempts a skill check, you may share relevant knowledge. If you succeed on an academics check (DC 8), they gain +1 die on their check.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "Z"
    },
    {
      "name": "Mental Discipline",
      "description": "Your trained mind resists distraction. Gain +1 skill with concentration. You are immune to the dazed condition and gain +1 die on checks to resist mental conditions.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "SSJ=1:IF"
    },
    {
      "name": "Linguistic Mastery",
      "description": "You are a master of communication. Gain +1 skill with expression and learn two additional languages. You can attempt to communicate basic concepts with creatures whose language you don't know using logic checks.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "SSQ=1:LG:LG"
    },
    {
      "name": "Analytical Mind",
      "description": "Your deductive abilities are supernatural. Gain +2 skill with logic. You can use logic in place of senses to detect illusions, hidden doors, or traps.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "SSL=2:TO"
    },
    {
      "name": "Action : Exploit Weakness",
      "description": "After successfully analyzing an enemy, share their weakness with all allies. For the next minute, all allies gain +1 die on attacks against that enemy and +1 damage if targeting their lowest mitigation type.",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "X"
    },
    {
      "name": "Arcane Scholar",
      "description": "Your study of magical theory grants practical benefits. Gain +1 skill with magic. You can identify spells being cast with an academics check and gain +1 die on saves against spells you've identified.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "SSO=1:TO"
    },
    {
      "name": "Master Teacher",
      "description": "You excel at passing on knowledge. Gain +1 skill with persuasion. During downtime, allies who spend a day training with you gain +1 die on their next check using a skill you have at 4 or higher.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "SST=1:TO"
    },
    {
      "name": "Omniscient",
      "description": "Your knowledge approaches the supernatural. Gain +1 skill with academics and +1 skill with logic. Once per day, declare you've studied this exact situation before. Ask the GM three questions about the current scenario - they must answer truthfully. You and your allies gain +1 die on all related checks for the next hour.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "SSN=1:SSL=1:X"
    }
  ]
}