{
  "id": 28,
  "name": "Klaktil Integrant",
  "mtype": "alteration",
  "ruleset": 0,
  "options": [
    {
      "id": 10001,
      "name": "Knowledge of the Hive",
      "description": "Gain +1 to all Knowledge Skills",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "AS7=1:AS8=1:AS9=1:ASA=1:ASB=1"
    },
    {
      "id": 10002,
      "name": "Action : Calming Pheromones",
      "description": "For 5 turns, you emit pheromones in a 3-unit radius. At the start of their turn, humanoids and beasts within the area must make a contested Resilience check against 1d12 + half your level. On a failure, they cannot act aggressively unless they or their allies are harmed or threatened. A successful check grants immunity until their next full rest. Additionally, Gain +1d4 to social checks against affected creatures.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 10003,
      "name": "Crafting Aura",
      "description": "Gain +1 to all Crafting Skills. You can also assist others with recipes, granting them a +1 bonus to all Craft Checks.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "AC1=1:AC2=1:AC3=1:AC4=1:AC5=1:AC6=1:AC7=1"
    },
    {
      "id": 10004,
      "name": "Party Link",
      "description": "When you spend a full rest within an enclosed space with one or more humanoids, you can share thoughts and ideas with them telepathically within 10 units until your next full rest.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 10005,
      "name": "Multifaceted Eyes",
      "description": "Your connection to the hive has resulted in a physical evolution of your eyes granting you Ultravision.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "DU"
    },
    {
      "id": 10006,
      "name": "Feelers",
      "description": "You have developed extrasensory feelers that grant you Tremorsense and the ability to determine if a creature or object is diseased or poisoned by touching it.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "DT:TG"
    },
    {
      "id": 10007,
      "name": "Free Action : Orchestrate",
      "description": "You telepathically coordinate an action with an allied creature within 8 units that is under the effect of your Party Link trait. You coordinate one of the following actions: Use, Attack, Shove.",
      "mtype": "core",
      "location": "5",
      "cost": 3,
      "data": "Y"
    },
    {
      "id": 10008,
      "name": "Improved Link",
      "description": "Your Party Link trait allows two-way communication and no longer has a maximum range as long as the target is on the same celestial body as you. This additionally grants you a 2d4 bonus to insight checks against humanoids you are linked with.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 10009,
      "name": "Reaction : Shared Knowledge",
      "description": "In response to a humanoid under the effect of your Party Link trait that you can see making a Defense or Knowledge Check, grant them a 1d4 bonus.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "ZX2"
    },
    {
      "id": 10010,
      "name": "Hive Elite",
      "description": "You have absorbed skills from the hive to make you a more proficient protector. Gain +1 Attack and +1 Spell Attack",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "AZ2=1:AZ6=1:AZ7=1:AZ8=1:AZ9=1:AZM=1"
    },
    {
      "id": 10011,
      "name": "Chitinous Growths",
      "description": "Gain +1 Physical and +1 Elemental Mitigation while not wearing armor",
      "mtype": "core",
      "location": "8a",
      "cost": 2,
      "data": "W0D4=1:W0DA=1"
    },
    {
      "id": 10012,
      "name": "Action [Daily] : Agitating Pheromones",
      "description": "You release pheromones within a radius equal to half your level that affects all Monsters, Beasts and Humanoids within the area who are not under the effect of your Party Link trait. Each creature must make a Resilience Check against 1d12 plus half your level or become either Maddened or Confused, which you must specifiy before using this ability.",
      "mtype": "core",
      "location": "8b",
      "cost": 2,
      "data": "XD1"
    },
    {
      "id": 10013,
      "name": "Action [Daily] : Hive Recruiter",
      "description": "You attempt to bring a humanoid under the effect of your party link closer to the hivemind by making a 1d12 check plus half your level against their resilience modifier. If successful, they are charmed by you until the end of your next full rest. If you successfully charm this humanoid three days in a row, they are absorbed into the hive.",
      "mtype": "core",
      "location": "9",
      "cost": 4,
      "data": "XD1"
    },
    {
      "id": 10014,
      "name": "Reaction [Daily] : Consult the Hive",
      "description": "In response to making a Skill Check, you consult the hive and gain their combined skills to aid you, granting you a 2d4 bonus.",
      "mtype": "core",
      "location": "a",
      "cost": 0,
      "data": "ZD1"
    },
    {
      "id": 10015,
      "name": "Hivemind",
      "description": "You are a member of a Klaktil Hive and have been absorbed into their unified mind. While the king or queen of the hive is alive and on the same celestial body as you, you are considered permanently charmed by the hive and are immune to charm effects from other sources. You no longer have the ability to focus but are considered to be alerted when you are conscious but are immune to the confused and maddened condition.",
      "mtype": "core",
      "location": "b",
      "cost": 0,
      "data": "TA"
    }
  ]
}