{
  "id": 105,
  "name": "Alchemist",
  "mtype": "core",
  "ruleset": 1,
  "options": [
    {
      "name": "Apprentice Alchemist",
      "description": "You have learned the fundamentals of mixing reagents and brewing potions. Gain +1 skill with alchemy.",
      "location": "1",
      "data": "CS3=1"
    },
    {
      "name": "Volatile Brews",
      "description": "You specialize in creating harmful substances using the victim's own biology against them. Gain +1 skill with medicine knowledge. The check to recover from the effects of poisons you create can never drop below a 4.",
      "location": "2a",
      "data": "SSP=1"
    },
    {
      "name": "Healing Draughts",
      "description": "You specialize in beneficial concoctions. Gain +1 skill with wildcraft knowledge. Healing potions you craft restore an additional die of health.",
      "location": "2b",
      "data": "SSM=1"
    },
    {
      "name": "Careful Mixing",
      "description": "Your precise methods create more potent results. Gain +1 skill with concentration. Potions you craft are harder to resist, with their required checks increased by 1.",
      "location": "3",
      "data": "SSJ=1"
    },
    {
      "name": "Action : Quick Application",
      "description": "You apply a poison or potion to a weapon or piece of ammunition as part of an attack action.",
      "location": "4a",
      "data": "XINE=0"
    },
    {
      "name": "Action : Spash Zone",
      "description": "You throw a potion or elixir a short (10 units) distance at an creature, activating it as if they had consumed it. The potion or elixir can also target a separate adjacent creature.",
      "location": "4b",
      "data": "XINE=1"
    },
    {
      "name": "Skilled Alchemist",
      "description": "Your alchemical skills have reached professional levels. Gain +1 skill with alchemy. When making alchemy checks, any roll under a 4 becomes a 3.",
      "location": "5",
      "data": "CS3=1:TC"
    },
    {
      "name": "Efficient Potions",
      "description": "You rely on experience when creating potions to increase the amount of product you make. You gain +1 logic. Additionally, the Batch Brewing infusion is always applied to your alchemy crafts, but the check is rolled separately as a single alchemy dice where a failure does not impact you negatively.",
      "location": "6a",
      "data": "SSL=1"
    },
    {
      "name": "Chemist",
      "description": "You are skilled in identifying and experimenting with alchemy. Gain +1 skill with academics and a bonus dice to checks to identify alchemical substances. Additionally, when attempting a recipe for the first time, if you roll an academics check greater than or equal to the check required by the recipe, you eliminate the first-time penalty.",
      "location": "6b",
      "data": "SSN=1"
    },
    {
      "name": "Legendary Alchemist",
      "description": "You have achieved mastery over the alchemical arts. Gain +1 talent and +1 skill with alchemy. When making alchemy checks, any roll under a 6 becomes a 5.",
      "location": "7",
      "data": "CT3=1:CS3=1"
    }
  ]
}