{
  "id": 105,
  "name": "Fabricator",
  "mtype": "core",
  "ruleset": 1,
  "options": [
    {
      "name": "Apprentice Smith",
      "description": "You have learned the fundamentals of metalworking and fabrication. Gain +1 skill with fabrication.",
      "location": "1",
      "data": "CS2=1"
    },
    {
      "name": "Metallurgy",
      "description": "You have studied metals and their properties. You gain +1 academics and roll a bonus dice when making checks that identify rocks, minerals or metal. Additionally, when you fail fabricating a weapon or piece of armor, you can spend an hour to recover 1 ingot from it if you successfully make an fabrication check of 6.",
      "location": "2a",
      "data": "SSN=1:TC"
    },
    {
      "name": "Scrapyard Smith",
      "description": "You have talent with making more with less. You gain +1 logic and do not suffer the first-time craft penalty for a recipe you have never made before. Additionally, you can spend 4 hours smelting down a weapon or piece of armor and recover 1 ingot from it if you make a fabrication check of 6.",
      "location": "2b",
      "data": "SSL=1:TC"
    },
    {
      "name": "Reaction : Brace",
      "description": "In response to making a deflection check or a check to avoid being displaced, roll an additional fabrication check with a single dice, adding it to the original check.",
      "location": "3",
      "data": "ZINE=1"
    },
    {
      "name": "Forge Labor",
      "description": "Working near a forge has strengthened your body and made you more tolerant of heat. Gain +1 skill with fitness and +1 heat mitigation.",
      "location": "4a",
      "data": "SSA=1:M2=1:TG"
    },
    {
      "name": "Hammer Strokes",
      "description": "You can swing a club as naturally as you swing your smithing hammer. Gain +1 skill with simple melee weapons and +1 skill with might.",
      "location": "4b",
      "data": "WS3=1:SSC=1:TG"
    },
    {
      "name": "Master Craftsman",
      "description": "Your fabrication skills have reached professional levels. Gain +1 skill with fabrication. When making fabrication checks, any roll under a 4 becomes a 3.",
      "location": "5",
      "data": "CS2=1:TC"
    },
    {
      "name": "Improved Weapons",
      "description": "You have focused on crafting superior arms. You roll a bonus dice when making a fabrication check to create a weapon.",
      "location": "6a",
      "data": "TG"
    },
    {
      "name": "Improved Armor",
      "description": "You have focused on crafting superior armor. You roll a bonus dice when making a fabrication check to create a piece of armor.",
      "location": "6b",
      "data": "TG"
    },
    {
      "name": "Legendary Artisan",
      "description": "You have achieved mastery over your craft. Gain +1 talent and +1 skill with fabrication. When making fabrication checks, any roll under a 6 becomes a 5.",
      "location": "7",
      "data": "CT2=1:CS2=1:TG"
    }
  ]
}