{
  "id": 105,
  "name": "Marksman",
  "mtype": "core",
  "ruleset": 1,
  "options": [
    {
      "name": "Fledgling Marksman",
      "description": "You have trained with several types of ranged weapons. Gain +1 skill with simple and complex ranged weapons.",
      "location": "1",
      "data": "WS4=1:WS6=1"
    },
    {
      "name": "Action : Pin Down",
      "description": "You make an attack with a ranged weapon against a large or smaller creature with legs, reducing their movement speed by 2. Your attack must deal damage for this effect to work.",
      "location": "2a",
      "data": "XINE=1"
    },
    {
      "name": "Action : Headshot",
      "description": "While making an attack with a simple or complex ranged weapon roll 1 less dice. Your first dice deals double damage if it hits, or triple if it is also a critical hit.",
      "location": "2b",
      "data": "XINE=1"
    },
    {
      "name": "Improved Aim",
      "description": "Your aiming is greatly improved, increasing your optimal range on simple and complex ranged weapons by 1.",
      "location": "3",
      "data": "AB=1:AD=1"
    },
    {
      "name": "Fletching",
      "description": "You are skilled at making your own ammunition. Gain +1 skill with engineering. When crafting ammunition or ranged weapons, roll an additional dice.",
      "location": "4a",
      "data": "CS1=1:TC"
    },
    {
      "name": "Focused",
      "description": "Marksman require a centered mind to achieve their potential. Gain +1 skill with concentration and coordination.",
      "location": "4b",
      "data": "SSJ=1:SSG=1:TG"
    },
    {
      "name": "Skilled Marksman",
      "description": "You have trained with several types of ranged weapons. Gain +1 skill with simple and complex ranged weapons.",
      "location": "5",
      "data": "WS4=1:WS6=1"
    },
    {
      "name": "Perfectly Precise",
      "description": "You can use an action to shoot an inanimate object without rolling a check, as long as it is within your optimal range. Additionally, you ignore partial cover when making attacks with ranged weapons.",
      "location": "6a",
      "data": "TG"
    },
    {
      "name": "Action : Marksman Stance",
      "description": "You enter a stance that allows you to utilize your concentration to improve your aim, granting you a bonus dice to all ranged and throwing attacks. This stance ends if your concentration is lost.",
      "location": "6b",
      "data": "XINE=0"
    },
    {
      "name": "Talented Marksman",
      "description": "Your relentless training has resulted in +1 talent with simple and complex ranged weapons.",
      "location": "7",
      "data": "WT4=1:WT6=1"
    }
  ]
}