{
  "id": 105,
  "name": "White Magic",
  "mtype": "core",
  "ruleset": 1,
  "options": [
    {
      "name": "Fledgling Cleric",
      "description": "You have honed your connection to the divine through disciplined devotion. Gain +1 skill with white magic.",
      "location": "1",
      "data": "YS4=1"
    },
    {
      "name": "Action : Bless",
      "description": "You target a weapon you can see within a short (10 units) radius. While you maintain your concentration, the weapon receives a bonus dice on attacks against dark or undead creatures.",
      "location": "2a",
      "data": "XIME=1"
    },
    {
      "name": "Action : Smite",
      "description": "You imbue a melee or brawling attack with radiant energy. If the attack hits, make a white magic check against the same defense the weapon targeted. On success, the target takes additional divine damage equal to the weapon's extra damage. If the target is an undead or dark creature, deal divine damage equal to the weapon's primary damage instead.",
      "location": "2b",
      "data": "XIME=1"
    },
    {
      "name": "Student of the Gods",
      "description": "You gain +1 to your magic skill and +1 to your academics skill.",
      "location": "3",
      "data": "SSO=1:SSN=1"
    },
    {
      "name": "Ancient Scripture",
      "description": "You unlock the Celestial language and gain +1 to your glyphcraft skill. Additionally, when you become proficient in the Celestial language, you can scribe spells you know to scrolls without requiring a check.",
      "location": "4a",
      "data": "CS5=1:TG"
    },
    {
      "name": "Halo",
      "description": "Your use of white magic has caused you to have subtle, radiant glow which you can transfer to objects, causing them to emit a gentle light in a 3-unit radius. Additionally, Gain +2 divine mitigation. ",
      "location": "4b",
      "data": "M6=2:TG"
    },
    {
      "name": "Skilled Cleric",
      "description": "Through prayer, ritual, and unshakable faith, your bond with white magic has deepened. Gain +1 skill with white magic.",
      "location": "5",
      "data": "YS4=1"
    },
    {
      "name": "Reaction : Divine Shield",
      "description": "In response to being the target of an attack that can be deflected, roll a deflection with a bonus dice. A success will result in the damage being completely mitigated as if the defender were using a heavy shield.",
      "location": "6a",
      "data": "ZINE=1"
    },
    {
      "name": "Daily Action : Lay Hands",
      "description": "You touch a creature and channel raw radiant energy into them, healing their wounds. Roll a white magic check to determine the amount healed.",
      "location": "6b",
      "data": "XDNE=1"
    },
    {
      "name": "Cleanser",
      "description": "Your relentless training has resulted in +1 talent with white magic spells.",
      "location": "7",
      "data": "YT4=1"
    }
  ]
}