{
  "id": 5,
  "name": "Scholars",
  "description": "Knowledge is Power\nScholar cultures prize knowledge, research, and intellectual pursuit above all else. They value wisdom, debate, and the preservation of information. To them, ignorance is the only true sin, and a life spent learning is a life well lived.",
  "culturalRestrictions": [
    {
      "name": "Historical Conscience",
      "description": "You cannot willingly destroy artifacts, texts, or structures with historical significance, believing all knowledge and cultural heritage should be preserved for future generations. Deliberately damaging or destroying items of historical, cultural, or scholarly value causes you to lose 3 resolve."
    },
    {
      "name": "Words Before Swords",
      "description": "You believe problems should be solved through intellect and discourse. Resorting to violence without first attempting negotiation, debate, or clever solutions causes you to lose 1 resolve."
    }
  ],
  "benefits": [
    {
      "name": "Encyclopedic Fixation",
      "description": "You pick a single knowledge skill; any information you learn in that category can always be recalled perfectly."
    },
    {
      "name": "Awe of Discovery",
      "description": "When you contribute to discovering an artifact, ruins or other forgotten knowledge, you gain 3 morale."
    }
  ],
  "startingItems": [
    {
      "name": "Scholar's Journal",
      "description": "A meticulously maintained journal where you record daily observations, interesting discoveries, and theoretical notes. Once per day, when investigating a mystery or trying to solve a complex problem, you can consult your accumulated observations to make a Logic check and gain a helpful clue or insight based on the quality of the check."
    },
    {
      "name": "Letter of Referral",
      "description": "A formal letter of introduction from a respected mentor, professor, or academic authority vouching for your scholarly credentials and character. This letter can be presented to gain access to libraries, universities, research facilities, or scholarly gatherings."
    },
    {
      "name": "Mark of Knowledge",
      "description": "A distinctive piece of jewelry, pin, or emblem that identifies you as a member of a recognized scholarly institution or academic society. Fellow scholars immediately recognize your credentials and will extend professional courtesy, while educated members of other cultures often show respect for your academic standing and expertise."
    }
  ],
  "options": []
}