{
  "id": 14,
  "name": "Urbanites",
  "description": "City Born and Bred\nUrbanite cultures are cosmopolitan societies adapted to dense population and complex social structures. They value connections, adaptability, and cultural sophistication. The city's pulse is their heartbeat.",
  "culturalRestrictions": [
    {
      "name": "Urban Comforts",
      "description": "You are used to having solid walls around you and a proper bed to sleep in. When you complete a full rest that is not favorable, you lose 1 resolve."
    },
    {
      "name": "Code of Civility",
      "description": "You solve problems through negotiation and social maneuvering, not violence. If you or your allies use intimidation or attack someone before attempting to talk or negotiate, you lose 2 resolve."
    }
  ],
  "benefits": [
    {
      "name": "Street Smarts",
      "description": "While in larger settlements, such as big towns or cities, you can instinctively tell if an area is dangerous by observing it. You also gain a bonus to all insight checks made against humanoids who dwell within those settlements."
    },
    {
      "name": "Cultural Sophistication",
      "description": "Living in an urban environement exposes you to all sorts of types of people, allowing you to have picked up basic parts of languages. You learn two additional languages at a basic level."
    }
  ],
  "startingItems": [
    {
      "name": "Pocket Watch",
      "description": "A precise timekeeper essential for city life's scheduling demands. This cherished mechanical creation does not stop ticking unless it is destroyed, allowing you to always tell the precise time of day as well as determine how much time has passed."
    },
    {
      "name": "Secret Pocket",
      "description": "You have a secret pocket embedded into either a piece of clothing or armor that can fit a small item. This pocket can only be discovered by a search check of 12 or higher."
    },
    {
      "name": "Crowd Cloak",
      "description": "A reversible cloak with different colors/patterns on each side, plus a hood that can dramatically change your silhouette. When you make a stealth check in an urban environement like a large town or city, you gain a bonus dice on that check."
    }
  ],
  "options": []
}