[
  {
    "name": "Acrobat",
    "id": 105,
    "option_1_name": "Cat-like Reflexes",
    "option_1_desc": "Your body moves with fluid, practiced motion and electric-fast reflexes. Gain +1 skill with coordination. When you fall prone, roll a d20; on an 13 or higher, you get up without any cost.",
    "option_1_data": "SSG=1:TG",
    "option_2a_name": "Light-footed",
    "option_2a_desc": "You move with supernatural grace and silence. Gain +1 skill with stealth. Your footsteps make no sound when moving at normal speed.",
    "option_2a_data": "SSF=1:TG",
    "option_2b_name": "Graceful Discipline",
    "option_2b_desc": "Your regular stretching routine has trained your mind to maintain focus through physical discipline. Gain +1 skill with concentration and +1 maximum resolve.",
    "option_2b_data": "SSJ=1:A2=1:TG",
    "option_3_name": "Reaction : Rolling Dodge",
    "option_3_desc": "In response to being targeted with a melee attack, you roll out of the way, moving to an adjacent tile. If you successfully evade the attack, you get a bonus dice to all evasion checks until the start of your turn. This effect can stack when using this reaction multiple times in a round.",
    "option_3_data": "Z",
    "option_4a_name": "Swift Climber",
    "option_4a_desc": "You can scale surfaces with remarkable speed and agility. Gain +1 skill with fitness. You climb at your full movement speed without penalty and can traverse impossible surfaces like smooth walls or ceilings, provided you end your movement on a surface where you can maintain your grip.",
    "option_4a_data": "SSA=1:TG",
    "option_4b_name": "Safe Fall",
    "option_4b_desc": "Gain +1 skill with coordination. You do not take damage from falling 5 or less units, and always land on your feet. Otherwise, the damage you take from falling is halved unless falling from 12 or more units.",
    "option_4b_data": "SSG=1:TD",
    "option_5_name": "Evasive Master",
    "option_5_desc": "Your ability to avoid attacks has reached professional levels. Gain +1 skill with evasion.",
    "option_5_data": "SSE=1:TD",
    "option_6a_name": "Daily Action : Escape Artist",
    "option_6a_desc": "You contort your body to slip free from any physical restraint. Automatically remove the impaired condition from yourself and immediately move up to your full movement speed. This movement does not provoke reactions.",
    "option_6a_data": "X",
    "option_6b_name": "Reaction : Catch",
    "option_6b_desc": "In response to falling or being forcibly displaced, you can grab onto an adjacent object, ledge, or structure to halt your movement by making a coordination check of 6 or higher.",
    "option_6b_data": "Z",
    "option_7_name": "Parkour Master",
    "option_7_desc": "You have mastered the art of fluid movement through any environment. Gain +1 movement speed. When you take the sprint action, you can jump at any point during your movement without using an additional action, and you are no longer required to move in a straight line.",
    "option_7_data": "A4=1:TG"
  },
  {
    "name": "Armsman",
    "id": 105,
    "option_1_name": "Weapon Collector",
    "option_1_desc": "You are adept at managing multiple weapons in combat. You can carry an additional weapon that can be drawn and equipped without using an action. Additionally, you can switch between carried weapons as part of any attack action.",
    "option_1_data": "TG",
    "option_2a_name": "Tactical Fighter",
    "option_2a_desc": "Your diverse weapon training has improved your battlefield awareness. Gain +1 skill with senses. You can identify the weapon type and fighting style of any armed opponent by observing them for one round.",
    "option_2a_data": "SSK=1:TG",
    "option_2b_name": "Master at Arms",
    "option_2b_desc": "Your knowledge of weapon construction and maintenance is extensive. Gain +1 skill with fabrication. If you spend an hour with any weapon, you learn the recipe on how to make it.",
    "option_2b_data": "CS2=1:TG",
    "option_3_name": "Reaction : Follow-Up",
    "option_3_desc": "In response to you making an attack with a melee weapon, reroll your melee weapon check and take that result, stead.",
    "option_3_data": "Z",
    "option_4a_name": "Blade Master",
    "option_4a_desc": "Your mastery of close combat weapons is exceptional. Gain +1 skill with simple melee weapons.",
    "option_4a_data": "WS3=1:TO",
    "option_4b_name": "Combat Veteran",
    "option_4b_desc": "Your extensive weapon training has honed your reflexes. Gain +1 skill with coordination.",
    "option_4b_data": "SSG=1:TG",
    "option_5_name": "Weapon Consistency",
    "option_5_desc": "You gain improved critials with complex weapons, causing even your extra dice to add the primary damage to your total roll.",
    "option_5_data": "TO",
    "option_6a_name": "Action : Disarming Parry",
    "option_6a_desc": "In response to being the target of a melee attack, attempt to forcefully block it by making an attack with a complex melee weapon. If the attacker is making their attack with a melee weapon, they must roll a coordination check of 6 or higher, or they drop their weapon.",
    "option_6a_data": "Z",
    "option_6b_name": "Action : Follow-Through",
    "option_6b_desc": "You make a devastating combination attack with two different weapons. Make an attack with a complex melee weapon, then immediately make an attack with a simple ranged weapon that you are wielding with one hand. The ranged attack ignores physical mitigation.",
    "option_6b_data": "X",
    "option_7_name": "Master Armsman",
    "option_7_desc": "You have achieved mastery over many forms of weaponry. Gain +1 skill with simple ranged weapons and +1 skill with complex melee weapons.",
    "option_7_data": "WS4=1:WS5=1:TO"
  },
  {
    "name": "Assassin",
    "id": 105,
    "option_1_name": "Death from Shadows",
    "option_1_desc": "You strike with lethal precision when enemies cannot see you coming. When you are hidden, all extra dice on weapon attacks become equal to primary damage instead of their normal extra damage value.",
    "option_1_data": "TO",
    "option_2a_name": "Action : Phantom Throw",
    "option_2a_desc": "You make a throwing attack while hidden. If the attack hits, the target becomes dazed until the end of their next turn. Roll a stealth check; on a 6 or higher, you remain hidden.",
    "option_2a_data": "X",
    "option_2b_name": "Action : Silencing Strike",
    "option_2b_desc": "You make a precise attack designed to prevent your target from calling for help. You make an unarmed attack that deals no damage, but strikes in a way that the target cannot speak or make noise until the end of their next turn if the attack hits.",
    "option_2b_data": "X",
    "option_3_name": "Shadow Walker",
    "option_3_desc": "You move through darkness like a living shadow. Gain +1 skill with stealth. When you kill a creature, the next stealth check you make before the start of your next turn gains a bonus dice.",
    "option_3_data": "SSF=1:TO",
    "option_4a_name": "Stalker",
    "option_4a_desc": "You can track and pursue targets relentlessly. Gain +1 skill with senses. You can automatically detect if someone you've seen before is within a short (10 unit) distance.",
    "option_4a_data": "SSK=1:TG",
    "option_4b_name": "Cold Blooded",
    "option_4b_desc": "Death doesn't affect you the way it affects others. Gain +1 skill with resilience. You are immune to any effects that cause a loss of resolve due to death.",
    "option_4b_data": "SSI=1:TG",
    "option_5_name": "Action : Assassinate",
    "option_5_desc": "You attempt to instantly kill a target with a single, precise strike. You must be hidden and adjacent to the target. Make a weapon attack with a weapon that has the piercing property. If the attack hits, the target dies instantly if they are minion tier, or if you roll 2 successful dice against grunt tier, or 3 successful dice against standard tier creatures.",
    "option_5_data": "X",
    "option_6a_name": "Poison Master",
    "option_6a_desc": "You have mastered the art of toxins and chemical warfare. Gain +1 skill with alchemy. When you poison a creature, the first time they take damage from it, they take it twice.",
    "option_6a_data": "CS3=1:TO",
    "option_6b_name": "Remote Kill",
    "option_6b_desc": "You have mastered the art of killing with traps. Gain +1 skill with engineering. When your traps do damage to a grunt or minion, they are executed even if the damage did not bring them to 0 health.",
    "option_6b_data": "CS1=1:TO",
    "option_7_name": "Master Assassin",
    "option_7_desc": "You have achieved legendary status as a dealer of death. Gain +1 skill with simple melee weapons and +1 skill with throwing weapons.",
    "option_7_data": "WS3=1:WS2=1:TO"
  },
  {
    "name": "Athlete",
    "id": 105,
    "option_1_name": "Physical Conditioning",
    "option_1_desc": "You have developed exceptional physical fitness through dedicated training. Gain +1 skill with fitness and +1 health.",
    "option_1_data": "SS9=1:TG",
    "option_2a_name": "Endurance Training",
    "option_2a_desc": "Your body has been conditioned to endure physical stress. Gain +1 skill with endurance. You can hold your breath for twice as long.",
    "option_2a_data": "SS1=1:TG",
    "option_2b_name": "Natural Athlete",
    "option_2b_desc": "Your coordination and agility are exceptional. Gain +1 skill with coordination and +1 movement speed.",
    "option_2b_data": "SSG=1:TG",
    "option_3_name": "Daily Action : Second Wind",
    "option_3_desc": "You dig deep to find reserves of energy when exhausted. Remove the winded condition, restore your energy completely and gain 2d4 morale that lasts for a minute.",
    "option_3_data": "X",
    "option_4a_name": "Action : Run and Jump",
    "option_4a_desc": "You take an enhanced sprint action, moving up to double your movement speed and then making a leap equal to your maximum jump distance at the end of your movement.",
    "option_4a_data": "X",
    "option_4b_name": "Reaction : Athletic Reflexes",
    "option_4b_desc": "In response to being targeted by an attack that you could normally block or deflect, you can instead use your athletic ability to avoid the attack. Make a fitness check in place of your normal deflection or evasion check, with a success meaning you avoid any damage.",
    "option_4b_data": "Z",
    "option_5_name": "Mind-Body Connection",
    "option_5_desc": "Your dedication to your body has resulted in a stronger willpower. Gain +1 resilience and +1 maximum energy.",
    "option_5_data": "SS9=1:TG",
    "option_6a_name": "Precision Thrower",
    "option_6a_desc": "Your training has perfected your throwing technique. Gain +1 skill with throwing weapons.",
    "option_6a_data": "WS0=1:TG",
    "option_6b_name": "Powerful Build",
    "option_6b_desc": "Your physical strength has reached impressive levels. Gain +1 skill with might and +2 health.",
    "option_6b_data": "SS0=1:TG",
    "option_7_name": "Legendary Athlete",
    "option_7_desc": "You have achieved legendary status in physical performance and the results are there for all to see. Gain +1 skill with fitness and +1 skill to presence. When competing in an athletic competition, roll a bonus dice to any physique or finesse checks.",
    "option_7_data": "SS9=1:TG"
  },
  {
    "name": "Barbarian",
    "id": 105,
    "option_1_name": "Frenzied Spirit",
    "option_1_desc": "When you take damage while below 10 health, you roll a resilience check. If the result is less than a 8, you enter a Frenzy which grants you a bonus dice on attack, endurance and might checks but a penalty dice on defense checks for the next minute. At the start of each of your successive turns, roll a resilience check: on a 2 or lower, you gain the maddened condition.",
    "option_1_data": "AE=1:TO",
    "option_2a_name": "Fear Unburdened",
    "option_2a_desc": "When you have morale, you are immune to the fear condition. Additionally, gain +1 psychic mitigation.",
    "option_2a_data": "TO",
    "option_2b_name": "Pushing the Limit",
    "option_2b_desc": "Gain +1 skill with endurance and +2 health. ",
    "option_2b_data": "TO",
    "option_3_name": "Reaction : Controlled Frenzy",
    "option_3_desc": "You have become skilled in controlling your frenzied rage. In response to taking damage, you may spend up to 5 resolve to intentionally enter a frenzy, gaining 1d4 morale for each spent that last for the next minute or until the frenzy ends.",
    "option_3_data": "TO",
    "option_4a_name": "Massive Weaponry",
    "option_4a_desc": "You gain +1 skill with complex melee weapons.",
    "option_4a_data": "TO",
    "option_4b_name": "The Old Way",
    "option_4b_desc": "You gain +1 skill with simple melee weapons and +1 skill with throwing.",
    "option_4b_data": "TO",
    "option_5_name": "Action : Savage Strike",
    "option_5_desc": "While under the effects of the Frenzy action, you make a savage melee attack, doubling your primary weapon damage.",
    "option_5_data": "TO",
    "option_6a_name": "Mind Over Matter",
    "option_6a_desc": "You gain +1 skill with resilience. When you receive a new mental condition, you can delay it taking effect until the end of your next turn.",
    "option_6a_data": "TO",
    "option_6b_name": "Imposing",
    "option_6b_desc": "You are an imposing figure, especially when you're angry. You gain +1 skill with presence and +1 skill with might.",
    "option_6b_data": "TO",
    "option_7_name": "Battle Shout",
    "option_7_desc": "When you enter a frenzy with the Controlled Frenzy reaction, any ally within a short radius (10 units) gains half of the total morale you generated, lasting for a minute.",
    "option_7_data": "TO"
  },
  {
    "name": "BattleDancer",
    "id": 209,
    "option_1_name": "Flowing Strikes",
    "option_1_desc": "Your attacks are woven together in a masterclass performance. Gain +1 skill with expression. When you score a critical hit on an unarmed attack, roll an additional expression dice as if it were part of the same attack.",
    "option_1_data": "SSG=1:TO",
    "option_2a_name": "Action : Sweeping Kick",
    "option_2a_desc": "You make a modified shove attack against a large or smaller creature, using your expression instead of might for your check. On a success, your target is knocked prone and takes 2 fall damage.",
    "option_2a_data": "X",
    "option_2b_name": "Reaction : Kip-Up Strike",
    "option_2b_desc": "While prone, you acrobatically get to your feet while simultaneously making an attack with a simple melee or unarmed strike against an adjacent creature using your expression skill as the attack roll.",
    "option_2b_data": "Z",
    "option_3_name": "Battle Dancer",
    "option_3_desc": "The battle dance lets you weave together devastating strikes with your hands, feet, and head. Gain +1 skill with unarmed strikes.",
    "option_3_data": "SSE=1:TO",
    "option_4a_name": "Graceful Movements",
    "option_4a_desc": "Your graceful movements and well-timed gestures allow you to slip beyond an opponent's reach. Gain +1 skill with fitness. When you provoke an attack of opportunity by moving outside of a creature's melee range, you can use your expression skill instead of a normal defensive roll against the attack.",
    "option_4a_data": "SSA=1:TO",
    "option_4b_name": "Rhythm Master",
    "option_4b_desc": "Battled dancing demands perfect timing. Gain +1 skill with coordination. After all combatants have rolled initiative, you can move your position to anywhere lower in the order at the start of combat.",
    "option_4b_data": "SSB=1:TO",
    "option_5_name": "Action : Spinning Strikes",
    "option_5_desc": "AOE Attack",
    "option_5_data": "X",
    "option_6a_name": "Blade Dancer",
    "option_6a_desc": "Gain +1 skill with simple weapons. Your flowing strikes trait applies to attacks with simple weapons.",
    "option_6a_data": "WS3=1:TO",
    "option_6b_name": "Shadow Dancer",
    "option_6b_desc": "Gain +1 skill with throwing weapons. Your flowing strikes trait applies to attacks with throwing weapons.",
    "option_6b_data": "SSF=1:TO",
    "option_7_name": "Dance of the DDD",
    "option_7_desc": "You gain +1 skill with evasion and deflection.",
    "option_7_data": "SSG=1:SSE=1:TO"
  },
  {
    "name": "Berserker",
    "id": 105,
    "option_1_name": "Battle-Hardened",
    "option_1_desc": "Your body has been conditioned through countless battles and hardships. Gain +1 skill with endurance. When making a check to stay conscious, make an endurance check instead of resilience.",
    "option_1_data": "SS1=1:TO",
    "option_2a_name": "Last Stand",
    "option_2a_desc": "Once per day, when you reach 0 health, you roll an endurance check and gain morale equal to the highest dice rolled. While you have this morale, reroll any death check that results in a 1.",
    "option_2a_data": "TO",
    "option_2b_name": "Killing Frenzy",
    "option_2b_desc": "Combat invigorates you rather than wearing you down. Gain +1 skill with might. When you kill a creature with a melee weapon, gain an additional action once per turn.",
    "option_2b_data": "SS0=1:TO",
    "option_3_name": "Action : Devastating Blow",
    "option_3_desc": "You make an attack with a melee weapon, but instead of making an attack with your melee weapon skill, make it with your might skill check. All dice that hit deal damage equal to your primary weapon damage. If you are above 10 health and use this ability, you gain the winded condition.",
    "option_3_data": "TO",
    "option_4a_name": "Reaction : Vengeful Strike",
    "option_4a_desc": "In response to taking more than 10 damage from a creature within your melee range after calculating mitigations, you can immediately make a vicious counterattack against them. Make both an attack check and a might check, then add the highest dice from your might check to your attack dice pool for this strike.",
    "option_4a_data": "TO",
    "option_4b_name": "Reaction : Endure Pain",
    "option_4b_desc": "In response to being targeted by an attack, you let it hit you but you make an endurance check against the attack roll. If you are successful, the damage is halved.",
    "option_4b_data": "TO",
    "option_5_name": "Weapon Master",
    "option_5_desc": "Your mastery of heavy weapons has reached professional levels. Gain +1 skill with complex melee weapons.",
    "option_5_data": "WS3=1:TO",
    "option_6a_name": "Scarred Veteran",
    "option_6a_desc": "You have a reputation for being hard to take down. Gain +1 physical mitigation and +2 health.",
    "option_6a_data": "TO",
    "option_6b_name": "Twin Fury",
    "option_6b_desc": "You have the coordination and strength to wield heavy weapons in your offhand. Gain +1 coordination. You can dual wield any one-handed melee weapon, not just light weapons.",
    "option_6b_data": "SSG=1:TO",
    "option_7_name": "Deathless Rage",
    "option_7_desc": "While at 0 health, you completely restore your energy when you hit a creature with an action. Additionally, gain +1 maximum energy.",
    "option_7_data": "TO"
  },
  {
    "name": "Bloodmage",
    "id": 105,
    "option_1_name": "Blood Letter",
    "option_1_desc": "You have experience with letting your own blood without causing yourself injury. Gain +2 health. As an action, you can give yourself the bleeding condition.",
    "option_1_data": "SS1=1:TO",
    "option_2a_name": "Hemocraft",
    "option_2a_desc": "Your knowledge of medicine allows you determine how to maximize bloodloss. Gain +1 skill with medicine. When you cause the bleeding condition on a creature other than yourself, the check to stop the bleeding is increased by 2.",
    "option_2a_data": "SS3=1:TO",
    "option_2b_name": "Crimson Focus",
    "option_2b_desc": "Gain +1 skill with endurance. When you are forced to make a concentration check to maintain a spell, use an endurance check instead.",
    "option_2b_data": "SS4=1:TO",
    "option_3_name": "Blood Channeling",
    "option_3_desc": "While you have the bleeding condition, you roll a bonus dice on all spell checks. Additionally, if you are below 5 health and bleeding, your spells becomes automatically charged.",
    "option_3_data": "TO",
    "option_4a_name": "Action : Hemokinesis",
    "option_4a_desc": "You can control the flow of blood with your mind with a moderate (20 unit) distance. You can use this action to either stop a creature from bleeding or cause a creature to bleed by forcing them to make an endurance check of 6 or higher.",
    "option_4a_data": "TO",
    "option_4b_name": "Reaction : Blood Trail",
    "option_4b_desc": "In response to taking physical damage while you have the bleeding condition, you manipulate your blood to become acidic and splash it on any adjacent creature dealing toxic damage equal to half of the physical damage taken. If a creature takes damage from your blood trail, you can sense their direction for the next 3 days.",
    "option_4b_data": "SSN=1:TO",
    "option_5_name": "Controlled Bleeds",
    "option_5_desc": "Gain +1 Resilience. When you have the bleeding condition, you only take 1 damage instead of 2.",
    "option_5_data": "TO",
    "option_6a_name": "Sanguine Power",
    "option_6a_desc": "Your connection to blood magic has deepened considerably. Gain +1 skill with black magic",
    "option_6a_data": "TO",
    "option_6b_name": "Dark Empathy",
    "option_6b_desc": "When you are bleeding and deal physical or dark damage to another creature that is bleeding with a spell, you regain 2 health. ",
    "option_6b_data": "TO",
    "option_7_name": "Daily Action : Exsanguinate",
    "option_7_desc": "You target a humanoid or beast corpse within a short (10 units) distance that has died within the last minute and drain their blood to heal yourself. The amount of health restored depends on the creature's tier: minion tier restores 2 health, grunt tier restores 5 health, standard tier restores 10 health, and champion tier or higher restores you to full health.",
    "option_7_data": "TO"
  },
  {
    "name": "Bruiser",
    "id": 105,
    "option_1_name": "Tough",
    "option_1_desc": "Gain +1 skill with endurance. Also, you ignore the first time you would become winded during combat.",
    "option_1_data": "AE=1:TO",
    "option_2a_name": "Slugger",
    "option_2a_desc": "Once per round, on any Action or Reaction, when you make a melee attack, you can also make an unarmed attack. The round resets at the start of your turn.",
    "option_2a_data": "TO",
    "option_2b_name": "Engager",
    "option_2b_desc": "You are usually first to join the fray. Gain +1 skill with coordination. On the first turn of combat, your free movement speed during your turn is doubled.",
    "option_2b_data": "TO",
    "option_3_name": "Vitality",
    "option_3_desc": "You are naturally more hardy than others. Gain +3 health.",
    "option_3_data": "TO",
    "option_4a_name": "Action : Bodyblow",
    "option_4a_desc": "You make an unarmed attack at a creature that is your size or smaller. If the attack hits, the target loses 1 energy.",
    "option_4a_data": "TO",
    "option_4b_name": "Action : Pummel",
    "option_4b_desc": "You make a vicious attack with either an unarmed or melee weapon that has the bludgeon tab. If at least 3 dice hit, the target becomes dazed. If 3 dice are all 8 or higher, the target becomes stunned.",
    "option_4b_data": "TO",
    "option_5_name": "Powerful Parry",
    "option_5_desc": "Gain +1 skill with deflection. If a creature hard fails an attack with a melee weapon against your deflection check, they drop their weapon.",
    "option_5_data": "TO",
    "option_6a_name": "Heavy Hitter",
    "option_6a_desc": "Gain +1 skill with complex melee weapons.",
    "option_6a_data": "TO",
    "option_6b_name": "Street Fighter",
    "option_6b_desc": "Gain +1 skill with unarmed attacks.",
    "option_6b_data": "TO",
    "option_7_name": "Action : Curbstomp",
    "option_7_desc": "You target a creature that is prone and making a devestating attack at them, using your might as your attack roll against a contested evasion or deflection check. For each dice that hit, deal 4 damage plus the physical mitigation value on your boots. Minions and thralls have a penalty dice against this attack and are executed if any of the dice hit.",
    "option_7_data": "TO"
  },
  {
    "name": "Bulwark",
    "id": 105,
    "option_1_name": "Reaction : Shield Wall",
    "option_1_desc": "In response to making a deflection check while using a shield, roll a bonus dice to add to your defense check on any deflection checks you make before the start of your next turn. However, all attacks you make have a penalty dice and you cannot take the sprint action.",
    "option_1_data": "TD",
    "option_2a_name": "Solid Footing",
    "option_2a_desc": "When under the effect of your Shield Wall reaction or the Defensive Action, you cannot be displaced or knocked prone.",
    "option_2a_data": "SS1=1:TD",
    "option_2b_name": "Glancing Blows",
    "option_2b_desc": "You are proficient with using your shield to deflect blows. Gain +1 physical mitigation.",
    "option_2b_data": "SSG=1:TD",
    "option_3_name": "Action : Shield Bash",
    "option_3_desc": "You strike an adjacent enemy with your shield. Make a deflection check as your attack roll against their evasion or deflection. If you hit, the target takes physical damage as if your shield was a weapon with 3 primary and 2 secondary damage.",
    "option_3_data": "TD",
    "option_4a_name": "Open the Gap",
    "option_4a_desc": "Gain +1 skill with coordination. When you shield bash an enemy and successfully deal damage, your next attack before the start of your next turn gains 2 bonus dice.",
    "option_4a_data": "TD",
    "option_4b_name": "Mighty Guard",
    "option_4b_desc": "Gain +1 skill with might. When you hit a medium or smaller creature with your shield bash and deal damage, you can shove them back 2 units.",
    "option_4b_data": "TD",
    "option_5_name": "Master Defender",
    "option_5_desc": "Your defensive skills have reached professional levels. Gain +1 skill with deflection.",
    "option_5_data": "SSH=1:TD",
    "option_6a_name": "Reaction : Hold the Line",
    "option_6a_desc": "In response to a large or smaller creature attempting to move past you within your melee weapon's reach, you can make an attack of opportunity. If the attack hits, the creature cannot willfully move into an area where your weapon could reach it.",
    "option_6a_data": "TD",
    "option_6b_name": "Reaction : Mass Cover",
    "option_6b_desc": "You quickly move up to 3 units and position your shield to protect multiple allies from area effect attacks. All allies within 2 units behind you in that direction gain the benefit of your shield's protection against the next area effect that targets them this round.",
    "option_6b_data": "TD",
    "option_7_name": "Improved Shield Bash",
    "option_7_desc": "Your shield bashes are exceptionally effective. When you get a critical hit with your Shield Slam, the target becomes dazed. If you get 2 or more critical hits, the target becomes stunned instead.",
    "option_7_data": "TD"
  },
  {
    "name": "Devout",
    "id": 105,
    "option_1_name": "Sworn Dedication",
    "option_1_desc": "You devote yourself to a divine being or sacred force, vowing to uphold its tenets. Your creed demands the destruction of undead and dark-aligned creatures. You cannot willfully aid these beings or channel dark magic without forsaking your oath. Through your faith, you gain +2 maximum resolve.",
    "option_1_data": "AE=1:TD",
    "option_2a_name": "Sacred Vessel",
    "option_2a_desc": "Your body has become a conduit for energy. Gain +2 mitigation to aether damage. When you take 5 or more divine after mitigation is calculated, you gain +2 energy.",
    "option_2a_data": "TD",
    "option_2b_name": "Fortified from Darkness",
    "option_2b_desc": "You gain +2 dark mitigation. When defending against a dark magic spell, gain a bonus dice.",
    "option_2b_data": "TD",
    "option_3_name": "Divine Charge",
    "option_3_desc": "When you roll an 8 or higher on a divine magic spell check with the radiant subschool, it becomes charged. This does not work if you have broken your tenets without receiving penance",
    "option_3_data": "TG",
    "option_4a_name": "Advisor",
    "option_4a_desc": "You gain +1 skill with insight. Additionally, you can grant an ally +1 resolve during each full rest.",
    "option_4a_data": "TD",
    "option_4b_name": "Crusader",
    "option_4b_desc": "You openly bear the symbol of your faith, and your words carry divine authority. Gain +1 skill with presence. Accusations you make against those who consort with darkness are taken seriously by the faithful. Institutions aligned with your deity will offer shelter, healing, and support to you and your allies, so long as you remain in good standing.",
    "option_4b_data": "TG",
    "option_5_name": "Dedicated",
    "option_5_desc": "Your service to the heavens has given you a closer connection to the gods. You gain +1 skill with divine magic.",
    "option_5_data": "TG",
    "option_6a_name": "Action : Brand the Wicked",
    "option_6a_desc": "You mark a creature, branding them and making them more suspectible to divine attacks. Any divine damage that strikes this enemy is not affected by divine mitigation.",
    "option_6a_data": "TO",
    "option_6b_name": "Daily Reaction : Reward the Faithful",
    "option_6b_desc": "In response to making a resilience check, you can choose to succeed at the cost of 1 resolve. If you have broken your tenets without receiving penance, you must spend 5 resolve instead.",
    "option_6b_data": "TD",
    "option_7_name": "Cleansing Word",
    "option_7_desc": "When you restore health to a creature, you also cleanse them of any disease, poison or exhaustion.",
    "option_7_data": "TD"
  },
  {
    "name": "Diplomat",
    "id": 207,
    "option_1_name": "First Impression",
    "option_1_desc": "You know how profound a first impression can be and spend extra effort to ensure you leave a good one. Gain +1 skill with persuasion. The first social check you make against a creature gains a bonus dice.",
    "option_1_data": "SST=1:TO",
    "option_2a_name": "Iron Composure",
    "option_2a_desc": "Negotaiting isn't always friendly, and you have been the target of some colorful language. You gain +2 maximum resolve and +2 psychic mitigation.",
    "option_2a_data": "X",
    "option_2b_name": "Divine Patience",
    "option_2b_desc": "Your experience with tense mediation has cause you to have an almost supernatural level of patience. Gain +1 skill with resilience. You roll a bonus dice against checks against the becoming maddened.",
    "option_2b_data": "Z",
    "option_3_name": "Reaction : Parley",
    "option_3_desc": "In response to a creature that you share a language with taking a violent action, you attempt to force them to reconsider by making a contested persuasion check against their resilience. On a success, the target can still choose to take the action but with two penalty dice. If the creature elects to not take their action, they will immediately use it as a reaction without expending energy if anyone takes a hostile act towards them or their allies.",
    "option_3_data": "SSS=1:TO",
    "option_4a_name": "Cultural Knowledge",
    "option_4a_desc": "You gain +1 skill with academics. When making any knowledge check involving the rituals, ceremonies or customs involving another culture, you gain a 1 bonus dice.",
    "option_4a_data": "SSR=1:TO",
    "option_4b_name": "Travel Experience",
    "option_4b_desc": "You are extremely worldly, having experienced many cultures and dealt with many negotations. Gain +4 language points. Additionally, when you spend at least a month in a settlement, you learn the local language at a basic level.",
    "option_4b_data": "SSS=1:TO",
    "option_5_name": "Read the Room",
    "option_5_desc": "You can quickly assess social dynamics. Gain +1 skill with insight. When entering a new social situation, you can determine what creature, if any, is in charge or has any authority.",
    "option_5_data": "X",
    "option_6a_name": "Action : Cutting Words",
    "option_6a_desc": "You target an enemy that you share at least one language with that you are fluent in and make an attack roll using your persuasion skill against their insight in an attempt to influence them. You deal 5 psychic damage for each success you have. If you have 3 or more successes, you can instead choose to give the target either the confused or maddened conditions.",
    "option_6a_data": "SSR=1:TO",
    "option_6b_name": "Action : Demand Surrender",
    "option_6b_desc": "You target a creature that you share at least one language with that you are fluent in and force them to make a resilience check against your contested persuasion check. If the target of this ability is above 5 health, the result of their resilience check is doubled. If a creature has 0 health or 0 resolve, their resilience check is halved instead.",
    "option_6b_data": "SSQ=1:LG",
    "option_7_name": "Wordsmith",
    "option_7_desc": "You seem to always know the right thing to say. You gain +1 skill with persuasion. When you make a persuasion check, the minimum dice value you can roll is a 6.",
    "option_7_data": "SST=1:SSR=1:X"
  },
  {
    "name": "Druid",
    "id": 105,
    "option_1_name": "Animal Companion",
    "option_1_desc": "You gain +1 skill with wildcraft. When you have a beast or plantoid as a pet or under your command, you can experience their senses as long as they are within a moderate (20 unit) distance from you.",
    "option_1_data": "AE=1:TG",
    "option_2a_name": "Beastial Spirit",
    "option_2a_desc": "You are infused with the spirit of the beast. Gain +1 skill with athletics and +1 movement speed.",
    "option_2a_data": "TG",
    "option_2b_name": "Natural Diet",
    "option_2b_desc": "Your experience in the outdoors has given you a great eye for fungi, herbs and spices. Gain +1 health and +1 skill with cooking. Additioanally, when foraging or identifying plants or fungi, gain a bonus dice to your checks.",
    "option_2b_data": "TD",
    "option_3_name": "Action : Shapeshift",
    "option_3_desc": "You transform into a beast that you have encountered before that is of the minion or grunt tier with maximum health equal to either your current health or the health of the creature's statblock, whichever is lower. While transformed in this way, you retain your social, mental and knowledge skills, but use the beasts stats for everything else. If you reach 0 health while shapeshifted, you return to your usual form with 0 health.",
    "option_3_data": "TG",
    "option_4a_name": "Action : Fungal Regrowth",
    "option_4a_desc": "You channel a spell that has an instantaneous effect on another creature, but heal yourself for the same amount, ignoring any threshold limitations.",
    "option_4a_data": "TD",
    "option_4b_name": "Action : Nature's Wrath",
    "option_4b_desc": "You channel a primal spell from the nature subschool and increase the check to avoid it by 2.",
    "option_4b_data": "TO",
    "option_5_name": "Nature Magic",
    "option_5_desc": "Your talent to bend the forces of nature is well documented. You gain +1 skill with primal magic.",
    "option_5_data": "TG",
    "option_6a_name": "Greater Shift",
    "option_6a_desc": "Your Shapeshift Action allows you to turn into standard tier beasts you have encountered. Additionally, when you are transformed, you can use your unarmed skill to replace any attack check on the beast's statblock.",
    "option_6a_data": "TO",
    "option_6b_name": "Defiler",
    "option_6b_desc": "You use the dark arts to taint the natural order. Gain +1 skill with black magic and learn the Raise Beast spell which you can channel once a day with an automatic success.",
    "option_6b_data": "TG",
    "option_7_name": "Archdruid",
    "option_7_desc": "You effortlessly command the power of nature, allowing you to speak to plantoids and beasts as if you were under the effect of the spells that grant that power. Additionally, you can command plants as an action, such as commanding vines or tree branches to perform simple tasks like shove, grapple or assist using your primal magic skill as a check.",
    "option_7_data": "TG"
  },
  {
    "name": "Dual Wielder",
    "id": 105,
    "option_1_name": "Two-Weapon Fighting",
    "option_1_desc": "You have learned to fight effectively with a simple melee weapons in each hand. Gain +1 skill with coordination. When dual wielding, your offhand attacks roll with only a single penalty dice.",
    "option_1_data": "SSG=1:TO",
    "option_2a_name": "Action : Disengaging Strike",
    "option_2a_desc": "You attack with your offhand weapon while using your main weapon to defend. Make an offhand attack and immediately move up to 3 units. Until the start of your next turn, reroll any deflection or evasion dice that land on the 1 face.",
    "option_2a_data": "TO",
    "option_2b_name": "Action : Synchronized Strikes",
    "option_2b_desc": "You coordinate both weapons in a devastating combination. Until the end of your turn, your weapon damage cannot be reduced by physical mitigation.",
    "option_2b_data": "TO",
    "option_3_name": "Stamina",
    "option_3_desc": "You have adpated to the stamina requirements for swinging two weapons in compbat. Gain +1 skill with fitness and +1 maximum energy.",
    "option_3_data": "TO",
    "option_4a_name": "Weapon Finesse",
    "option_4a_desc": "Wielding two weapons has improved your footwork, allowing you to dance around your enemies' strikes. Gain +1 skill with evasion",
    "option_4a_data": "SSI=1:TO",
    "option_4b_name": "Inpenetrable Defense",
    "option_4b_desc": "You utilize your dual weapons to create an impenetrable defense. Gain +1 skill with deflection.",
    "option_4b_data": "SSH=1:TO",
    "option_5_name": "Weapon Master",
    "option_5_desc": "Your mastery of light weapons has reached professional levels. Gain +1 skill with simple melee weapons.",
    "option_5_data": "WS2=1:TO",
    "option_6a_name": "Reaction : Cross Block",
    "option_6a_desc": "In response to being targeted by a melee attack, you cross both weapons to block. Make a deflection check with a bonus dice. If you successfully deflect the attack, instead of taking half damage from a deflection check without a shield, you take none.",
    "option_6a_data": "TO",
    "option_6b_name": "Reaction : Dual Opportunity",
    "option_6b_desc": "In response to a creature leaving or enterting a tile adjacent to you, you make an attack with both your main and offhand",
    "option_6b_data": "TO",
    "option_7_name": "Ambidextrous",
    "option_7_desc": "You have achieved perfect coordination with both hands. You no longer have a penalty dice when making offhand attacks, rolling with your full talent. Additionally, you can make up to 2 offhand attacks per turn instead of the normal limit of 1.",
    "option_7_data": "TO"
  },
  {
    "name": "Elementalist",
    "id": 105,
    "option_1_name": "Primal Attunement",
    "option_1_desc": "Your deep communion with primal forces has opened new pathways of understanding. Gain +1 to your magic skill and +1 spell capacity.",
    "option_1_data": "AE=1:TG",
    "option_2a_name": "Weathersense",
    "option_2a_desc": "Your mastery of the elements extends into the weather systems of the world. Gain +1 skill with senses. Additionally, you can reliably predict the weather for the next day and predict natural catacylsms like earthquakes, hurricanes and erruptions up to a week in advance.",
    "option_2a_data": "TG",
    "option_2b_name": "Reaction : Electric Rod",
    "option_2b_desc": "In response to being targeted by electric damage, you can choose to absorb the electrical energy instead of resisting it. The electric damage is doubled before your mitigation is applied, but on your next turn you gain an extra action and recover all of your energy at the start of that turn.",
    "option_2b_data": "TD",
    "option_3_name": "Specialization",
    "option_3_desc": "You form a bond with one of the elemental planes, learning its language. Additionally, you can attempt to sense elementals in a moderate (20 units) distance with an action.",
    "option_3_data": "TG",
    "option_4a_name": "Action : Enhanced Control",
    "option_4a_desc": "Your mastery allows surgical precision with destructive forces. When channeling area effect spells, you can shape them to avoid harming allies",
    "option_4a_data": "TG",
    "option_4b_name": "Action : Elemental Weaver",
    "option_4b_desc": "You channel a primal spell. If it succeeds, all primal spells you channel before the start of your next turn are rolled with a bonus dice. Using this ability multiple times on a single turn allows this bonus to be stacked.",
    "option_4b_data": "TO",
    "option_5_name": "Master of the Elements",
    "option_5_desc": "You have mastered the elements. Gain +1 skill with primal magic.",
    "option_5_data": "TG",
    "option_6a_name": "Elemental",
    "option_6a_desc": "When you summon an elemental using primal magic, it does not require your concentration to maintain and serves you until it dies, although it still counts against your pet limit.",
    "option_6a_data": "TG",
    "option_6b_name": "Attuned",
    "option_6b_desc": "You gain +1 mitigation to cold, heat and electric damage. Additionally, you are immune from damage from non-magical sources of heat, cold or electric such as weather or natural phenomenon.",
    "option_6b_data": "TD",
    "option_7_name": "Daily Action : Cataclysm",
    "option_7_desc": "You channel a primal spell that deals damage, infusing it with a large amount of energy increasing it's destructive power. The damage of the spell is doubled and the radius is increased by 2. If the spell only targets a single creature or point, the radius becomes 2.",
    "option_7_data": "TO"
  },
  {
    "name": "Gladiator",
    "id": 107,
    "option_1_name": "Pit Fighter",
    "option_1_desc": "You have the aura of a combatant. Gain +1 skill with presence. When you are in a settlement, you can spend a few hours to determine if there are any sanctioned or illegal fighting leagues, clubs or competitions.",
    "option_1_data": "",
    "option_2a_name": "Battle Conditioning",
    "option_2a_desc": "You have the body of a fighter, lean from battle. Gain +1 skill with fitness. When you start your turn winded, roll a fitness check; if the result is higher than a 7, the condition is removed automatically.",
    "option_2a_data": "SSQ=1",
    "option_2b_name": "Javelin Master",
    "option_2b_desc": "Taking down opponents before they get to you is a cherished skill in the arena. Gain +1 skill with throwing weapons.",
    "option_2b_data": "SSG=1",
    "option_3_name": "Thick Skin",
    "option_3_desc": "Jeering crowds do not affect you. Gain +2 maximum resolve. Additionally, you are immune from effects that would mock, provoke or taunt you.",
    "option_3_data": "SSR=1",
    "option_4a_name": "Action : Make Space",
    "option_4a_desc": "You strike and fade away in one fluid motion. Make a single attack against up to 2 adjacent creatures with a slashing melee weapon, then move 1 unit. Targets damaged by this attack cannot make attacks of opportunity against you.",
    "option_4a_data": "X",
    "option_4b_name": "Action : Leaping Thrust",
    "option_4b_desc": "You leap through the air and drive your weapon downward with devastating force. Take the Jump action toward a creature, then make a melee attack with a piercing weapon. Deal additional damage equal to the distance jumped in units.",
    "option_4b_data": "X",
    "option_5_name": "Weapons of the Arena",
    "option_5_desc": "You've mastered the tools of the gladiatorial trade. Gain +1 skill with simple melee weapons.",
    "option_5_data": "WS2=1",
    "option_6a_name": "Reaction : Combat Improv",
    "option_6a_desc": "In response to rolling a 1 on an attack or defense dice, make an expression check and replace the 1 with the the result of your check.",
    "option_6a_data": "Z",
    "option_6b_name": "Action : Called Shot",
    "option_6b_desc": "You target a limb on a large or smaller creature with a melee weapon attack, dealing damage. If 3 or more dice hit, you can target a limb to disable. At the end of each turn, the target must roll an endurance check of 7 or higher to regain function of the limb. If 3 or more dice crit, this attack amputates the chosen limb instead. This attack can be used against huge creatures, but the dice requirements are raised to 4.",
    "option_6b_data": "X",
    "option_7_name": "Glory Strikes",
    "option_7_desc": "When you land a killing blow against creature of a standard tier or higher with a melee or throwing attack, you gain 2 morale. If the attack was a critical hit, you gain 4 instead.",
    "option_7_data": ""
  },
  {
    "name": "Historian",
    "id": 105,
    "option_1_name": "Daily Action : Scholar's Memory",
    "option_1_desc": "You can recall useful information about a humanoid, beast or monster creature you encounter for the first time. Make an academics check to determine what you remember: on a 6-9, you learn a single target's weakest mitigation type and one condition they are not immune to. On a 10 or higher, you learn their two weakest mitigation types and two conditions they are not immune to.",
    "option_1_data": "SSS=1:TG",
    "option_2a_name": "Art of War",
    "option_2a_desc": "You have studied military history and tactical theory extensively. Gain +1 skill with logic. If you successfully use your Scholar's Memory action, you also gain your choice of a bonus dice to attack checks or defense checks until the end of combat against your target and any identical creatures.",
    "option_2a_data": "SSL=1:TG",
    "option_2b_name": "Arcane Studies",
    "option_2b_desc": "You have delved into the histories of magical creatures and otherworldly beings. Gain +1 skill with magic knowledge. Your Scholar's Memory ability works on magical creatures such as elementals, constructs, divine and dark types.",
    "option_2b_data": "SS3=1:TG",
    "option_3_name": "Walking Library",
    "option_3_desc": "Your mind is a repository of countless facts and figures. Gain +1 skill with academics. When you help an ally make an academics check, your help dice replaces their check if it is higher.",
    "option_3_data": "SSQ=1:TG",
    "option_4a_name": "Ancient Languages",
    "option_4a_desc": "You are experienced in ancient, and sometimes exotic languages. Gain +1 skill with expression and learn 2 magical languages at a basic level.",
    "option_4a_data": "SSR=1:TG",
    "option_4b_name": "Lore of the Ancients",
    "option_4b_desc": "You can identify the history and properties of ancient items and architecture. Gain +1 skill with resilience. You can spend 10 minutes examining an object or structure to learn its history, purpose, and any special properties. You gain a bonus dice on this check if the item is related to your chosen specialization (military artifacts for Art of War, magical items for Arcane Studies).",
    "option_4b_data": "SS2=1:TG",
    "option_5_name": "Studious",
    "option_5_desc": "Your dedication to research has sharpened your focus. Gain +1 skill with concentration. When you spend at least 1 hour researching a creature, faction or entity, you gain a bonus dice to your academics check for your Scholar's Memory action.",
    "option_5_data": "SSN=1:TG",
    "option_6a_name": "Ancient Song",
    "option_6a_desc": "You've discovered and mastered a song from ages past. Gain +1 skill with expression. You learn 1 song of any difficulty and become proficient in one musical skill.",
    "option_6a_data": "TG",
    "option_6b_name": "Living Archive",
    "option_6b_desc": "Immediately after completing a full rest, make an academics check and note the highest number. Until your next full rest, you can replace one of your academics dice rolls with that number.",
    "option_6b_data": "TG",
    "option_7_name": "Action : Second Edition",
    "option_7_desc": "You dedicate your concentration to clearing your memory, allowing your Scholar's Memory action to refresh at the start of your next turn. Additionally, you can now use it on creatures you've previously attempted to recall information about, even if those attempts failed.",
    "option_7_data": "TG"
  },
  {
    "name": "Hordeslayer",
    "id": 110,
    "option_1_name": "Horde Fighting",
    "option_1_desc": "You excel at navigating chaotic melees. You do not provoke opportunity attacks or reactions triggered based on movement from minions, thralls or swarms.",
    "option_1_data": "",
    "option_2a_name": "Action : Chaos Strike",
    "option_2a_desc": "You utilize the chaos around you to make a strike against an adjacent enemy. For each adjacent enemy not including your target, roll a bonus dice on your attack.",
    "option_2a_data": "",
    "option_2b_name": "Reaction : Quick Strike",
    "option_2b_desc": "In response to a grunt or minion making an attack with a melee weapon against you, first make an attack against them with a simple melee weapon.",
    "option_2b_data": "",
    "option_3_name": "In the Fray",
    "option_3_desc": "You're built for the chaos of mass combat. Gain +1 physical mitigation and +2 health.",
    "option_3_data": "",
    "option_4a_name": "Crowd Control",
    "option_4a_desc": "Your strength lets you manhandle multiple foes. Gain +1 skill with might. When you take the shove action, you can target an additional creature in range.",
    "option_4a_data": "SS0=1",
    "option_4b_name": "Slayer's Resolve",
    "option_4b_desc": "Being outnumbered only makes you stronger. Gain +1 skill with endurance. When making endurance checks, roll a bonus die for every adjacent enemy.",
    "option_4b_data": "SS1=1",
    "option_5_name": "Weapon Master",
    "option_5_desc": "Heavy weapons feel light in your hands. Gain +1 skill with complex melee weapons.",
    "option_5_data": "WS3=1",
    "option_6a_name": "Follow Through",
    "option_6a_desc": "You have become deft in wielding cumbersome weapons. Gain +1 skill with coordination. When you damage an enemy using the Attack action with a complex melee weapon, you can choose an additional target that is within your melee range. If that target fails their defense check, they take half damage from your initital attack.",
    "option_6a_data": "SS1=1",
    "option_6b_name": "Terror of the Masses",
    "option_6b_desc": "Your brutal efficiency terrifies lesser foes. Gain +1 skill with presence. When you kill an enemy, make a presence check against the resilience of all other adjacent minions or thralls. On a failure, those creatures gain the afraid condition.",
    "option_6b_data": "SSR=1",
    "option_7_name": "Action : Whirlwind",
    "option_7_desc": "You become a spinning vortex of death. Make a single melee attack with a penalty die against all enemies within your weapon's reach. Gain energy equal to the number of creatures killed by this attack.",
    "option_7_data": ""
  },
  {
    "name": "Hunter",
    "id": 105,
    "option_1_name": "Action : Track",
    "option_1_desc": "You mark a creature you can see as your prey. While marked in this way, you roll an additional dice on wildcraft and senses skill checks against it. You cannot select a new target until your target has died or you have completed a full rest.",
    "option_1_data": "AE=1:TG",
    "option_2a_name": "Natural Camouflage",
    "option_2a_desc": "Gain +1 skill with stealth. When you are in natural environments, roll an extra dice when making a stealth check.",
    "option_2a_data": "TG",
    "option_2b_name": "Animal Companion",
    "option_2b_desc": "Beast pets that you are bonded with roll an extra attack dice. Additionally, when making senses checks with the assistance from an animal companion, replace your check with your companion's if it is higher.",
    "option_2b_data": "TO",
    "option_3_name": "Trailblazer",
    "option_3_desc": "You are experienced traveling in the most remote terrains. Gain +1 skill with fitness and gain 5 morale after spending a long rest in the wild.",
    "option_3_data": "TD",
    "option_4a_name": "Poacher",
    "option_4a_desc": "Your style of hunting involves lying in wait with strong, powerful ranged weapons. Gain +1 skill with complex ranged weapons and +1 skill with concentration.",
    "option_4a_data": "TO",
    "option_4b_name": "Wildchild",
    "option_4b_desc": "You were born to hunt and chase your prey like a beast yourself. Gain +1 skill with simple ranged weapons and +1 movement speed.",
    "option_4b_data": "TO",
    "option_5_name": "Naturalist",
    "option_5_desc": "You can spend 10 minutes examining an area with a moderate radius (20 units) to accurately determine what beasts, humanoid or monster passed through it within the last day. You also know if the target of your Track action has passed through and which way it went.",
    "option_5_data": "TG",
    "option_6a_name": "Action : Heart-Piercer",
    "option_6a_desc": "You attack your tracked target with a ranged weapon while within the optimal range of the weapon. If you deal damage to the creature, it gains the bleeding condition. If the creature is a beast, the damage it takes from bleeding at the end of each turn is upgraded to 2d4.",
    "option_6a_data": "TO",
    "option_6b_name": "Reaction : Wild Defense",
    "option_6b_desc": "In response to rolling a defense check against a beast or the target of your Track action, roll a wildcraft check and take the higher result of the two.",
    "option_6b_data": "TD",
    "option_7_name": "The Most Dangerous Game",
    "option_7_desc": "When your Track target is Large or bigger, you gain an extra dice on all attack rolls against it.",
    "option_7_data": "TO"
  },
  {
    "name": "Illusionist",
    "id": 105,
    "option_1_name": "Master of Disguise",
    "option_1_desc": "You have learned to alter your appearance through magical means without effort. You can channel the Disguise Self spell at will and it does not require concentration.",
    "option_1_data": "TG",
    "option_2a_name": "Shadow Play",
    "option_2a_desc": "Shadows bend to your will through subtle magic. Gain +1 skill with stealth. You can manipulate your shadow to move independently, allowing you to hide or distort it completely, making it harder for others to track your movements or determine your exact position.",
    "option_2a_data": "SSO=1:TG",
    "option_2b_name": "Charlatan",
    "option_2b_desc": "You use your illusion skills for less honorable pursuits. Gain +1 skill with thievery. When engaged in a game of chance or some other gamble with an individual, you gain a bonus dice to any social checks against them.",
    "option_2b_data": "SSP=1:TG",
    "option_3_name": "Empowered Illusions",
    "option_3_desc": "Your illusions become more convincing and harder to resist. Spells tagged as illusions gain a +2 to the required check to determine if they are real or not.",
    "option_3_data": "TO",
    "option_4a_name": "Action : Illusory Feint",
    "option_4a_desc": "You make an attack with a weapon while attempting to mask the true attack with illusion magic. Make both a weapon attack check and an alteration magic check, then add the highest dice from your alteration magic check to your weapon attack dice pool.",
    "option_4a_data": "TO",
    "option_4b_name": "Reaction : Duplicity",
    "option_4b_desc": "In response to being targeted by an attack, you create a duplicate image of yourself. Roll an alteration magic check as your defense. If successful, the attack hits the duplicate instead of you, causing it to disappear harmlessly.",
    "option_4b_data": "TD",
    "option_5_name": "Master Illusionist",
    "option_5_desc": "Your mastery over alteration magic has grown considerably. Gain +1 skill with alteration magic. Additionally, you can use alteration magic checks instead of logic checks when attempting to see through or detect illusions.",
    "option_5_data": "TG",
    "option_6a_name": "Magician",
    "option_6a_desc": "You've perfected the art of stage magic through mundane and magical means. Gain +1 skill with expression. You learn the illusify spell and can use it at will without requiring your concentration.",
    "option_6a_data": "SSS=1:TG",
    "option_6b_name": "Vivid Imagination",
    "option_6b_desc": "The terrors of the world are nothing compared to the horrors you have created as illusions. Gain +1 maximum resolve and +1 psychic mitigation.",
    "option_6b_data": "SSG=1:TD",
    "option_7_name": "Identity Thief",
    "option_7_desc": "Your disguise self ability also allows you to transform into non-humanoid creatures you have encountered that your size.",
    "option_7_data": "TG"
  },
  {
    "name": "Inquisitor",
    "id": 113,
    "option_1_name": "Vanquisher",
    "option_1_desc": "You take pride in destroying darkness. At the end of each full rest, if you helped defeat a dark creature or a creature you witnessed channeling dark magic, you gain resolve and morale based on the highest tier defeated: Minion (1), Thrall (1), Foe (2), Champion (3), Elite (5), and Legend (8)",
    "option_1_data": "SSO=1",
    "option_2a_name": "Witch Hunter",
    "option_2a_desc": "Years of investigation have honed your instincts. Gain +1 skill with insight. When you make a successful insight check against a humanoid of 10 or higher, you can determine if they are under the effect of a divine or dark spell. You must wait until the end of your next full rest to target the same creature with this trait.",
    "option_2a_data": "SSP=1",
    "option_2b_name": "Prosecutor's Mind",
    "option_2b_desc": "Your analytical approach to hunting heretics is unmatched. Gain +1 skill with logic. When you spend at least 10 minutes investigating a small area, such as a room, you can determine if there are any objects that are under the effect of a divine or dark spell, though not which specific object.",
    "option_2b_data": "SMJ=1",
    "option_3_name": "Action : Sin Hunter",
    "option_3_desc": "You target a divine, dark, or humanoid creature and mark them for the next minute. The first time you deal damage on your turn to this target, deal an additional 10 aetheric damage. This damage cannot be halved and can only be reduced by complete mitigation. If a humanoid has not channeled a spell from the divine or dark schools of magic within the last day, they are not affected by this ability.",
    "option_3_data": "",
    "option_4a_name": "Hunter of Shadows",
    "option_4a_desc": "You've dedicated yourself to purging dark forces. Gain +2 dark mitigation and +1 aetheric mitigation.",
    "option_4a_data": "",
    "option_4b_name": "Hunter of Light",
    "option_4b_desc": "You have dedicated yourself to bring to justice those that corrupt the light. Gain +2 divine mitigation and +1 aetheric mitigation.",
    "option_4b_data": "",
    "option_5_name": "Divine Mandate",
    "option_5_desc": "You believe that your power is best exercised with holy magic to fulfil your mandate. Gain +1 skill with divine magic.",
    "option_5_data": "MS4=1",
    "option_6a_name": "Action: Trial by Fire",
    "option_6a_desc": "You target a creature that has the ignited condition and make an attack with a weapon against them. If the attack hits, it deals an additional 10 physical damage but removes the ignited condition. If a creature dies as a result of this damage, you can move the ignited flames to another creature within a very short (5 unit) radius of your initial target.",
    "option_6a_data": "",
    "option_6b_name": "Reaction: Counter the Sinful",
    "option_6b_desc": "When the target of your Sin Hunter action makes an attack or channels a spell, you can make a ranged or melee attack against them. If you have 3 or more successes on your attack against their defense check, the target must makes a resilience check of 7 or higher or become ignited.",
    "option_6b_data": "",
    "option_7_name": "Grand Inquisitor",
    "option_7_desc": "When you first apply the ignited condition to a creature, you can change the damage type from heat to either divine or dark damage.",
    "option_7_data": ""
  },
  {
    "name": "Investigator",
    "id": 108,
    "option_1_name": "Calculating Mind",
    "option_1_desc": "Your analytical approach reveals hidden truths. Gain +1 skill with logic. You can accurately measure distances, sizes and weights of objects from analyzing them for a minute.",
    "option_1_data": "SSL=1",
    "option_2a_name": "Skeptic",
    "option_2a_desc": "You question everything and trust nothing, a mindset that protects both your judgment and your sanity. Gain +1 skill with insight and +1 psychic mitigation",
    "option_2a_data": "SSS=1",
    "option_2b_name": "Street Contacts",
    "option_2b_desc": "You cultivate informants in every shadow. Gain +1 skill with thievery. You can make an insight check to get an estimated value of if a creature can be bribed, and how much it will cost. A check of 10 or higher is considered extremely successful and will yield more accurate results, while a 6-9 will give a loose estimate.",
    "option_2b_data": "SSP=1",
    "option_3_name": "Reaction : Deduction",
    "option_3_desc": "You quickly analyze an opponent's patterns and weaknesses. In response to seeing a creature take an action, make a logic check against them. Until the start of your next turn, you gain a bonus die on all checks against that creature. This ability does not work on elementals, plantoids or constructs.",
    "option_3_data": "",
    "option_4a_name": "Good Cop",
    "option_4a_desc": "You excel at building rapport and trust. Gain +1 skill with persuasion. You gain a bonus dice on persuasion checks against any creature your ally has damaged in the last minute.",
    "option_4a_data": "SST=1",
    "option_4b_name": "Bad Cop",
    "option_4b_desc": "You know how to leverage pain as an intimidation tool. Gain +1 skill with presence. You gain a bonus dice on presence checks against any creature you've damaged in the last minute.",
    "option_4b_data": "SSR=1",
    "option_5_name": "Sharp Eyes",
    "option_5_desc": "Nothing escapes your trained observation. Gain +1 skill with senses. You gain a bonus dice when using your senses to detect traps or hidden objects.",
    "option_5_data": "SS5=1",
    "option_6a_name": "Action : Logical Choice",
    "option_6a_desc": "You target a creature and attempt to predict it's next move, calling out an action by name based on something you've witnessed the creature do. You make a logic check: on a result of 7 or higher, the creature suffers a penalty dice to this action if it uses it before the start of your next turn.",
    "option_6a_data": "",
    "option_6b_name": "Reaction : Perfect Timing",
    "option_6b_desc": "In response to being forced to make a coordination check, you roll a logic check instead. If the check is contested against a humanoid, you make an insight check instead.",
    "option_6b_data": "",
    "option_7_name": "Reconstruct Scene",
    "option_7_desc": "You excel at reconstructing past events from physical evidence. At any location bearing signs of recent activity (blood stains, disturbed or broken objects, magical residue), spend 10 minutes investigating. Make a logic check: 6-9 reveals the basic nature of what occurred, while 10+ provides a detailed reconstruction including participants, methods, and timeline.",
    "option_7_data": "SSN=1"
  },
  {
    "name": "Medic",
    "id": 105,
    "option_1_name": "Field Medicine",
    "option_1_desc": "You have learned battlefield first aid and emergency care. Gain +1 skill with medicine.",
    "option_1_data": "SS6=1:TD",
    "option_2a_name": "Action : Triage",
    "option_2a_desc": "You quickly stabilize an ally's condition to prevent further deterioration. Make a medicine check and grant morale equal to your result. This morale lasts until the end of combat. This action can only be used on each creature once per combat.",
    "option_2a_data": "TD",
    "option_2b_name": "Reaction : Emergency Response",
    "option_2b_desc": "In response to an ally within your sprint distance dropping to 0 health, you immediately move towards them and make a medicine check against the total damage dealt after mitigation. If your check is greater than or equal to the damage dealt, the ally sets their health to 1 instead, avoiding the effects of dropping to 0.",
    "option_2b_data": "TD",
    "option_3_name": "Treat Wounds",
    "option_3_desc": "You spend 5 minutes carefully treating an ally's injuries using a medicine kit, which is consumed in the process. Make a medicine check and restore health equal to the result. This ability can only target the same creature once per day.",
    "option_3_data": "TD",
    "option_4a_name": "Combat Medic",
    "option_4a_desc": "You are trained to work under pressure. Gain +1 skill with concentration. When you are not dedicating your concentration to something else, you gain a bonus dice on medicine checks during combat.",
    "option_4a_data": "SS4=1:TD",
    "option_4b_name": "Trauma Training",
    "option_4b_desc": "You are experienced with battlefield and have witness some gruesome injuries. Gain +1 skill with resilience. Your experience has made you immune to losing resolve when allies reach 0 health or fall unconscious.",
    "option_4b_data": "SSG=1:TD",
    "option_5_name": "Action : Stabilize",
    "option_5_desc": "You quickly treat a creature with a bandage that is unconscious, bleeding or both by making a medicine check of 5 or higher. A creature treated in this way has any bleeding condition removed and regains consciousness if they recover any health.",
    "option_5_data": "SS1=1:TD",
    "option_6a_name": "Improved Treat Wounds",
    "option_6a_desc": "When you treat someone's wounds with a medicine check, also add the second highest dice in the pool in the calculation to determine how many health they recover.",
    "option_6a_data": "SS5=1:TD",
    "option_6b_name": "Improved Stabilize",
    "option_6b_desc": "When you stablize someone, you can also use an item with them as the target such as a potion, antidote or other consumable.",
    "option_6b_data": "SS7=1:TD",
    "option_7_name": "Action : Resuscitation",
    "option_7_desc": "You attempt to revive a creature that has died within the last minute. Make a medicine check of 6 or higher each round for 3 consecutive rounds. If successful all 3 times, they return to life with 1 health but remain unconscious. The attempt fails if you fail twice in a row, skip a round, or are interrupted. Failed attempts cannot be restarted on the same creature.",
    "option_7_data": "TD"
  },
  {
    "name": "Monk",
    "id": 105,
    "option_1_name": "Reinforced Mind",
    "option_1_desc": "You have dedciated your life to combat and discipline. You gain +1 maximum resolve and can spend 4 hours meditating to regenerate 1 resolve per day.",
    "option_1_data": "AE=1:TD",
    "option_2a_name": "Stride of the Cheetah",
    "option_2a_desc": "You gain +1 skill with fitness. Additionally, gain +1 movement speed and roll an extra dice when defending against attack of opportunties.",
    "option_2a_data": "TD",
    "option_2b_name": "Breath of the Dolphin",
    "option_2b_desc": "You gain +1 skill with endurance. Additionally, your swim speed becomes equal to your movement speed and you can hold your breath for twice as long.",
    "option_2b_data": "TD",
    "option_3_name": "Reaction : Flow Like Water",
    "option_3_desc": "When you successfully evade or deflect an attack, you immediately move to an adjacent tile. Until the start of your turn, you roll an extra dice on defense checks.",
    "option_3_data": "TD",
    "option_4a_name": "Action : Flying Kick",
    "option_4a_desc": "You leap towards a target within 3 units using your fitness or acrobatics skill as the attack check. If the attack hits, deal 1d4 damage for each unit traveled.",
    "option_4a_data": "TO",
    "option_4b_name": "Action : Palm Strike",
    "option_4b_desc": "You strike a creature with an unarmed attack that deals no damage, but forces the target to make a concentration or endurance check against you, or they become stunned. The check required is equal to 3 times the total amount of dice that hit the target.",
    "option_4b_data": "TO",
    "option_5_name": "Monk's Discipline",
    "option_5_desc": "Gain +1 skill with concentration and +1 skill with resilience.",
    "option_5_data": "TD",
    "option_6a_name": "Master of Staves",
    "option_6a_desc": "Gain +1 skill with simple melee weapons and +1 deflection while not wearing armor.",
    "option_6a_data": "TO",
    "option_6b_name": "Master of Fists",
    "option_6b_desc": "Gain +1 skill with unarmed attacks and +1 evasion while not wearing armor.",
    "option_6b_data": "TO",
    "option_7_name": "Daily Action : Cleansing Focus",
    "option_7_desc": "You cleanse your mind, removing any dazed or stunned conditions from you. Additionally, roll a concentration check and gain morale equal to your highest roll that lasts for 1 minute.",
    "option_7_data": "TD"
  },
  {
    "name": "Necromancer",
    "id": 105,
    "option_1_name": "Action : Command Undead",
    "option_1_desc": "You use your concentration to take command of an undead creature that you can see which you have created. While dedicating your concentration in this way, it acts under your control.",
    "option_1_data": "TO",
    "option_2a_name": "Life Siphon",
    "option_2a_desc": "When a creature dies as a result of damage from a spell from the necromancy subschool that you channeled, you gain 3 health. This trait does not work on constructs or undead.",
    "option_2a_data": "CS1=1:TC:TO",
    "option_2b_name": "Death Bond",
    "option_2b_desc": "Each day, the first time you reach 0 health, your health is set to 1. Additionally, gain +1 skill with endurance.",
    "option_2b_data": "SSJ=1:SSG=1:TO",
    "option_3_name": "Deadspeak",
    "option_3_desc": "You unlock the Deadspeak language and gain +1 to your presence skill.",
    "option_3_data": "AE=1:TO",
    "option_4a_name": "Daily Action : Death Touch",
    "option_4a_desc": "You touch a creature using your dark magic skill as an attack roll against a defensive endurance check. For each dice that hits, deal dark damage equal to your missing health. This does not affect constructs or elementals but deals double damage to humanoids and plantoids.",
    "option_4a_data": "TO",
    "option_4b_name": "Action : Harvest",
    "option_4b_desc": "You siphon the magic from one undead creature under your command that is within a moderate (20 units) range, destroying it and recovering 2d4 health and completely restoring your energy.",
    "option_4b_data": "TO",
    "option_5_name": "The Dark Arts",
    "option_5_desc": "You are practiced in the dark arts. Gain +1 skill with dark magic.",
    "option_5_data": "WS1=3:WS4=1:TO",
    "option_6a_name": "Forbidden Science",
    "option_6a_desc": "You have experimented with forbidden sciences giving you greater understanding. Gain +1 skill in medicine and +1 skill in academics.",
    "option_6a_data": "TO",
    "option_6b_name": "Enhanced Minions",
    "option_6b_desc": "Undead creatures under your control gain an extra dice on their attack rolls. Additionally, undead under the effect of your Command Undead action are gifted primitive mental capabilities, allowing them to make social, mind and knowledge checks with a 1d4 dice.",
    "option_6b_data": "TO",
    "option_7_name": "Expanded Control",
    "option_7_desc": "You are no longer limited to controlling one undead creature and can instead control a number of creatures or swarms equal to your concentration skill.",
    "option_7_data": "TO"
  },
  {
    "name": "Oracle",
    "id": 105,
    "option_1_name": "Dangersense",
    "option_1_desc": "You possess an innate sense of danger that warns you of significant threats. When an elite-tier creature or higher, or a deadly trap that poses a threat to you is within a moderate (20 unit) distance, you automatically sense the presence of danger without identifying its specific source or location.",
    "option_1_data": "SS5=1:TG",
    "option_2a_name": "Foritifed Soul",
    "option_2a_desc": "Your soul is especially resistent from things that would damage it. Gain +2 mitigation to aether damage.",
    "option_2a_data": "TD",
    "option_2b_name": "Threads of Fate",
    "option_2b_desc": "You can perceive the mystical connections between people and events. Gain +1 skill with insight. When you meet someone for the first time, you can sense if they are connected to your destiny or will play a significant role in future events.",
    "option_2b_data": "TG",
    "option_3_name": "Mystic Echoes",
    "option_3_desc": "Your connection to mystical forces deepens your understanding. Gain +1 skill with magic knowledge. When you inspect a magical item, you can determine the last time it was used and a vague nature of the type of creature who wielded it.",
    "option_3_data": "SS3=1:TG",
    "option_4a_name": "Signs",
    "option_4a_desc": "You can read the subtle signs and omens that others miss. Gain +1 skill with senses. You can sense when you are being watched by making a senses check of 8 or higher, both magically and naturally.",
    "option_4a_data": "SS5=1:TG",
    "option_4b_name": "First to Act",
    "option_4b_desc": "You are always prepared and can act quickly to events. Gain +1 skill to coordination. You also reroll 1's when rolling a coordination check to determine initiative.",
    "option_4b_data": "SSN=1:TG",
    "option_5_name": "Seer",
    "option_5_desc": "Your mastery of divination magic has grown considerably. Gain +1 skill with mysticism magic.",
    "option_5_data": "SS8=1:TG",
    "option_6a_name": "Action : Trance of the Oracle",
    "option_6a_desc": "You dedicate your concentration to entering a trance, perceiving the possible futures of combat. Gain +1 skill wtih concentration. While in this trance, you roll all weapon attack and defense checks with a bonus dice. If you lose concentration while tranced in this way, you become dazed.",
    "option_6a_data": "SS2=1:TG",
    "option_6b_name": "Reaction : Bend Fate",
    "option_6b_desc": "In response to an attack roll of either a 1 or the maximum dice face being rolled within a short (10 unit) distance, the attacker rerolls that dice.",
    "option_6b_data": "SS4=1:TG",
    "option_7_name": "Portent",
    "option_7_desc": "At the start of each day, you peer into the threads of fate and possibility. Roll a mysticism magic check and record each individual dice result. Throughout the day, you can replace any instantaneous roll made by you or an ally with one of these stored results. Each result can only be used once and cannot be applied to checks that take extended time to complete.",
    "option_7_data": "TG"
  },
  {
    "name": "Sentinel",
    "id": 106,
    "option_1_name": "Student of Combat",
    "option_1_desc": "On the first round of combat, you gain a bonus dice to all attack dice ",
    "option_1_data": "TD",
    "option_2a_name": "Sharp Mind",
    "option_2a_desc": "Gain +1 skill with logic. When you are confused and roll a 6 or 7 on the confusion table, your confusion ends.",
    "option_2a_data": "SSL=1:TD",
    "option_2b_name": "Focused Mind",
    "option_2b_desc": "Gain +1 skill with concentration. ",
    "option_2b_data": "SS4=1:TD",
    "option_3_name": "SENT TIER 3",
    "option_3_desc": "Gain +1 skill with academics.",
    "option_3_data": "SSN=1:TD",
    "option_4a_name": "Reaction : Know Thy Enemy",
    "option_4a_desc": "In response to being targeted by a melee attack, you analyze your opponent's stance and technique. Roll an academics check with a single dice and add that die to your defense check pool.",
    "option_4a_data": "TD",
    "option_4b_name": "Action : Find Weakness",
    "option_4b_desc": "You make a probing attack to study your opponent's defenses. Make an academics check with a single die as your attack roll. If the attack hits, you deal damage equal to your weapon's primary damage and learn one mitigation type or immunity of your choice that the target possesses.",
    "option_4b_data": "TD",
    "option_5_name": "SENT TIER 5",
    "option_5_desc": "SENT TIER 5 DESC",
    "option_5_data": "TD",
    "option_6a_name": "Ancient Defenses",
    "option_6a_desc": "ou have studied the protective wards and divine rituals of ancient civilizations. Gain +1 skill with magic knowledge and +1 divine and +1 dark mitigation.",
    "option_6a_data": "TD",
    "option_6b_name": "Warrior-Scholar",
    "option_6b_desc": "You combine battlefield medicine with anatomical knowledge to protect yourself and others. Gain +1 skill with medicine and +1 physical mitigation.",
    "option_6b_data": "TD",
    "option_7_name": "Daily Action : Attack of Legends",
    "option_7_desc": "You channel the legendary techniques of history's greatest warriors into a single devastating strike. Roll both an academics check and a weapon attack, discarding the lowest die from each pool before combining them. If this attack defeats an elite tier or higher creature, your resolve is completely restored.",
    "option_7_data": "SS1=1:SS3=1:SS6=1:TD"
  },
  {
    "name": "Shaman",
    "id": 105,
    "option_1_name": "Ancestral Protection",
    "option_1_desc": "The spirits of your ancestors watch over you. Gain +1 aether mitigation and +1 skill with resilience.",
    "option_1_data": "SS5=1:TD",
    "option_2a_name": "Spirit Sight",
    "option_2a_desc": "Your eyes have been opened to perceive the ethereal realm. Gain +1 skill with senses. You can see ethereal creatures and spirits as glowing wisps within a short (10 unit) distance, allowing you to detect their presence even when they would normally be invisible.",
    "option_2a_data": "SS5=1:TG",
    "option_2b_name": "Witch Doctor",
    "option_2b_desc": "You know the healing traditions of your ancestors. Gain +1 skill with medicine. Additionally, you can identify any non-magical disease or poison by their symptoms.",
    "option_2b_data": "SS2=1:TD",
    "option_3_name": "Action : Raise Spirit",
    "option_3_desc": "You call forth the spirit of a dead animal that died within the last day. The spirit retains the stats of the original creature but becomes spectral. You can only have one spirit pet at a time. If it dies, it dissipates and cannot be raised again.",
    "option_3_data": "TG",
    "option_4a_name": "Spirit Bond",
    "option_4a_desc": "Gain +1 skill with magic knowledge. You can see through your spirit pet's eyes and communicate telepathically with it regardless of distance, as long as you are on the same plane of existence.",
    "option_4a_data": "SS3=1:TG",
    "option_4b_name": "Cleansing Aura",
    "option_4b_desc": "When you channel a healing spell or a spell that removes a condition as a ritual, it affects everone within a 3 unit radius of your spirit pet.",
    "option_4b_data": "SSR=1:TD",
    "option_5_name": "Reaction : Spirit Shield",
    "option_5_desc": "In response to taking damage, you can redirect that damage to your spirit pet instead.",
    "option_5_data": "SSN=1:TD",
    "option_6a_name": "Path of Nature",
    "option_6a_desc": "You have chosen to walk the path of natural magic and elemental forces. Gain +1 skill with primal magic. Your spirit pets' attacks that deal physical damage can now deal heat, electric or cold damage instead.",
    "option_6a_data": "SS8=1:TG",
    "option_6b_name": "Path of Spirits",
    "option_6b_desc": "You have chosen to walk the path of mysticism and the spirit realm. Gain +1 skill with mysticism magic. Your spirit pets' attacks that deal physical damage can now deal aether damage instead.",
    "option_6b_data": "SS4=1:TG",
    "option_7_name": "Spirit Master",
    "option_7_desc": "You have achieved mastery over the spirit realm. You can now target a standard tiered beast's corpse to raise an spirit pet from. If this spirit pet is destroyed, it returns after your next full rest unless you release it from your service.",
    "option_7_data": "TG"
  },
  {
    "name": "Spell Thief",
    "id": 109,
    "option_1_name": "Arcane Pilfering",
    "option_1_desc": "You've learned to pilfer magic itself. You gain one thief slot that can hold a spell with a casting difficulty of 2 or lower. When casting spells from thief slots, you use your thievery skill instead of the normal magic skill.",
    "option_1_data": "",
    "option_2a_name": "Shadow Caster",
    "option_2a_desc": "Gain +1 skill with stealth. When you channel a spell in a thief slot while hidden, you roll a bonus dice.",
    "option_2a_data": "",
    "option_2b_name": "Unbreakable Focus",
    "option_2b_desc": "Gain +1 skill with concentration. When you channel a thief slot spell, your concentration cannot be broken by sleeping or becoming unconscious.",
    "option_2b_data": "",
    "option_3_name": "Reaction : Spell Steal",
    "option_3_desc": "In response to a creature channeling a spell within 5 units, make a thievery check contested by their casting check. On success, you steal the spell and place it in one of your thief slots, replacing any spell already there. If the spell wasn't innate to the caster, they forget it permanently.",
    "option_3_data": "",
    "option_4a_name": "Distant Theft",
    "option_4a_desc": "Your understanding of magic empowers your thief slot spells. Gain +1 skill with magic knowledge. Your Spell Steal reaction now works at short range (10 units) instead of 5.",
    "option_4a_data": "SS3=1",
    "option_4b_name": "Borrowed Magic",
    "option_4b_desc": "You've learned gentler methods of magical acquisition. Gain +1 skill with insight. You can now use Spell Steal on willing allies without causing them to forget the spell.",
    "option_4b_data": "SSS=1",
    "option_5_name": "Expanded Cache",
    "option_5_desc": "Your capacity for stolen magic expands. Gain +1 skill with thievery and an additional thief slot.",
    "option_5_data": "SSP=1",
    "option_6a_name": "Reaction : Sacrificial Ward",
    "option_6a_desc": "In response to being targeted with an attack that deals damage, you sacrifice one of your spells in your thief slots, forgetting it. You gain mitigation against the damage equal to twice the cast check of the stolen spell.",
    "option_6a_data": "",
    "option_6b_name": "Action : Unstable Fusion",
    "option_6b_desc": "You channel both your known thief slot spells at the same time, specifying different targets for each. You take psychic damage equal to half the cast check of the higher tier spell.",
    "option_6b_data": "",
    "option_7_name": "Spell Shatter",
    "option_7_desc": "You don't just steal spellsyou shatter them. When you successfully steal a spell, the original casting is completely negated. Additionally, if the stolen spell was innate to the creature, they must make a magic knowlege check of 9 or higher, or the spell becomes disabled for 1 minute.",
    "option_7_data": ""
  },
  {
    "name": "Thespian",
    "id": 105,
    "option_1_name": "Natural Performer",
    "option_1_desc": "You have an innate talent for captivating audiences and expressing yourself. Gain +1 skill with expression. Your performances are memorable, and people who have seen you perform will remember you fondly.",
    "option_1_data": "SSQ=1:TG",
    "option_2a_name": "Reaction : Feign Death",
    "option_2a_desc": "In response to being targeted by an attack, you dramatically collapse and play dead. Make an expression check against the attacker's insight. If successful, they believe you are dead and will not target you again unless you take an action or someone else reveals your deception.",
    "option_2a_data": "TG",
    "option_2b_name": "Reaction : Mocking Taunt",
    "option_2b_desc": "In response to a creature starting their turn within a very short (5 unit) distance, you deliver a cutting insult. Make an expression check against their resilience. If successful, they gain a penalty dice on attacks against anyone other than you until the start of their next turn.",
    "option_2b_data": "TG",
    "option_3_name": "Penchant for Dramatics",
    "option_3_desc": "Your theatrical training allows you to apply dramatic flair to social situations. You can use expression checks in place of persuasion checks when trying to deceive, intimidate, or convince others through dramatic presentation.",
    "option_3_data": "TG",
    "option_4a_name": "Method Acting",
    "option_4a_desc": "You can immerse yourself so completely in a role that you become the character. Gain +1 skill with insight. You can spend 10 minutes adopting a persona, gaining a bonus dice on all social checks while maintaining that role for the next hour.",
    "option_4a_data": "SSS=1:TG",
    "option_4b_name": "Stage Presence",
    "option_4b_desc": "Your commanding presence can captivate any audience. Gain +1 skill with presence. When you perform somewhere, people are much more likely remember you positively.",
    "option_4b_data": "SSR=1:TG",
    "option_5_name": "Master Performer",
    "option_5_desc": "Your theatrical skills have reached professional levels. Gain +1 skill with expression. When making expression checks, any roll under a 4 becomes a 3.",
    "option_5_data": "SSQ=1:TG",
    "option_6a_name": "Performing Arts",
    "option_6a_desc": "Your theatrical training encompasses multiple disciplines. Gain +1 skill with coordination.",
    "option_6a_data": "SSG=1:TG",
    "option_6b_name": "Traveling Troupe",
    "option_6b_desc": "Your life on the road has given you skills to shine in a community. Gain +1 skill with cooking and become proficient in one musical skill.",
    "option_6b_data": "SS6=1:TG",
    "option_7_name": "Reaction : Improvise",
    "option_7_desc": "In response to failing any skill check while in combat, you can immediately attempt the same task using a different skill of your choice.",
    "option_7_data": "TG"
  },
  {
    "name": "Thief",
    "id": 105,
    "option_1_name": "Kleptomania",
    "option_1_desc": "When you steal an object, you gain 1 morale after your next full rest for each 20 gold of value on the object up to a maximum of 10.",
    "option_1_data": "TG",
    "option_2a_name": "Action : Sleight of Hand",
    "option_2a_desc": "You attempt to either steal a visible, unequipped object from an adjacent creature or plant a small object on them. Make a coordination check contested by their senses check. On success, you complete the action unnoticed. On failure, they become aware of your attempt.",
    "option_2a_data": "TG",
    "option_2b_name": "Reaction : Evasive Maneuvers",
    "option_2b_desc": "In response to being targeted by a melee attack, you can immediately move up to 2 units without provoking reactions, gaining a bonus dice to your defense check.",
    "option_2b_data": "TG",
    "option_3_name": "Skilled Thief",
    "option_3_desc": "Gain +1 skill with thievery. You have learned the fundamentals of larceny and security bypass. Your mastery with lockpicks is so refined that you can pick locks without making any noise, allowing you to work undetected.",
    "option_3_data": "SSP=1:TG",
    "option_4a_name": "Thrill of the Steal",
    "option_4a_desc": "Gain +1 skill with coordination. Once per day, when you steal an object valued at 100 gold or higher, gain +1 resolve for each 100 gold valuation of the object.",
    "option_4a_data": "SSO=1:TG",
    "option_4b_name": "Evasive",
    "option_4b_desc": "You have honed your ability to avoid attacks through quick reflexes and positioning. Gain +1 skill with evasion.",
    "option_4b_data": "SSI=1:TG",
    "option_5_name": "Shadow Step",
    "option_5_desc": "You are adept at moving unseen. Gain +1 skill with stealth. Additionally, when you successfully use stealth to gain the hidden condition, the sprint action does not reveal you.",
    "option_5_data": "SSS=1:TG",
    "option_6a_name": "Concealed Weapons",
    "option_6a_desc": "You are skilled at hiding weapons on your person and using them effectively. Gain +1 skill with simple melee weapons. Simple melee weapons you carry cannot be discovered by normal searches.",
    "option_6a_data": "WS2=1:TG",
    "option_6b_name": "Street Connections",
    "option_6b_desc": "Gain +1 skill with insight. You are skilled at reading people and identifying the right contacts for information gathering. By spending a day networking within a settlement, you can make an insight check to discover any criminal organizations operating in the area and learn how to make contact with them.",
    "option_6b_data": "SSG=1:TG",
    "option_7_name": "Action : Reliable Escape",
    "option_7_desc": "You take a modified sprint action. If you end your movement in a location where no hostile creatures have line of sight to you, you automatically gain the hidden condition.",
    "option_7_data": "TG"
  },
  {
    "name": "Transmuter",
    "id": 105,
    "option_1_name": "Arcane Analysis",
    "option_1_desc": "Gain +1 skill with magic knowledge. When you touch an object or creature, you can determine if it is in it's natural form or if it is under the effect of magic that has transmuted it in some way.",
    "option_1_data": "AE=1:TG",
    "option_2a_name": "Immutable Crafting",
    "option_2a_desc": "Items you craft become resistant to change and decay. Gain +1 skill with fabrication. Equipment you create cannot be affected by rust, corrosion, or magical transformation effects or have it's form, weight or size altered or disguised in any way.",
    "option_2a_data": "TG",
    "option_2b_name": "Material Sympathy",
    "option_2b_desc": "Gain +1 skill with senses. You can sense the structural integrity and weak points of any object or structure by touch. You can determine how much damage would be required to break, collapse, or significantly damage it, and identify the most vulnerable points for maximum effect.",
    "option_2b_data": "TG",
    "option_3_name": "Material Mastery",
    "option_3_desc": "You understand the fundamental properties of materials and how to alter them. Gain +1 skill with academics. You can identify the composition, quality, and approximate value of any material by touch.",
    "option_3_data": "TG",
    "option_4a_name": "Reaction : Adjust Mass",
    "option_4a_desc": "In response to being the target of an ability that would displace you, the check required to avoid the displacement is halved. If there is no check associated with the displacement, you automatically succeed.",
    "option_4a_data": "TD",
    "option_4b_name": "Action : Destabilize",
    "option_4b_desc": "You target an adjacent creature or object and attempt to disrupt its fundamental structure by channeling a spell that deals damage. If your spell successfully deals damage after mitigations, your target's mitigation to the damage type you dealt becomes 0 until the start of your next turn.",
    "option_4b_data": "TO",
    "option_5_name": "Skilled Transmuter",
    "option_5_desc": "Your mastery of transformation magic has deepened considerably. Gain +1 skill with alteration magic.",
    "option_5_data": "TG",
    "option_6a_name": "Alchemical Transmutation",
    "option_6a_desc": "You blend magical theory with practical alchemy. Gain +1 skill with alchemy. When you make an alchemy check, roll an alteration check with a single dice and add that dice to your alchemy check pool.",
    "option_6a_data": "TG",
    "option_6b_name": "Selective Immutability",
    "option_6b_desc": "You have achieved perfect control over your personal transmutation, transcending natural limitations. All effects that would alter your form - whether beneficial or harmful - can be consciously accepted or rejected at will, even bypassing any immutable properties you might have.",
    "option_6b_data": "TD",
    "option_7_name": "Daily Action : Metamorphis",
    "option_7_desc": "You undergo a complete physical transformation, taking the form of any monster or beast you have encountered of champion tier or lower for one minute. Make an alteration magic check against the creature's tier difficulty (minion 2, grunt 4, standard 6, champion 8). On failure, you become maddened for the entire duration. You retain your mental abilities but gain the target creature's physical form, attacks, and capabilities. If this form is reduced to 0 health, you immediately revert to your original body with 5 health.",
    "option_7_data": "TG"
  },
  {
    "name": "Witch",
    "id": 105,
    "option_1_name": "Action : Hex",
    "option_1_desc": "You put a hex on a creature you can see. For the next minute, the next time that creature takes dark damage, they roll 1 less dice on their next check, ending the hex.",
    "option_1_data": "TO",
    "option_2a_name": "Coven",
    "option_2a_desc": "You either create or join an established coven of up to 4 other witches with this trait. Each member of the coven uses the highest resilience skill in the coven when making checks. Addditionally, coven members can dedicate their concentration to telepathically communicate or see through the eyes of any other member assuming they are on the same plane of existence. A member can only leave a coven if they die.",
    "option_2a_data": "TG",
    "option_2b_name": "Familiar",
    "option_2b_desc": "You designate a tiny beast as a familiar. This familiar is unique in that it can be used as a origin point for spells that you channel. While you are alive, your familiar cannot permanently die, and can be resummoned by performing a 1 hour ritual.",
    "option_2b_data": "TG",
    "option_3_name": "Occult Senses",
    "option_3_desc": "Your senses have become accutely calibrated. You, your familiar or any creature summoned by you has ultravision. Additionally, you gain +1 skill with senses.",
    "option_3_data": "AE=1:TG",
    "option_4a_name": "Reaction : Blood Price",
    "option_4a_desc": "In response to a creature dealing damage physical damage to you, you deal half the damage done as dark damage to them. If you have the bleeding condition, this damage becomes equal to the amount of damage done to you.",
    "option_4a_data": "TO",
    "option_4b_name": "Action : Sigil",
    "option_4b_desc": "Immediately after channeling a spell, instead of it being activated, infuse an object you are touching with that magic. When this occurs, you specify a condition to take place within the next day which will then cause the spell to activate. If this condition never happens within that timeframe, the spell is removed.",
    "option_4b_data": "SSJ=1:SSG=1:TG",
    "option_5_name": "Darkcraft",
    "option_5_desc": "You are an experienced witch. You gain +1 skill with alchemy and +1 dark mitigation.",
    "option_5_data": "WS1=3:WS4=1:TG",
    "option_6a_name": "Shadow Witch",
    "option_6a_desc": "You are practiced in the dark arts. Gain +1 skill with dark magic. If you have a familiar, when you channel a dark spell using a ritual, the material components and the duration required are reduced by half.",
    "option_6a_data": "TG",
    "option_6b_name": "Lunar Witch",
    "option_6b_desc": "You are practiced in lunar magic. Gain +1 skill with primal magic and you can learn spells from the cosmic subschool.",
    "option_6b_data": "TG",
    "option_7_name": "Dark Contracts",
    "option_7_desc": "You are experienced in listening to the plights of others so that you may use your magic to aid them for a cost. Gain +1 skill with insight and +1 skill with persuasion. When you enter into a contract with a humanoid that willfully breaks an agreement you have come to, they become permanently affected by your Hex action and can be the target of dark spells despite any distance requirements.",
    "option_7_data": "TG"
  },
  {
    "name": "Wizard",
    "id": 112,
    "option_1_name": "Arcane Scholar",
    "option_1_desc": "Your dedication to magical study is unmatched. Gain +1 skill with academics. Your academic foundation is so broad, when you help an ally by using your academics skill, you grant them 2 bonus dice if you are successful.",
    "option_1_data": "SKV=1",
    "option_2a_name": "Theoretical Mastery",
    "option_2a_desc": "Your mind processes magical formulae with machine-like precision. Gain +1 skill with concentration. You can continue a ritual that you prematurely ended as long as you restart within 6 hours of ending it without a penalty.",
    "option_2a_data": "SMF=1",
    "option_2b_name": "Scribe",
    "option_2b_desc": "Ancient runes and mystical symbols flow from your quill like water. Gain +1 skill with glyphcraft and become proficient in one magical language.",
    "option_2b_data": "SMJ=1",
    "option_3_name": "Arcane Mana",
    "option_3_desc": "You've learned to tap into pure magical essence. You gain 3 mana points that refresh after a full rest. When channeling a spell, you can spend 1 mana point to charge the spell.",
    "option_3_data": "",
    "option_4a_name": "Researcher",
    "option_4a_desc": "Your spell research is unparalleled. Gain +1 skill with magic. Once per day, when researching a spell, you do not suffer the penalty for not knowing it.",
    "option_4a_data": "MS1=1",
    "option_4b_name": "Structured Mind",
    "option_4b_desc": "A wizard's mind must be sharp to keep a large selection of spells. Gain +1 skill with logic. You never truly forget spells; instead you can switch out spells that you know with any spell that you knew in the past at the end of a full rest.",
    "option_4b_data": "SKW=1",
    "option_5_name": "Action : Mana Burn",
    "option_5_desc": "You channel all remaining mana you have available, rolling a d10 for each point against a resilience defense check. For each success, you deal 5 aetheric damage and 8 damage if a 10 is rolled.",
    "option_5_data": "",
    "option_6a_name": "Elemental Theorist",
    "option_6a_desc": "Your mastery extends to the fundamental forces. Gain +1 skill with primal magic.",
    "option_6a_data": "MS2=1",
    "option_6b_name": "Metaphysical Study",
    "option_6b_desc": "You've mastered the art of bending reality itself. Gain +1 skill with metamagic.",
    "option_6b_data": "MS3=1",
    "option_7_name": "Archmage",
    "option_7_desc": "You gain 2 additional mana points and gain +3 spell capacity. Additionally, the dice on your Mana Burn action becomes a d12.",
    "option_7_data": ""
  }
]