{
  "id": 12,
  "name": "Ekshaan",
  "mtype": "cultural",
  "ruleset": 0,
  "description": "Vermin of the Depths\n",
  "options": [
    {
      "id": 1090,
      "name": "Foolishly Brave",
      "description": "The Kobold culture is built upon banding together and being fearless in the face of certain death. While there are 2 or more Allies within 6 Units, you are Immune to being Afraid.",
      "mtype": "cultural",
      "location": "1",
      "cost": 2,
      "data": "ALJ:TD"
    },
    {
      "id": 1091,
      "name": "Natural Throwing Arm",
      "description": "Often short of weaponry to support such a large population, it is commonplace in the Kobold culture to perfect accurate throwing to deter predators. Small Objects that you throw and Throwing Ammunition deal an additional 2 Damage and are upgraded to Critical Hits on a True Hit.",
      "mtype": "cultural",
      "location": "2a",
      "cost": 2,
      "data": "T9"
    },
    {
      "id": 1092,
      "name": "Good with Traps",
      "description": "The Kobold culture typically employs traps to protect their property and hard-won treasure. Gain +1 Thievery and +1 Engineering",
      "mtype": "cultural",
      "location": "2b",
      "cost": 2,
      "data": "ASA=1:AC7=1"
    },
    {
      "id": 1093,
      "name": "Action : Skitterstrike",
      "description": "You move up to Half your Movement Speed. For every Creature you come within 1 Unit of, you can make an Attack with a Light or Unarmed Weapon.",
      "mtype": "cultural",
      "location": "3",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1094,
      "name": "The Draconic Legacy",
      "description": "The kobold culture was shaped by the dragons of old, and some knowledge of that magic still remains. Gain 3 Beginner and 3 Novice Draconic Spells.",
      "mtype": "cultural",
      "location": "4a",
      "cost": 2,
      "data": ""
    },
    {
      "id": 1095,
      "name": "Cavedwellers",
      "description": "Kobold societies are built underground, and those who dwell within learn to listen for subtle sounds to detect enemies. You gain +1 Search and Tremorsense up to 6 Units.",
      "mtype": "cultural",
      "location": "4b",
      "cost": 2,
      "data": "TG:ASG=1:DT"
    },
    {
      "id": 1096,
      "name": "Free Action : Reckless Abandon",
      "description": "You dedicate yourself to all out aggression against a Creature that is two sizes or more larger than you. Until the start of your next turn, you gain a 1d4 Bonus to Attacks against this Creature but suffer a 1d4 Penalty to all Defense Checks against them.",
      "mtype": "cultural",
      "location": "5",
      "cost": 3,
      "data": "Y"
    }
  ]
}