{
  "id": 105,
  "name": "Armsman",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Weapon Collector",
      "description": "You are adept at managing multiple weapons in combat. You can carry an additional weapon that can be drawn and equipped without using an action. Additionally, you can switch between carried weapons as part of any attack action.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Tactical Fighter",
      "description": "Your diverse weapon training has improved your battlefield awareness. Gain +1 skill with senses. You can identify the weapon type and fighting style of any armed opponent by observing them for one round.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "SSK=1:TG"
    },
    {
      "name": "Master at Arms",
      "description": "Your knowledge of weapon construction and maintenance is extensive. Gain +1 skill with fabrication. If you spend an hour with any weapon, you learn the recipe on how to make it.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "CS2=1:TG"
    },
    {
      "name": "Reaction : Follow-Up",
      "description": "In response to you making an attack with a melee weapon, reroll your melee weapon check and take that result, stead.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "Z"
    },
    {
      "name": "Blade Master",
      "description": "Your mastery of close combat weapons is exceptional. Gain +1 skill with simple melee weapons.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "WS3=1:TO"
    },
    {
      "name": "Combat Veteran",
      "description": "Your extensive weapon training has honed your reflexes. Gain +1 skill with coordination.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "SSG=1:TG"
    },
    {
      "name": "Weapon Consistency",
      "description": "You gain improved critials with complex weapons, causing even your extra dice to add the primary damage to your total roll.",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "TO"
    },
    {
      "name": "Action : Disarming Parry",
      "description": "In response to being the target of a melee attack, attempt to forcefully block it by making an attack with a complex melee weapon. If the attacker is making their attack with a melee weapon, they must roll a coordination check of 6 or higher, or they drop their weapon.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "Z"
    },
    {
      "name": "Action : Follow-Through",
      "description": "You make a devastating combination attack with two different weapons. Make an attack with a complex melee weapon, then immediately make an attack with a simple ranged weapon that you are wielding with one hand. The ranged attack ignores physical mitigation.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "X"
    },
    {
      "name": "Master Armsman",
      "description": "You have achieved mastery over many forms of weaponry. Gain +1 skill with simple ranged weapons and +1 skill with complex melee weapons.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "WS4=1:WS5=1:TO"
    }
  ]
}