{
  "id": 105,
  "name": "Armsman",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Weapon Collector",
      "description": "You are adept at managing multiple weapons in combat. You can use complex weapons in your extra weapon slots.",
      "location": "1",
      "data": "TG:FE"
    },
    {
      "name": "Action : Disarm",
      "description": "You make an attack with a melee weapon against a target that is also wielding a weapon in their hands. Instead of making a normal defense check, the target must make a coordination check greater than or equal to half your attack check, rounded down. If the target is dazed, stunned or impaired, your attack check is not halved.",
      "location": "2a",
      "data": "XINE=1"
    },
    {
      "name": "Action : Follow-Through",
      "description": "You make a combination attack with two different weapons. First make an attack with a complex weapon, then immediately make an attack against the same target with a brawling attack, throwing weapon or simple weapon as part of the same action. Both attacks are mitigated separately.",
      "location": "2b",
      "data": "XINE=1"
    },
    {
      "name": "Tactical Fighter",
      "description": "Your diverse weapon training has improved your battlefield awareness. Gain +1 skill with logic. When making a defense check against a creature that is using a simple or complex melee weapon, gain a bonus dice.",
      "location": "3",
      "data": "TG:SSL=1"
    },
    {
      "name": "Training",
      "description": "Your extensive weapon training has honed your reflexes. Gain +1 skill with coordination. When using the attack action, you can use your coordination skill with a penalty dice as your attack check. These weapon attacks are not eligible for critical hits and cannot be used as part of other actions or reactions.",
      "location": "4a",
      "data": "TG:SSG=1"
    },
    {
      "name": "Master at Arms",
      "description": "Your knowledge of weapon construction and maintenance is extensive. Gain +1 skill with fabrication. You can study a weapon for an hour to learn how to make it and avoid the first time craft penalty.",
      "location": "4b",
      "data": "TG:CS2=1"
    },
    {
      "name": "Action : Find the Gap",
      "description": "You search for a gap in your opponent's defenses by rolling a coordination check against their defense. If successful, you make a weapon attack with a penalty dice against that same defense check, but the physical damage cannot be mitigated. This does not affect creatures with traits that halve or are immune to physical damage.",
      "location": "5",
      "data": "XINE=1"
    },
    {
      "name": "Weapon Master [A]",
      "description": "Gain +1 skill with complex melee and simple ranged weapons.",
      "location": "6a",
      "data": "WS5=1:WS4=1"
    },
    {
      "name": "Weapon Master [B]",
      "description": "Gain +1 skill with simple melee weapons and throwing weapons.",
      "location": "6b",
      "data": "WS3=1:WS2=1"
    },
    {
      "name": "Effortless Weapons",
      "description": "Complex weapons are no more difficult to handle than simple ones for you. The amount of energy you use to attack with a complex weapon is reduced by 1, to a minimum of 0.",
      "location": "7",
      "data": "FH"
    }
  ]
}