{
  "id": 105,
  "name": "Assassin",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Shadow Walker",
      "description": "You move through darkness like a living shadow. Gain +1 skill with stealth. When you kill a creature, the next stealth check you make before the start of your next turn gains a bonus dice.",
      "location": "1",
      "data": "TG:SSF=1"
    },
    {
      "name": "Action : Phantom Throw",
      "description": "You make a throwing attack while hidden. If you have cover, you can roll a stealth check ",
      "location": "2a",
      "data": "XINE=1"
    },
    {
      "name": "Action : Silencing Strike",
      "description": "You make a precise attack designed to prevent your target from calling for help. You make a brawling attack that deals no damage, but strikes in a way that the target cannot speak or make noise until the end of their next turn if at least 3 of the dice hit.",
      "location": "2b",
      "data": "XINE=1"
    },
    {
      "name": "Death from Shadows",
      "description": "You strike with lethal precision when enemies cannot see you coming. When you are hidden, you can add a stealth dice into your attack check dice pool.",
      "location": "3",
      "data": "TG"
    },
    {
      "name": "Stalker",
      "description": "You can track and pursue targets relentlessly. Gain +1 skill with senses. You can automatically detect if someone you've seen before is within a short (10 unit) distance if they are currently visible.",
      "location": "4a",
      "data": "TG:SSK=1"
    },
    {
      "name": "Cold Blooded",
      "description": "You have seen some horrible things and do not break easily. Gain +1 skill with resilience and +2 maximum resolve.",
      "location": "4b",
      "data": "TG:SSI=1:A2=2"
    },
    {
      "name": "Action : Assassinate",
      "description": "You attempt to instantly kill a target with a single, precise strike. You must be hidden and adjacent to the target. Make a weapon attack with a simple weapon. If the attack hits, the target dies instantly if they are minion tier. Grunts are executed on 2 successful dice hits and standard creatures on 3.",
      "location": "5",
      "data": "XINE=1"
    },
    {
      "name": "Poison Master",
      "description": "You have mastered the art of toxins and chemical warfare. Gain +1 skill with alchemy. When you poison a creature, the first time they take damage from it, they take it twice.",
      "location": "6a",
      "data": "TG:CS3=1"
    },
    {
      "name": "Remote Kill",
      "description": "You have mastered the art of killing with traps. Gain +1 skill with engineering. When your traps do damage to a grunt or minion, they are executed even if the damage did not bring them to 0 health.",
      "location": "6b",
      "data": "TG:CS1=1"
    },
    {
      "name": "Master Assassin",
      "description": "You have achieved legendary status as a dealer of death. Gain +1 skill with complex ranged weapons and +1 skill with throwing weapons.",
      "location": "7",
      "data": "TG:WS6=1:WS2=1"
    }
  ]
}