{
  "id": 105,
  "name": "Berserker",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Battle-Hardened",
      "description": "Your body and mind have been conditioned through countless battles and hardships. Gain +1 skill with endurance and +1 resolve.",
      "location": "1",
      "data": "SSD=1:A2=1"
    },
    {
      "name": "Last Stand",
      "description": "Once per day, when you reach 0 health, you roll an endurance check and gain morale equal to the highest dice rolled instead of entering lifeline. While in lifeline, the first time you roll a 1 on the lifeline table, you reroll.",
      "location": "2a",
      "data": "XDNE=0"
    },
    {
      "name": "Killing Frenzy",
      "description": "Combat invigorates you rather than wearing you down. Gain +1 skill with might. When you kill a creature with a melee weapon, gain an additional action once per turn.",
      "location": "2b",
      "data": "TG:SSC=1"
    },
    {
      "name": "Deathless Rage",
      "description": "While at 0 health, you completely restore your energy when you hit a creature with an action. Additionally, gain +1 maximum energy.",
      "location": "3",
      "data": "TG:A3=1"
    },
    {
      "name": "Reaction : Vengeful Strike",
      "description": "In response to a creature within your melee range dealing damage to you, you make an attack against them with a melee weapon. When you make this attack, add a might dice into your weapon check pool.",
      "location": "4a",
      "data": "ZINE=1"
    },
    {
      "name": "Reaction : Endure Pain",
      "description": "In response to being targeted by an attack, your defense check automatically becomes a 3. Make an endurance check and double the result; if the result is higher than the total damage of the attack, the damage is halved before applying mitigation. ",
      "location": "4b",
      "data": "ZINE=1"
    },
    {
      "name": "Weapon Master",
      "description": "Your mastery of heavy weapons has reached professional levels. Gain +1 skill with complex melee weapons.",
      "location": "5",
      "data": "TG:WS5=1"
    },
    {
      "name": "Scarred Veteran",
      "description": "You have a reputation for being hard to take down. Gain +1 physical mitigation and +2 health.",
      "location": "6a",
      "data": "M1=1:A1=2"
    },
    {
      "name": "Twin Fury",
      "description": "You have the coordination and strength to wield heavy weapons in your offhand. Gain +1 coordination. You can dual wield any one-handed complex melee weapon, not just simple weapons.",
      "location": "6b",
      "data": "SSG=1:FF"
    },
    {
      "name": "Action : Devastating Blow",
      "description": "You make an attack with a melee weapon, but instead of making an attack with your melee weapon skill, use a might skill check. If you are below 10 health, this attack deals extra damage equal to your primary weapon damage.",
      "location": "7",
      "data": "XINE=1"
    }
  ]
}