{
  "id": 278,
  "name": "Bounty Hunter",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "id": 1743,
      "name": "Action : Focused Hunt",
      "description": "You use your Focus to concentrate on eliminating or capturing one Creature within 20 Units. While you maintain your Focus, you gain +2 Movement Speed towards that Creature and gain a +2 Attack Bonus Modifier but have a -2 Attack Bonus Modifier against all other Creatures.",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1744,
      "name": "First to Act",
      "description": "You become Good at Initiative",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": ""
    },
    {
      "id": 1745,
      "name": "Improved Nets",
      "description": "When you use a Net, the Required Check for avoiding a Grapple is increased by 2 and the Structure Points are doubled.",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1746,
      "name": "Information Gatherer",
      "description": "Gain +1 Search and +1 Insight",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "ASG=1:ASD=1"
    },
    {
      "id": 1747,
      "name": "Action : Wanted Alive",
      "description": "You Touch a Creature that is in Lifeline and cause them to become Unconscious and no longer lose Lifeline Points at the end of their turn. You can also make this Check against a Humanoid that has Died after the end of your last turn by making a Medicine Check of 10 or higher.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1748,
      "name": "Reaction : Quick Draw",
      "description": "Before your turn in Initiative Order, you can take the Use Action or make a Ranged Attack with a Light or Ultra-Light Ranged Weapon.",
      "mtype": "sub",
      "location": "4b",
      "cost": 2,
      "data": "ZX2"
    },
    {
      "id": 1749,
      "name": "Craft : Trophy Infusion",
      "description": "You can collect a trophy from a corpse and use it as an Infusion while crafting a Weapon, Shield or piece of Armor that does not increase the difficulty of the Required Check. While you have this item equipped, you gain a +2 Bonus to Block, Dodge and Resistance against Creatures that are equal to or lower Level and the same Creature Type as the trophy.",
      "mtype": "sub",
      "location": "5",
      "cost": 3,
      "data": "O"
    }
  ]
}