{
  "id": 105,
  "name": "Devout",
  "mtype": "secondary",
  "ruleset": 1,
 "options": [
      {
      "name": "Sworn Dedication",
      "description": "You devote yourself to a divine being or sacred force, vowing to uphold its tenets. Your creed demands the destruction of undead and dark-aligned creatures. You cannot willfully aid these beings or channel dark magic without forsaking your oath. Through your faith, you gain +2 maximum resolve.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "AE=1:TD"
    },
    {
      "name": "Sacred Vessel",
      "description": "Your body has become a conduit for energy. Gain +2 mitigation to aether damage. When you take 5 or more divine after mitigation is calculated, you gain +2 energy.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "TD"
    },
    {
      "name": "Fortified from Darkness",
      "description": "You gain +2 dark mitigation. When defending against a dark magic spell, gain a bonus dice.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "TD"
    },
    {
      "name": "Divine Charge",
      "description": "When you roll an 8 or higher on a divine magic spell check with the radiant subschool, it becomes charged. This does not work if you have broken your tenets without receiving penance",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Advisor",
      "description": "You gain +1 skill with insight. Additionally, you can grant an ally +1 resolve during each full rest.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "TD"
    },
    {
      "name": "Crusader",
      "description": "You openly bear the symbol of your faith, and your words carry divine authority. Gain +1 skill with presence. Accusations you make against those who consort with darkness are taken seriously by the faithful. Institutions aligned with your deity will offer shelter, healing, and support to you and your allies, so long as you remain in good standing.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "TG" 
    },
    {
      "name": "Dedicated",
      "description": "Your service to the heavens has given you a closer connection to the gods. You gain +1 skill with divine magic.",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "TG"
    },
    {
      "name": "Action : Brand the Wicked",
      "description": "You mark a creature, branding them and making them more suspectible to divine attacks. Any divine damage that strikes this enemy is not affected by divine mitigation.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "TO"
    },
    {
      "name": "Daily Reaction : Reward the Faithful",
      "description": "In response to making a resilience check, you can choose to succeed at the cost of 1 resolve. If you have broken your tenets without receiving penance, you must spend 5 resolve instead.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "TD"
    },
    {
      "name": "Cleansing Word",
      "description": "When you restore health to a creature, you also cleanse them of any disease, poison or exhaustion.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "TD"
    }
  ]
}
