{
  "id": 207,
  "name": "Diplomat",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "First Impression",
      "description": "You know how profound a first impression can be and spend extra effort to ensure you leave a good one. Gain +1 skill with persuasion. The first social check you make against a creature gains a bonus dice.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "SST=1:TO"
    },
    {
      "name": "Iron Composure",
      "description": "Negotaiting isn't always friendly, and you have been the target of some colorful language. You gain +2 maximum resolve and +2 psychic mitigation.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": "X"
    },
    {
      "name": "Divine Patience",
      "description": "Your experience with tense mediation has cause you to have an almost supernatural level of patience. Gain +1 skill with resilience. You roll a bonus dice against checks against the becoming maddened.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": "Z"
    },
    {
      "name": "Reaction : Parley",
      "description": "In response to a creature that you share a language with taking a violent action, you attempt to force them to reconsider by making a contested persuasion check against their resilience. On a success, the target can still choose to take the action but with two penalty dice. If the creature elects to not take their action, they will immediately use it as a reaction without expending energy if anyone takes a hostile act towards them or their allies.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "SSS=1:TO"
    },
    {
      "name": "Cultural Knowledge",
      "description": "You gain +1 skill with academics. When making any knowledge check involving the rituals, ceremonies or customs involving another culture, you gain a 1 bonus dice.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "SSR=1:TO"
    },
    {
      "name": "Travel Experience",
      "description": "You are extremely worldly, having experienced many cultures and dealt with many negotations. Gain +4 language points. Additionally, when you spend at least a month in a settlement, you learn the local language at a basic level.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "SSS=1:TO"
    },
    {
       "name": "Read the Room",
      "description": "You can quickly assess social dynamics. Gain +1 skill with insight. When entering a new social situation, you can determine what creature, if any, is in charge or has any authority.",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "X"
    },
    {
     "name": "Action : Cutting Words",
      "description": "You target an enemy that you share at least one language with that you are fluent in and make an attack roll using your persuasion skill against their insight in an attempt to influence them. You deal 5 psychic damage for each success you have. If you have 3 or more successes, you can instead choose to give the target either the confused or maddened conditions.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": "SSR=1:TO"
    },
    {
    "name": "Action : Demand Surrender",
      "description": "You target a creature that you share at least one language with that you are fluent in and force them to make a resilience check against your contested persuasion check. If the target of this ability is above 5 health, the result of their resilience check is doubled. If a creature has 0 health or 0 resolve, their resilience check is halved instead.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": "SSQ=1:LG"
    },
    {
 "name": "Wordsmith",
      "description": "You seem to always know the right thing to say. You gain +1 skill with persuasion. When you make a persuasion check, the minimum dice value you can roll is a 6.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "SST=1:SSR=1:X"
    }
  ]
}