{
  "id": 105,
  "name": "Elementalist",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Primal Attunement",
      "description": "Your deep communion with primal forces has opened new pathways of understanding. Gain +1 skill with magic knowledge and +1 spell capacity.",
      "location": "1",
      "data": "SSN=1:A9=1"
    },
    {
      "name": "Action : Shaped Elements",
      "description": "You channel a primal spell that has an area effect and can choose who is or isn't included in the effects of it, allowing you to avoiding hurting allies.",
      "location": "2a",
      "data": "XIME=1"
    },
    {
      "name": "Reaction : Lightning Rod",
      "description": "In response to you or an ally(s) within a very short (5 unit) distance being attacked by an ability that deals electric damage, you can choose to absorb all of the electrical energy instead of resisting it. Your electric mitigation becomes 0 when calculating the damage, but your energy is completely restored if you take at least 5 electric damage. If the attack is over an area, you take double the electric damage instead and gain an additional action on your next turn.",
      "location": "2b",
      "data": "ZMNE=0"
    },
    {
      "name": "Planar Specialization",
      "description": "You form a bond with one of the elemental planes [fire, earth, air, water], learning its language. Additionally, you can sense if elementals from this plane are within a moderate (20 unit) distance.",
      "location": "3",
      "data": "TG"
    },
    {
      "name": "Weathersense",
      "description": "Your mastery of the elements extends into the weather systems of the world. Gain +1 skill with senses. Additionally, you can reliably predict the weather for the next day and get hints for impending natural cataclysms like earthquakes, hurricanes and eruptions up to a week in advance.",
      "location": "4a",
      "data": "TG:SSK=1"
    },
    {
      "name": "Elemental Strikes",
      "description": "You are skilled in converting residual energy from spells into your weapons. Gain +1 skill with simple melee weapons. After dealing elemental damage [electric, heat, cold], any physical damage on the next attack you make with a melee weapon is converted to that damage type. This effect expires at the start of your next turn.",
      "location": "4b",
      "data": "TG:WS3=1"
    },
    {
      "name": "Master of the Elements",
      "description": "You have mastered the elements. Gain +1 skill with primal magic.",
      "location": "5",
      "data": "YS2=1"
    },
    {
      "name": "Summoner",
      "description": "When you summon an elemental using primal magic, you can use it's elemental mitigations [cold, heat, electric, physical] in place of your own when you take those damage types. Additionally, when you charge a spell that summons an elemental, you can use double the components to increase the allowed creature tier by 1.",
      "location": "6a",
      "data": "TG"
    },
    {
      "name": "Fully Attuned",
      "description": "You gain +2 mitigation to cold, heat and electric damage. Additionally, you are immune from damage from non-magical sources of heat, cold or electric such as weather or natural phenomenon.",
      "location": "6b",
      "data": "TG:M2=2:M3=2:M4=2"
    },
    {
      "name": "Daily Action : Elemental Cataclysm",
      "description": "You unleash a laser of elemental fury at a target within a short (10 unit) distance. You roll a primal spell attack against your target's defense check, with a maximum of 4 dice in the pool, each representing a different element [electric, heat, cold, physical]. For each dice that hits, you choose the element and deal 10 damage of that type.",
      "location": "7",
      "data": "XDME=3"
    }
  ]
}