{
  "id": 110,
  "name": "Hordeslayer",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Horde Fighting",
      "description": "You excel at navigating chaotic melees. You do not provoke opportunity attacks or reactions triggered based on movement from minions, grunts or swarms.",
      "location": "1",
      "data": ""
    },
    {
      "name": "Action : Chaos Strike",
      "description": "You utilize the chaos around you to make a strike against an adjacent enemy. For each adjacent enemy not including your target, roll a bonus dice on your attack.",
      "location": "2a",
      "data": ""
    },
    {
      "name": "Reaction : Quick Strike",
      "description": "In response to a grunt or minion making an attack with a melee weapon against you, first make an attack against them with a simple melee weapon.",
      "location": "2b",
      "data": ""
    },
    {
      "name": "In the Fray",
      "description": "You're built for the chaos of mass combat. Gain +1 physical mitigation and +2 health.",
      "location": "3",
      "data": ""
    },
    {
      "name": "Crowd Control",
      "description": "Your strength lets you manhandle multiple foes. Gain +1 skill with might. When you take the shove action, you can target an additional creature in range.",
      "location": "4a",
      "data": "SS0=1"
    },
    {
      "name": "Slayer's Resolve",
      "description": "Being outnumbered only makes you stronger. Gain +1 skill with endurance. When making endurance checks, roll a bonus die for every adjacent enemy.",
      "location": "4b",
      "data": "SS1=1"
    },
    {
      "name": "Weapon Master",
      "description": "Heavy weapons feel light in your hands. Gain +1 skill with complex melee weapons.",
      "location": "5",
      "data": "WS3=1"
    },
    {
      "name": "Follow Through",
      "description": "You have become deft in wielding cumbersome weapons. Gain +1 skill with coordination. When you damage an enemy using the Attack action with a complex melee weapon, you can choose an additional target that is within your melee range. If that target fails their defense check, they take half damage from your initital attack.",
      "location": "6a",
      "data": "SS1=1"
    },
    {
      "name": "Terror of the Masses",
      "description": "Your brutal efficiency terrifies lesser foes. Gain +1 skill with presence. When you kill an enemy, make a presence check against the resilience of all other adjacent minions or grunts. On a failure, those creatures gain the afraid condition.",
      "location": "6b",
      "data": "SSR=1"
    },
    {
      "name": "Action : Whirlwind",
      "description": "You become a spinning vortex of death. Make a single melee attack with a penalty die against all enemies within your weapon's reach. Gain energy equal to the number of creatures killed by this attack.",
      "location": "7",
      "data": ""
    }
  ]
}