{
  "id": 105,
  "name": "Illusionist",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Magician",
      "description": "You've perfected the art of stage magic through mundane and magical means. Gain +1 skill with coordination. You can also make unequipped small objects vanish when you touch them. A search or logic check of 5 or higher can see through the trick or find the item on your person.",
      "location": "1",
      "data": "TG:SSG=1"
    },
    {
      "name": "Deceptive Aura",
      "description": "You shroud yourself in a veil of illusion magic that confounds those who try to read you. Gain +1 skill with persuasion. When a creature uses insight, senses, or magic to detect lies or read your intentions, they suffer a penalty dice on their check.",
      "location": "2a",
      "data": "TG:SST=1"
    },
    {
      "name": "Charlatan",
      "description": "You use your illusion skills for less honorable pursuits. Gain +1 skill with thievery. When engaged in a game of chance or some other gamble with an individual, you gain a bonus dice to any social checks against them.",
      "location": "2b",
      "data": "TG:SSH=1"
    },
    {
      "name": "Empowered Illusions",
      "description": "Your illusions become more convincing and harder to resist. Illusion spells that require a logic check to deduce if they are real gain are more difficult to deduce, gaining a +2 to their required check.",
      "location": "3",
      "data": "TG"
    },
    {
      "name": "Action : Illusory Feint",
      "description": "You make an attack with a weapon while attempting to mask the true attack with illusion magic. Make an attack with a weapon while adding a meta magic dice into the attack check dice pool.",
      "location": "4a",
      "data": "XIME=1"
    },
    {
      "name": "Reaction : Duplicity",
      "description": "In response to being targeted by an attack, you create a duplicate image of yourself. Roll a metamagic check as your defense check. If successful, the attack hits the duplicate instead of you, causing it to disappear harmlessly.",
      "location": "4b",
      "data": "ZIME=1"
    },
    {
      "name": "Master Illusionist",
      "description": "Your mastery over illusion magic has grown considerably. Gain +1 skill with meta magic. Additionally, you can use meta magic checks instead of logic checks when attempting to see through or detect illusions.",
      "location": "5",
      "data": "TG:YS3=1"
    },
    {
      "name": "Disguiser",
      "description": "Your performances become more convincing through magic. Gain +1 skill with expression. You can channel the Magical Disguise spell without requiring a check. When channeling it this way, the spell is automatically charged but can only be used on you. The disguise lasts until a full rest or until you use the spell to take your original form.",
      "location": "6a",
      "data": "SSQ=1:TG"
    },
    {
      "name": "Arcane Illusionist",
      "description": "Your illusions have become so refined they border on true conjuration and enchantment. Gain +1 skill with arcane magic. When you channel an arcane spell, you can make the spell's visual and auditory effects appear to originate from any point within a short (10 unit) distance of you.",
      "location": "6b",
      "data": "YS6=1:TG"
    },
    {
      "name": "Action : Mindbreaker",
      "description": "You target a creature within a short (10 unit) distance and infiltrate their mind, causing them to see whatever you choose by rolling a meta magic spell attack against a contested logic or resilience check. For each dice that hits, deal 2 psychic damage. For each dice that is a critical hit, the damage is increased to 4. If they take at least 10 psychic damage after mitigation is calculated, they become confused. A creature can only be the target of this ability once until you complete a full rest.",
      "location": "7",
      "data": "XIME=2"
    }
  ]
}