{
  "id": 105,
  "name": "Illusionist",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Master of Disguise",
      "description": "You have learned to alter your appearance through magical means without effort. You can channel the Disguise Self spell at will and it does not require concentration.",
      "location": "1",
      "data": "TG"
    },
    {
      "name": "Shadow Play",
      "description": "Shadows bend to your will through subtle magic. Gain +1 skill with stealth. You can manipulate your shadow to move independently, allowing you to hide or distort it completely, making it harder for others to track your movements or determine your exact position.",
      "location": "2a",
      "data": "SSO=1:TG"
    },
    {
      "name": "Charlatan",
      "description": "You use your illusion skills for less honorable pursuits. Gain +1 skill with thievery. When engaged in a game of chance or some other gamble with an individual, you gain a bonus dice to any social checks against them.",
      "location": "2b",
      "data": "SSP=1:TG"
    },
    {
      "name": "Empowered Illusions",
      "description": "Your illusions become more convincing and harder to resist. Spells tagged as illusions gain a +2 to the required check to determine if they are real or not.",
      "location": "3",
      "data": "TO"
    },
    {
      "name": "Action : Illusory Feint",
      "description": "You make an attack with a weapon while attempting to mask the true attack with illusion magic. Make both a weapon attack check and an alteration magic check, then add the highest dice from your alteration magic check to your weapon attack dice pool.",
      "location": "4a",
      "data": "TO"
    },
    {
      "name": "Reaction : Duplicity",
      "description": "In response to being targeted by an attack, you create a duplicate image of yourself. Roll an alteration magic check as your defense. If successful, the attack hits the duplicate instead of you, causing it to disappear harmlessly.",
      "location": "4b",
      "data": "TD"
    },
    {
      "name": "Master Illusionist",
      "description": "Your mastery over alteration magic has grown considerably. Gain +1 skill with alteration magic. Additionally, you can use alteration magic checks instead of logic checks when attempting to see through or detect illusions.",
      "location": "5",
      "data": "TG"
    },
    {
      "name": "Magician",
      "description": "You've perfected the art of stage magic through mundane and magical means. Gain +1 skill with expression. You learn the illusify spell and can use it at will without requiring your concentration.",
      "location": "6a",
      "data": "SSS=1:TG"
    },
    {
      "name": "Vivid Imagination",
      "description": "The terrors of the world are nothing compared to the horrors you have created as illusions. Gain +1 maximum resolve and +1 psychic mitigation.",
      "location": "6b",
      "data": "SSG=1:TD"
    },
    {
      "name": "Identity Thief",
      "description": "Your disguise self ability also allows you to transform into non-humanoid creatures you have encountered that your size.",
      "location": "7",
      "data": "TG"
    }
  ]
}