{
  "id": 267,
  "name": "Infiltrator",
  "mtype": "secondary",
  "ruleset": 0,
  "options": [
    {
      "id": 1666,
      "name": "Reliable Disguises",
      "description": "You can create 3 Personas the same Size as you that each require a Disguise Kit which does not get consumed upon use. Each Persona can consist of mannerisms and accurate accents that you are able to replicate. While you are disguised with one of the Personas, it is not possible for a Creature to identify your other identities through non-magical means.",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1667,
      "name": "Action : Sabotage",
      "description": "You make a Thievery or Engineering Check and touch an Object such as a mechanism, door, lever or other object that can be used, activated or triggered.",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": "XX3"
    },
    {
      "id": 1668,
      "name": "Free Action : Stride",
      "description": "You quickly dash up to 4 Units, allowing you to pass through a Creature that is Large or smaller without making a Check or provoking Reactions.",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "Y"
    },
    {
      "id": 1669,
      "name": "Blend In",
      "description": "Gain +1 Performance, +1 Thievery and +1 Stealth",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "AS4=1:ASE=1:ADA=1"
    },
    {
      "id": 1670,
      "name": "Action : Quick Change",
      "description": "In repsonse to breaking Line of Sight with a Creature or multiple Creatures, you quickly change Personas. If a Creature gains Line of Sight on your new Persona before the start of your next turn and the circumstances could be considered suspicious, you make a Contested Performance Check against their Insight in an attempt to fool them.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1671,
      "name": "Action : Incapacitate",
      "description": "You attempt to apply a Tranquilizer Serum to a Beast, Humanoid or Monster by making a Contested Initiative Check. If successful, the Required Check on the Tranquilizer Serum is increased by 2. If you are Hidden, gain a 1d4 Bonus to your Initiatve Check and increase the Required Check on the Serum by 4.",
      "mtype": "sub",
      "location": "4b",
      "cost": 3,
      "data": "XX3"
    },
    {
      "id": 1672,
      "name": "Blown Cover",
      "description": "Gain +1 Movement Speed, +1 Acrobatics and +1 Dodge",
      "mtype": "sub",
      "location": "5",
      "cost": 2,
      "data": "AD2=1:AS3=1:AV=1"
    }
  ]
}