{
  "id": 999,
  "name": "Knight",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Knight's Order",
      "description": "You've been knighted and sworn to an order, bearing their heraldry. You can requisition supplies and mounts for order business, claim hospitality at allied holdings, speak with order authority in legal matters, and receive aid from fellow knights. You gain a squire companion using the Squire statblock (costs 100 gold to replace if killed). You must uphold your order's values to receive these benefits.",
      "location": "1",
      "data": ""
    },
    {
      "name": "Reaction : In the Vanguard",
      "description": "In response to having 2 or more adjacent enemies, you can take the Defense action as a reaction.",
      "location": "2a",
      "data": "ZINE=0"
    },
    {
      "name": "Daily Reaction : Eternal Glory",
      "description": "In response to being targeted by an attack from a champion tiered creature or higher, you roll a presence check and gain morale equal to the result. If you still have remaining morale after the damage is calculated, you can transfer any amount of remaining morale to a single ally within a very short (5 unit) distance.",
      "location": "2b",
      "data": "ZDNE=1"
    },
    {
      "name": "Second Skin",
      "description": "You are well acquainted with getting the most out of your armor. When you are wearing heavy armor, gain +1 physical and +1 aetheric mitigation.",
      "location": "3",
      "data": "CC[M1=1,M7=1]"
    },
    {
      "name": "Noble",
      "description": "Knights have always held a special title of nobility. You gain +1 skill with presence. You can use a presence check instead of persuasion when speaking with other nobility.",
      "location": "4a",
      "data": "SSR=1"
    },
    {
      "name": "Bravery",
      "description": "Knights are known as some of the most brave warriors, and are the stuff of legend. Gain +1 skill with resilience. When you recover from the afraid condition, you are immune to gaining the condition again until the end of combat.",
      "location": "4b",
      "data": "SSI=1"
    },
    {
      "name": "Action : Knight's Mantle",
      "description": "You designate an ally who is not impaired within a very short (5 unit) distance and bring them under your protection. Until the start of their turn, they benefit as if they had taken the Defense action on their turn. If a creature makes an attack against the target of your mantle, you gain a bonus dice on any attacks against them until the end of your next turn.",
      "location": "5",
      "data": "XINE=1"
    },
    {
      "name": "Improved Squire",
      "description": "Your squire has trained alongside you and proven themselves in battle. Your squire is upgraded to use the Fledgling Knight statblock instead of the Squire statblock.",
      "location": "6a",
      "data": ""
    },
    {
      "name": "Paladin",
      "description": "Your sacred vows grant you access to divine magic. Gain +1 skill with white magic. When you channel a white magic spell while wearing heavy armor, you can use your presence skill in place of white magic for the spell check.",
      "location": "6b",
      "data": "YS4=1"
    },
    {
      "name": "Knight of the Old Order",
      "description": "You are counted among one of the most dedicated knights in your order. Gain +2 maximum morale and +3 maximum resolve.",
      "location": "7",
      "data": "A8=2:A2=3"
    }
  ]
}