{
  "id": 105,
  "name": "Oracle",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Mystic Echoes",
      "description": "Your connection to mystical forces deepens your understanding. Gain +1 skill with magic. When you inspect a magical item, you can determine the last time it was used and a vague nature of the type of creature who wielded it.",      
      "location": "1",
      "data": "TG:SSN=1"
    },
    {
      "name": "Fortified Soul",
      "description": "Your soul is especially resistant to things that would damage it. Gain +2 mitigation to aethericic damage.",
      "location": "2a",
      "data": "TG:M7=2"
    },
    {
      "name": "Threads of Fate",
      "description": "You can perceive the mystical connections between people and events. Gain +1 skill with insight. When you meet someone for the first time, you can sense if they are connected to your destiny or will play a significant role in future events.",
      "location": "2b",
      "data": "TG:SSS=1"
    },
    {
       "name": "Dangersense",
      "description": "You possess an innate sense of danger that warns you of significant threats. When an elite-tier creature or higher, or a deadly trap that poses a threat to you is within a moderate (20 unit) distance, you automatically sense the presence of danger without identifying its specific source or location.",
      "location": "3",
      "data": "TG"
    },
    {
      "name": "Signs",
      "description": "You can read the subtle signs and omens that others miss. Gain +1 skill with senses. You can sense when you are being watched by making a senses check of 8 or higher, both magically and naturally.",
      "location": "4a",
      "data": "TG:SSK=1"
    },
    {
      "name": "First to Act",
      "description": "You are always prepared and can act quickly to events. Gain +1 skill to coordination. You also reroll 1's when rolling a coordination check to determine initiative.",
      "location": "4b",
      "data": "TG:SSG=1"
    },
    {
      "name": "Seer",
      "description": "Your mastery of divination magic has grown considerably. Gain +1 skill with mysticism magic.",
      "location": "5",
      "data": "YS5=1"
    },
    {
      "name": "Action : Trance of the Oracle",
      "description": "You dedicate your concentration to entering a trance, perceiving the possible futures of combat. Gain +1 skill with concentration. While in this trance, you roll all weapon attack and defense checks with a bonus dice. If you lose concentration while tranced in this way, you become dazed.",
      "location": "6a",
      "data": "XIME=1"
    },
    {
      "name": "Reaction : Bend Fate",
      "description": "In response to an attack roll of either a '1' or the maximum dice face being rolled within a short (10 unit) distance, force the attacker to reroll that single dice. If the reroll is the same number as the original roll, you take 5 psychic damage.",
      "location": "6b",
      "data": "ZIME=1"
    },
    {
      "name": "Portent",
      "description": "At the start of each day, you peer into the threads of fate and possibility. Roll a mysticism magic check and record each individual dice result. Throughout the day, you can replace any instantaneous roll made by you or an ally with one of these stored results. Each result can only be used once and cannot be applied to checks that take extended time to complete.",
      "location": "7",
      "data": "TG"
    }
  ]
}