{
  "id": 106,
  "name": "Sentinel",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Student of Combat",
      "description": "You have studied countless fighting styles and martial traditions throughout history. Gain +1 skill with academics.",
      "location": "1",
      "data": "SSN=1"
    },
    {
      "name": "Reaction : Know Thy Enemy",
      "description": "In response to being targeted by an attack, you analyze your opponent's stance and technique. Roll an academics check with a single dice and add that die to your defense check pool.",
      "location": "2a",
      "data": "ZINE=1"
    },
    {
      "name": "Action : Find Weakness",
      "description": "You make a probing attack to study your opponent's defenses. Make an academics check with a single die as your attack roll. If the attack hits, you deal damage equal to your weapon's primary damage and learn one mitigation type or immunity of your choice that the target possesses.",
      "location": "2b",
      "data":"XINE=1"
    },
    {
      "name": "Calm in the Storm",
      "description": "Gain +1 psychic mitigation and +1 aetheric mitigation.",
      "location": "3",
      "data": "M8=1:M7=1"
    },
    {
      "name": "Sharp Mind",
      "description": "Gain +1 skill with logic. You can use your logic skill to try to recover from being afraid or confused.",
      "location": "4a",
      "data": "SSL=1"
    },
    {
      "name": "Focused Mind",
      "description": "Gain +1 skill with concentration. When you take damage and are forced to make a concentration check, the maximum result you need to maintain concentration can never exceed 10.",
      "location": "4b",
      "data": "SSJ=1"
    },
    {
      "name": "Action : Sentinel's Stance",
      "description": "You enter a state of perfect concentration, analyzing the flow of battle. While in this stance, you add a single academics die to all melee weapon attacks during combat. You cannot speak while maintaining this focus. The stance ends if you lose concentration, speak or gain any mental condition.",
      "location": "5",
      "data": "XINE=0"
    },
    {
      "name": "Martial Arts",
      "description": "Gain +1 skill with brawling attacks. When a creature attempts to shove, grab or displace you with a melee attack, you can defend by making a brawling check instead.",
      "location": "6a",
      "data": "WS1=1"
    },
    {
      "name": "Bastion",
      "description": "You possess a bastion of defense. Gain +1 skill with evasion and +1 skill with deflection.",
      "location": "6b",
      "data": "SSE=1:SSB=1"
    },
    {
      "name": "Daily Action : Attack of Legends",
      "description": "You channel the legendary techniques of history's greatest warriors into a single devastating strike against a champion tiered creature or higher. Roll both an academics check and a weapon attack, discarding the lowest die from each pool before combining them. If this attack brings an elite or higher creature to 0 health, all allies within a moderate (20 unit) distance gain 20 resolve. ",
      "location": "7",
      "data": "XDNE=1"
    }
  ]
}