{
  "id": 255,
  "name": "Shadow",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "id": 1582,
      "name": "Action [Daily] : Shadowspawn",
      "description": "You detach your shadow in an unoccupied area adjacent to you. It becomes a dark creature with health equal to double your level while sharing the same mitigations and movement speed as you. You can use a subsequent action to recall or deploy your shadow unless it reaches 0 health. The shadow acts on your Initiative and has one Action which it can only use to either Move or Attack with a Melee Weapon you have equipped. The shadow is immune to all conditions and has a size equal to your own.",
      "mtype": "sub",
      "location": "1",
      "cost": 2,
      "data": "XD1"
    },
    {
      "id": 1583,
      "name": "Reaction : Swap",
      "description": "In response to either you or your Shadow being the target of an Attack, swap places causing the attack to be redirected. If your new position places you adjacent to a creature, you can make a Melee Attack against it.",
      "mtype": "sub",
      "location": "2a",
      "cost": 2,
      "data": "ZX2"
    },
    {
      "id": 1584,
      "name": "Free Action : Shadow Strike",
      "description": "Your Shadow teleports up to 2 Units and uses the Attack action.",
      "mtype": "sub",
      "location": "2b",
      "cost": 2,
      "data": "Y"
    },
    {
      "id": 1585,
      "name": "Shadow Aura",
      "description": "Both yours and your Shadow's Melee Attacks deal 2d4 bonus psychic damage on a True Hit. This bonus is increased to 2d8 at level 7 and 2d12 at level 11.",
      "mtype": "sub",
      "location": "3",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1586,
      "name": "Inner Darkness",
      "description": "You gain +1 Stealth and +3 Dark Mitigation. Additionally, your Shadow becomes Immune to Dark Damage.",
      "mtype": "sub",
      "location": "4a",
      "cost": 2,
      "data": "AS4:AD7=3"
    },
    {
      "id": 1587,
      "name": "Dissipating Veil",
      "description": "After one round of not taking an action, your Shadow becomes Invisible until it makes an Attack.",
      "mtype": "sub",
      "location": "4b",
      "cost": 2,
      "data": "TG"
    },
    {
      "id": 1588,
      "name": "Synchronous Shadow",
      "description": "Your Shadow gains another Action which can only be used to take the Use or Move action. Additionally, when it takes the Attack Action, it can use one of your Unique Actions as if you were using it.",
      "mtype": "sub",
      "location": "5",
      "cost": 3,
      "data": "TG"
    }
  ]
}