{
  "id": 105,
  "name": "Witch",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Make Familiar",
      "description": "As part of an hour long ritual, you designate a tiny creature as your familiar. The tiny creature must either be an ally or a pet. This familiar does not count against your pet limit and can be resummoned by completing the ritual again, even if it dies. You can put yourself in stasis to enter the mind of your familiar, controlling it and experiencing it's senses.",
      "location": "1",
      "data": "TG:XINE=1"
    },
    {
      "name": "Reaction : Blood Price",
      "description": "In response to a creature dealing physical damage to you, deal half the damage you took after mitigation was calculated back to that creature as dark damage. If you have the bleeding condition, this damage becomes equal to the amount of damage done to you.",
      "location": "2a",
      "data": "ZIME=1"
    },
    {
      "name": "Action : Sigil",
      "description": "Immediately after channeling a spell, instead of it being activated, infuse an object you are touching with that magic. When this occurs, you specify a condition to take place within the next day which will then cause the spell to activate. If this condition never happens within that timeframe, the spell is removed. You can only have one sigil active at a time.",
      "location": "2b",
      "data": "XIME=1"
    },
    {
      "name": "Occult Senses",
      "description": "Your senses have become acutely calibrated with dark magic. Your familiar or any creature summoned by you has ultravision. Additionally, you gain +1 skill with senses.",
      "location": "3",
      "data": "TG:SSK=1"
    },
    {
      "name": "Dark Contracts",
      "description": "You are experienced in listening to the plights of others so that you may use your magic to aid them for a cost. Gain +1 skill with persuasion. When you enter into a contract with a humanoid that willfully breaks an agreement you have come to, they become permanently affected by your Hex action. Once per day, you can channel a spell as a ritual with the creature as your target, as long as they are on the same plane as you.",
      "location": "4a",
      "data": "TG:SSS=1:SST=1"
    },
    {
      "name": "Darkcraft",
      "description": "You are an experienced witch who relies on dark arts and brewing potent potions. You gain +1 skill with alchemy and +1 dark mitigation.",
      "location": "4b",
      "data": "TG:CS3=1:M5=1"
    },
    {
      "name": "Action : Hex",
      "description": "You place a hex on a creature you can see within a short (10 unit) distance. Whenever this creature takes dark damage, they suffer a penalty dice to the next skill check they made until the end of their next turn.",
      "location": "5",
      "data": "XIME=1"
    },
    {
      "name": "Shadow Witch",
      "description": "You are practiced in the dark arts. Gain +1 skill with dark magic. If you have a familiar, when you channel a dark spell using a ritual, the material components and the duration required are reduced by half.",
      "location": "6a",
      "data": "TG:YS1=1"
    },
    {
      "name": "Lunar Witch",
      "description": "You are practiced in lunar magic. Gain +1 skill with primal magic and you can learn spells from the cosmic subschool.",
      "location": "6b",
      "data": "TG:YS2=1"
    },
    {
      "name": "Coven",
      "description": "You either create or join an established coven of up to 4 other witches with this trait. Each member of the coven uses the highest resilience skill in the coven when making checks. Additionally, coven members can dedicate their concentration to telepathically communicate or see through the eyes of any other member assuming they are on the same plane of existence. A member can only leave a coven if they die.",
      "location": "7",
      "data": "TG"
    }
  ]
}