{
  "id": 112,
  "name": "Wizard",
  "mtype": "secondary",
  "ruleset": 1,
  "options": [
    {
      "name": "Arcane Mana",
      "description": "You've learned to tap into pure magical essence, gaining 3 'Mana Points' which can each be used to channel a spell that you know without requiring energy.",
      "location": "1",
      "data": "AM=3"
    },
    {
      "name": "Theoretical Mastery",
      "description": "Your mind processes magical formulae with machine-like precision. Gain +1 skill with logic. You can continue a ritual that you prematurely ended as long as you restart within 6 hours of ending it without a penalty.",
      "location": "2a",
      "data": "TG:SSJ=1"
    },
    {
      "name": "Scribe",
      "description": "Ancient runes and mystical symbols flow from your quill like water. Gain +1 skill with glyphcraft and become fluent in one magical language.",
      "location": "2b",
      "data": "TG:CS5=1"
    },
    {
      "name": "Action : Mana Burn",
      "description": "You channel 1 or more remaining mana you have available at a creature within a short (10 unit) distance. Roll a concentration dice for each Mana Point you have as an attack check against your target's resilience check. For each success, you deal 6 aetheric damage. Critical dice deal 10 aetheric damage instead.",
      "location": "3",
      "data": "XIME=1"
    },
    {
      "name": "Researcher",
      "description": "Your spell research is unparalleled. Gain +1 skill with magic. Once per day, when researching a spell, you do not suffer the penalty for not knowing it.",
      "location": "4a",
      "data": "TG:SSN=1"
    },
    {
      "name": "Structured Mind",
      "description": "A wizard's mind must be sharp to keep a large selection of spells. Gain +1 skill with concentration. You never truly forget spells; instead you can switch out spells that you know with any spell that you knew in the past at the end of a full rest.",
      "location": "4b",
      "data": "TG:SSJ=1"
    },
    {
      "name": "Master of Schools",
      "description": "Your mastery extends across multiple schools of magic. Gain +1 skill with primal magic and +1 skill with meta magic.",
      "location": "5",
      "data": "YS2=1:YS3=1"
    },
    {
      "name": "Arcane Scholar",
      "description": "Your dedication to magical study is unmatched. Gain +1 skill with academics and +3 spell capacity.",
      "location": "6a",
      "data": "SSN=1:A9=3"
    },
    {
      "name": "Wizard's Meditation",
      "description": "You spend an uninterrupted hour meditating where you cannot move or make any skill checks. Roll a concentration check; for each dice that is 10 or higher, restore a mana point. On any critical dice, you can also restore a fizzled spell.",
      "location": "6b",
      "data": "TG"
    },
    {
      "name": "Archmage",
      "description": "You gain 2 additional Mana Points. Using a Mana Point to channel a spell grants you a bonus dice on the spell check.",
      "location": "7",
      "data": "TG:AM=2"
    }
  ]
}