{"input": "What are the steps for character creation in Anyventure?", "output": "Character creation follows: 1) Select race for innate bonuses, 2) Select culture for flavor/social benefits, 3) Distribute 6 attribute points, 4) Determine weapon talents, 5) Choose personality traits."}
{"input": "How do I distribute attribute points?", "output": "All attributes start at 1. You have 6 points to distribute among Physique, Finesse, Mind, Knowledge, and Social. Maximum for any attribute is 4, minimum is 1."}
{"input": "Can I have 0 in an attribute?", "output": "No, player characters cannot have attributes below 1. All attributes start at 1 and you add points from there. Having 0 would mean inability to use any skills in that category."}
{"input": "What does having 4 in an attribute mean?", "output": "Having 4 in an attribute means you're 'gifted' in that area. You'll roll 4 dice for all skills under that attribute, giving you exceptional potential in those abilities."}
{"input": "How does race selection affect my character?", "output": "Races provide innate bonuses and traits. These might include attribute bonuses, special abilities, size categories, movement speeds, or unique racial features that define your character's capabilities."}
{"input": "What does culture provide?", "output": "Culture adds flavor and social benefits to your character. Cultures may provide bonus dice when interacting with specific groups like merchants, nobles, soldiers, or other cultural groups."}
{"input": "Can I change my attributes after character creation?", "output": "Attributes represent innate ability and are generally permanent after character creation. Only rare modules or special events might modify attributes. Choose carefully."}
{"input": "What weapon talents should I prioritize?", "output": "Depends on your build. Melee fighters want Simple or Complex Melee. Ranged fighters want Simple or Complex Ranged. Everyone starts with +1 in Unarmed and Throwing."}
{"input": "Is there multiclassing in Anyventure?", "output": "No, Anyventure has no classes at all. Instead, you customize your character through modules, which are skill trees you can mix and match as you earn module points."}
{"input": "How do personality traits work?", "output": "Personality traits affect how your character gains or loses Resolve through roleplay and combat. They create mechanical benefits for playing your character's personality consistently."}
{"input": "What's a good attribute spread for a warrior?", "output": "A warrior might use: Physique 3, Finesse 3, Mind 1, Knowledge 1, Social 1. This gives strong combat abilities through physical skills while maintaining minimum capabilities elsewhere."}
{"input": "What's a good attribute spread for a mage?", "output": "A mage might use: Physique 1, Finesse 1, Mind 2, Knowledge 4, Social 2. This maximizes Knowledge for magic skills while providing decent Mind for concentration and Social for interactions."}
{"input": "How many module points do I start with?", "output": "Starting module points aren't fixed - your GM awards them. Typically you'd start with enough to begin one or two modules, establishing your initial character concept and abilities."}
{"input": "Can I have multiple magic types?", "output": "Yes, if you have talents in multiple magic types. However, spreading talents thin means fewer dice per type. Most mages focus on one or two types for effectiveness."}
{"input": "What happens if I don't take any combat talents?", "output": "Without combat talents, you can't make weapon attacks effectively. You'd need to rely on magic, allies, or non-combat solutions. Even scholars usually take basic combat talents."}
{"input": "Do I need high Social attributes?", "output": "Social attributes help with persuasion, leadership, performance, and reading people. Low Social makes these interactions harder but isn't crippling if you have other strengths."}
{"input": "How does character size affect creation?", "output": "Character size (determined by race) affects certain skills. Large creatures get upgraded Might checks, small creatures get downgraded Might checks, affecting their dice types."}
{"input": "What languages do I start with?", "output": "Starting languages depend on your race and culture. Most characters begin with their racial language and a common trade language, with potential for more based on background."}
{"input": "Should I specialize or generalize attributes?", "output": "Both work. Specialists (4 in one attribute) excel in their area but struggle elsewhere. Generalists (2s and 3s) handle varied situations but lack peak performance."}
{"input": "What's the minimum to be functional in combat?", "output": "At minimum: 1 point in Physique or Finesse for defense skills, and talent in at least one weapon type. This gives basic ability to attack and defend."}