{"input": "How does weapon damage work in Anyventure?", "output": "Weapon damage is determined by how many attack dice beat the defense check. The first successful die deals primary damage, each additional successful die deals extra damage. No separate damage rolls."}
{"input": "What weapon talents do characters start with?", "output": "Characters start with: Unarmed +1, Throwing +1, Simple Melee +1, Simple Ranged +1, Complex Melee +0, Complex Ranged +0. Simple weapons and unarmed/throwing are easier for beginners."}
{"input": "How do I calculate damage if I hit with 3 dice?", "output": "If 3 dice beat the defense check: First die deals the weapon's primary damage, second and third dice each deal the weapon's extra damage. Total = primary + (extra × 2)."}
{"input": "What's the difference between evasion and deflection?", "output": "Evasion completely avoids attacks if higher than all attack dice, but is halved against area attacks. Deflection reduces damage by half unless you have a shield, and is halved against ranged/area attacks."}
{"input": "How do shields affect deflection?", "output": "Light shields remove the deflection penalty against single-target ranged attacks. Heavy shields remove the penalty against both ranged and area attacks, allowing full deflection checks."}
{"input": "When do critical hits happen?", "output": "Critical hits start at skill level 4 (d12): roll 12 for crit. At d16: roll 15-16. At d20: roll 18-20. Each critical adds the weapon's primary damage to total damage."}
{"input": "How does damage mitigation work?", "output": "If you have mitigation equal to or higher than incoming damage, you take 0 damage. If damage exceeds half your mitigation but not all, you take half damage. Otherwise, full damage."}
{"input": "What are the damage types in Anyventure?", "output": "There are 9 damage types: Physical, Heat, Cold, Electric, Dark, Divine, Arcane, Psychic, and Toxic. Different armors and abilities provide mitigation against specific types."}
{"input": "How many actions can I take per combat round?", "output": "Each round you can take 2 actions, move your standard movement (usually 4-6 units), and take as many reactions as you have energy for. Reactions only work after your first turn."}
{"input": "What happens at 0 health?", "output": "At 0 health, you can spend 2 resolve to stay conscious and continue fighting (called being in 'lifeline'). If you take 5+ damage while in lifeline, you roll on the lifeline table for consequences."}
{"input": "What is the lifeline table?", "output": "The lifeline table (1d8) determines what happens when taking 5+ damage at 0 health: 1=death check, 2=lost limb, 3=lingering injury, 4=severe wound, 5=cosmetic injury, 6=unconscious, 7=prone, 8=nothing."}
{"input": "How does initiative work?", "output": "Roll your Coordination skill for initiative. Act in order from highest to lowest. You can only use reactions after your first turn in combat, making high initiative valuable."}
{"input": "What are the default combat actions?", "output": "Default actions: Attack (0 energy), Channel Spell (varies), Rest (remove winded, +2 energy), Sprint (double move, 1 energy), Grapple (1 energy), Jump (1 energy, roll Fitness)."}
{"input": "What reactions are available by default?", "output": "Default reactions: Attack of Opportunity (1 energy when enemy leaves your reach), Cover Eyes (against vision attacks), Cover Ears (against sonic attacks), Fall Prone (drop to ground)."}
{"input": "How does the Attack of Opportunity reaction work?", "output": "When an enemy leaves your threatened area, you can spend 1 energy to make an attack against them as a reaction. This helps control battlefield positioning."}
{"input": "What is a defense check?", "output": "A defense check is either an evasion or deflection roll made when attacked. The defender chooses which to use. Some special attacks may call for different checks instead."}
{"input": "How does movement work in combat?", "output": "Standard movement is 4-6 units per round. You can move and take 2 actions. The Sprint action doubles your movement for 1 energy, useful for closing gaps or escaping."}
{"input": "Can I attack without spending energy?", "output": "Yes, the basic Attack action costs 0 energy. This ensures you can always make at least basic attacks even when low on energy resources."}
{"input": "How do area attacks work against defenses?", "output": "Against area attacks, both evasion and deflection checks are halved (rounded down) before comparing to the attack. Heavy shields remove this penalty for deflection only."}
{"input": "What happens if I run out of energy?", "output": "When you go negative energy, you must make an Endurance check of 10 or become Winded. The Winded condition prevents energy regeneration until you take a Rest action."}
{"input": "A goblin attacks with a spear, rolling 2d6 and getting 4, 6 against my defense of 5. What damage do I take?", "output": "The goblin hits with 1 die (the 6). If the spear has 3 primary damage and 2 extra damage, you take 3 damage total (just the primary, since only one die hit)."}
{"input": "An orc swings a battle axe, rolling 3d8: 7, 5, 2 vs my deflection of 6. How much damage?", "output": "The orc hits with 1 die (the 7). If the battle axe has 6 primary and 3 extra damage, you take 6 damage. With deflection, this is reduced to 3 damage unless you have a shield."}
{"input": "A dragon breathes fire, rolling 5d20: 18, 15, 12, 8, 19 against my evasion of 10. What's the damage?", "output": "The dragon hits with 4 dice (18, 15, 12, 19 all beat 10). If dragon breath has 12 primary and 6 extra damage, total is 12 + (6×3) = 30 damage."}
{"input": "I attack a bandit with my sword, rolling 3d10: 8, 4, 9 vs their evasion of 7. My sword has 5 primary, 3 extra. What damage?", "output": "You hit with 2 dice (8 and 9 beat 7). Damage is 5 primary + 3 extra = 8 total damage to the bandit."}
{"input": "A skilled knight attacks with a longsword, rolling 4d12: 12, 7, 3, 10 vs deflection 8. Longsword is 7 primary, 4 extra. Damage?", "output": "The knight hits with 3 dice (12, 7, 10 beat 8) and gets a critical (12 on d12). Damage: 7 primary + 4 extra + 4 extra + 7 critical = 22 damage."}
{"input": "A weak skeleton swings a rusty sword, rolling 1d6: 4 vs my evasion of 6. What happens?", "output": "The skeleton misses completely. The 4 doesn't beat your evasion of 6, so you take no damage and avoid the attack entirely."}
{"input": "An elite guard attacks with a halberd, rolling 4d16: 16, 11, 6, 13 vs deflection 9. Halberd has 8 primary, 5 extra. Damage?", "output": "The guard hits with 3 dice (16, 11, 13 beat 9) with a critical (16). Damage: 8 primary + 5 extra + 5 extra + 8 critical = 26 damage, halved by deflection to 13."}
{"input": "A giant spider bites, rolling 2d8: 6, 8 vs evasion 7. Spider bite has 4 primary, 2 extra damage. What do I take?", "output": "The spider hits with 1 die (8 beats 7). You take 4 damage from the primary hit. The spider likely also applies poison effects."}
{"input": "I'm fighting a troll. It claws me with 3d12: 9, 12, 5 vs my deflection of 8. Claws are 6 primary, 4 extra. Damage?", "output": "The troll hits with 2 dice (9 and 12 beat 8) with a critical (12). Damage: 6 primary + 4 extra + 6 critical = 16 damage, halved to 8 by deflection."}
{"input": "A master archer shoots me, rolling 4d20: 20, 14, 8, 12 vs evasion 11. Longbow arrow is 5 primary, 3 extra. How much damage?", "output": "The archer hits with 3 dice (20, 14, 12 beat 11) with a critical (20). Damage: 5 primary + 3 extra + 3 extra + 5 critical = 16 damage."}
{"input": "A rat bites me, rolling 1d4: 3 vs my deflection of 4. What happens?", "output": "The rat misses. Its 3 doesn't beat your deflection of 4, so the tiny bite fails to penetrate your defenses."}
{"input": "An ancient lich casts a spell that hits for 4 dice vs my evasion of 12. I rolled 8. Spell has 10 primary, 7 extra. Damage?", "output": "All 4 spell dice hit (assuming they beat 8). You take 10 primary + (7×3) extra = 31 damage. This is likely arcane or dark damage type."}
{"input": "A hobgoblin captain swings a scimitar, rolling 3d10: 10, 6, 8 vs deflection 7. Scimitar is 4 primary, 3 extra. What damage?", "output": "The captain hits with 3 dice (all beat 7). Damage: 4 primary + 3 extra + 3 extra = 10 damage, halved to 5 by deflection."}
{"input": "I attack with my dagger, rolling 2d8: 7, 3 vs enemy evasion of 5. Dagger has 3 primary, 2 extra. My damage?", "output": "You hit with 1 die (7 beats 5). Your dagger deals 3 damage total (just primary damage, no extra since only one die hit)."}
{"input": "A dire wolf bites, rolling 3d10: 9, 2, 7 vs my evasion of 8. Bite is 5 primary, 3 extra damage. How much do I take?", "output": "The wolf hits with 1 die (9 beats 8). You take 5 damage from the bite. The wolf might also attempt to knock you prone or grapple."}
{"input": "An ogre swings a club, rolling 4d8: 8, 6, 4, 7 vs deflection 6. Club has 8 primary, 4 extra. What's the damage?", "output": "The ogre hits with 3 dice (8, 6, 7 beat 6). Damage: 8 primary + 4 extra + 4 extra = 16 damage, halved to 8 by deflection."}
{"input": "A legendary demon attacks with claws, rolling 6d20: 20, 18, 15, 12, 9, 17 vs evasion 13. Claws are 15 primary, 8 extra. Damage?", "output": "The demon hits with 5 dice (20, 18, 15, 17 beat 13) with a critical (20). Damage: 15 primary + (8×4) extra + 15 critical = 62 damage."}
{"input": "I throw a dagger, rolling 1d8: 6 vs enemy deflection of 7. What happens?", "output": "Your thrown dagger misses. The 6 doesn't beat their deflection of 7, so the blade fails to find its mark."}
{"input": "A wyvern stings with its tail, rolling 3d16: 16, 8, 11 vs my evasion of 10. Sting is 6 primary, 4 extra plus poison. Damage?", "output": "The wyvern hits with 2 dice (16, 11 beat 10) with a critical (16). Damage: 6 primary + 4 extra + 6 critical = 16 damage, plus poison effects."}
{"input": "An assassin backstabs me, rolling 4d12: 12, 9, 5, 8 vs my deflection of 6. Backstab is 6 primary, 4 extra. What damage?", "output": "The assassin hits with 3 dice (12, 9, 8 beat 6) with a critical (12). Damage: 6 primary + 4 extra + 4 extra + 6 critical = 20 damage, halved to 10 by deflection."}
{"input": "A young dragon breathes lightning, rolling 4d16: 15, 12, 8, 14 vs evasion 11. Breath is 9 primary, 5 extra. My damage?", "output": "The dragon hits with 3 dice (15, 12, 14 beat 11) with a critical (15). Damage: 9 primary + 5 extra + 5 extra + 9 critical = 28 electric damage."}
{"input": "A peasant swings a pitchfork, rolling 1d6: 5 vs deflection 4. Pitchfork is 2 primary, 1 extra. Damage?", "output": "The peasant hits with 1 die (5 beats 4). You take 2 damage, halved to 1 by deflection. The untrained attack barely scratches you."}
{"input": "A veteran soldier attacks with a spear, rolling 3d12: 11, 7, 4 vs evasion 8. Spear is 5 primary, 3 extra. What damage?", "output": "The soldier hits with 1 die (11 beats 8). You take 5 damage from the spear thrust (primary damage only)."}
{"input": "An earth elemental punches me, rolling 4d10: 10, 8, 6, 9 vs deflection 7. Punch is 7 primary, 4 extra. My damage?", "output": "The elemental hits with 3 dice (10, 8, 9 beat 7). Damage: 7 primary + 4 extra + 4 extra = 15 damage, halved to 8 by deflection."}
{"input": "A bandit shoots a crossbow, rolling 2d8: 6, 8 vs my evasion of 7. Crossbow bolt is 4 primary, 2 extra. Damage?", "output": "The bandit hits with 1 die (8 beats 7). You take 4 damage from the crossbow bolt piercing your defenses."}
{"input": "An ice giant swings a massive axe, rolling 5d16: 16, 13, 9, 11, 8 vs deflection 10. Axe is 12 primary, 6 extra. What damage?", "output": "The giant hits with 4 dice (16, 13, 11 beat 10) with a critical (16). Damage: 12 primary + (6×3) extra + 12 critical = 42 damage, halved to 21 by deflection."}
{"input": "A warlock blasts me with eldritch energy, rolling 3d12: 12, 8, 5 vs evasion 9. Blast is 6 primary, 4 extra. My damage?", "output": "The warlock hits with 2 dice (12, 8 beat 9) with a critical (12). Damage: 6 primary + 4 extra + 6 critical = 16 arcane damage."}
{"input": "I punch an enemy unarmed, rolling 2d6: 6, 4 vs their deflection of 5. Unarmed is 2 primary, 1 extra. Damage?", "output": "You hit with 1 die (6 beats 5). Your punch deals 2 damage, halved to 1 by their deflection. Unarmed attacks are typically weak but reliable."}
{"input": "A chimera breathes fire, rolling 4d20: 19, 16, 12, 8 vs evasion 14. Fire breath is 11 primary, 7 extra. What's my damage?", "output": "The chimera hits with 3 dice (19, 16 beat 14, but 12 doesn't). Damage: 11 primary + 7 extra + 11 critical (19) = 29 fire damage."}
{"input": "An armored knight charges with a lance, rolling 4d16: 15, 12, 9, 13 vs my evasion of 11. Lance is 9 primary, 5 extra. Damage?", "output": "The knight hits with 3 dice (15, 12, 13 beat 11) with a critical (15). Damage: 9 primary + 5 extra + 5 extra + 9 critical = 28 damage from the devastating charge."}
{"input": "How does initiative work in Anyventure?", "output": "Roll Concentration or Coordination for initiative. Compare to table: <4=Late phase, 4-7=Middle phase, 8-10=Early phase, >10=Early phase + Preparation. Minions/grunts always go Late phase."}
{"input": "What are the combat phases?", "output": "Combat phases are: Preparation (first round only, >10 initiative), Early (8+ initiative), Middle (4-7 initiative), Late (<4 initiative, plus all minions/grunts). Each phase resolves before the next."}
{"input": "What can I do in the Preparation phase?", "output": "In Preparation phase you can reposition, consume items, or make skill checks for information. You cannot attack or channel spells. Only characters with >10 initiative get Preparation phase."}
{"input": "Do minions roll initiative?", "output": "No, minions and grunts never roll initiative. They automatically act in the Late phase, making them predictable and easier to plan around."}
{"input": "I rolled 9 for initiative, what phase do I act in?", "output": "With initiative 9, you act in the Early phase. You don't get Preparation phase (need >10), but you go before Middle and Late phase creatures."}
{"input": "I rolled 12 for initiative, when do I act?", "output": "With initiative 12, you get Preparation phase (first round only) and then act in Early phase every round. This gives you maximum tactical advantage."}
{"input": "Multiple players rolled into Early phase, who goes first?", "output": "Player characters always go first within a phase, then enemies, then neutral NPCs. Players can choose their order among themselves for coordination."}
{"input": "Can I delay my initiative to a later phase?", "output": "Yes, you can defer to a later phase after rolling. This must be decided immediately after Preparation phase on round 1 and cannot be reversed."}
{"input": "How long is a combat round?", "output": "Each combat round lasts approximately 6 seconds. A 10-round fight would last about one minute in game time."}
{"input": "When can I use reactions?", "output": "You can use reactions at any time after you've taken your first turn in combat. On round 1, you cannot use reactions until after your turn completes."}
{"input": "What happens after the Late phase?", "output": "After the Late phase ends, the round is complete. The next round begins with Early phase (no more Preparation phases after round 1)."}
{"input": "An elite creature rolled 6 for initiative, when does it act?", "output": "With initiative 6, the elite acts in Middle phase. Since it's elite tier, it gets 1 action in Middle phase, 1 in Late phase, and another 1 action in Early phase next round."}
{"input": "How many actions do elite creatures get per round?", "output": "Elite creatures get 1 action during each phase (Early, Middle, Late) for a total of 3 actions per round. This makes them extremely dangerous opponents."}
{"input": "If an elite goes in Early phase, when are its other actions?", "output": "An elite acting in Early phase gets its first action then, second action in Middle phase, and third action in Late phase - spreading across the entire round."}
{"input": "Can I change initiative phases mid-combat?", "output": "No, initiative phases are set after the first round. You can only defer to a later phase on round 1, and this decision is permanent for the entire combat."}
{"input": "What if I tie initiative with an enemy?", "output": "Within the same phase, player characters always go first, then enemies, then neutral NPCs. If exact values matter, use the specific initiative roll as a tiebreaker."}
{"input": "How do I coordinate with other players in the same phase?", "output": "Players in the same phase can choose their turn order among themselves to coordinate tactics. You can even declare actions simultaneously for faster play."}
{"input": "A legendary creature rolled 11 for initiative, what happens?", "output": "With initiative 11, the legendary creature gets Preparation phase (first round), then acts in Early phase. Being legendary tier, it gets 3 total actions spread across all phases."}
{"input": "Do mythic creatures follow initiative rules?", "output": "Yes, mythic creatures that participate in normal combat roll initiative like other significant enemies. They get 3 actions per round spread across phases like other high-tier creatures."}
{"input": "What's the advantage of high initiative?", "output": "High initiative lets you act first (tactical advantage), potentially get Preparation phase, and control the flow of combat by striking before enemies can react."}