{"input": "How do I roll for a skill check in Anyventure?", "output": "In Anyventure, skill checks use two components: Talent determines how many dice you roll, and Skill level determines what type of dice. Roll all dice and take the highest result."}
{"input": "What dice do I roll if I have 3 talent in Knowledge and 2 skill in Academics?", "output": "With 3 talent in Knowledge and 2 skill in Academics, you roll 3d8. The 3 comes from your talent (how many dice) and the d8 comes from skill level 2 (what type of dice)."}
{"input": "What are the skill dice progressions in Anyventure?", "output": "Skill levels use these dice: 0=d4, 1=d6, 2=d8, 3=d10, 4=d12, 5=d16, 6=d20. Level 6 is mastery and there are no skills above 6."}
{"input": "How do bonus dice work?", "output": "Bonus dice add extra dice to your pool. For example, if you normally roll 2d10 and get +1 bonus die, you roll 3d10 and still take the highest."}
{"input": "How do penalty dice work?", "output": "Penalty dice reduce your dice pool. If you can't reduce further (at 1 die), additional penalties make you roll more dice but take the lowest instead of highest."}
{"input": "If I have 1 talent, 3 skill, and -2 penalty dice, what do I roll?", "output": "With 1 talent and 3 skill, you'd normally roll 1d10. With -2 penalty dice, you can't reduce below 1 die, so you roll 2d10 and take the lowest result."}
{"input": "What happens when bonus and penalty dice are both applied?", "output": "Bonus and penalty dice cancel each other out. If you have +2 bonus dice and -1 penalty die, the result is +1 bonus die to your roll."}
{"input": "Can I make a Physique check directly?", "output": "No, you never roll attribute checks directly. Attributes only determine talents. You must roll a specific skill under that attribute like Fitness, Deflection, Might, or Endurance."}
{"input": "What skills fall under the Finesse attribute?", "output": "The Finesse attribute governs four skills: Evasion (dodging attacks), Stealth (moving quietly), Coordination (balance and acrobatics), and Thievery (lockpicking and sleight of hand)."}
{"input": "How do I help someone with the same skill?", "output": "To help with the same skill, you must have equal or higher skill level than the person you're helping. If you qualify, they automatically get a bonus die on their check."}
{"input": "How do I help someone with a different skill?", "output": "When helping with a different skill, roll a single die if the GM deems it relevant (or roll 2 dice take lowest if not clearly relevant). If you meet the Required Check, the person you're helping gets a bonus die."}
{"input": "What's the difference between talents and skills?", "output": "Talents determine HOW MANY dice you roll (quantity) and range from 0-4. Skills determine WHAT TYPE of dice you roll (quality) and range from 0-6, with each level using a progressively larger die."}
{"input": "How many dice do I roll for a skill check with 0 talent?", "output": "With 0 talent in a skill, you cannot make that roll at all. Having 0 talent means you lack the innate ability to attempt that type of check."}
{"input": "What does it mean to have mastery in a skill?", "output": "Mastery is skill level 6, the highest possible. At mastery, you roll d20s for that skill. Combined with high talent, this gives the best possible dice pools."}
{"input": "How do upgraded and downgraded skills work?", "output": "Upgraded skills use better dice (d4→d6, d6→d8, etc.) while downgraded skills use worse dice. This is commonly caused by size differences - a large creature's Might is upgraded, a small creature's is downgraded."}
{"input": "What's a typical Required Check for a moderate difficulty task?", "output": "Moderate difficulty tasks typically have a Required Check (RC) of 6-8. This represents tasks that need focus and skill to accomplish, like balancing on a tightrope."}
{"input": "How do contested checks work?", "output": "In contested checks, both characters roll their relevant skills. The higher result wins, lower result fails. Ties result in 'no change' - neither character gains advantage."}
{"input": "Can multiple people help on the same check?", "output": "No, only one character can assist per check. Choose wisely whether to have someone help with the same skill (automatic bonus die if qualified) or a different skill (requires meeting the RC)."}
{"input": "What happens at skill level 0?", "output": "Skill level 0 means untrained - you roll d4s. You can still attempt the check if you have talent in that area, but your dice will be the smallest possible type."}
{"input": "If I have 4 talent and 0 skill, what's my maximum possible roll?", "output": "With 4 talent and 0 skill, you roll 4d4. Your maximum possible roll is 4, but you're very likely to get that 4 since you're rolling four dice and taking the highest."}
{"input": "Explain how to make a skill check", "output": "To make a skill check: 1) GM sets a Required Check, 2) Roll dice equal to your talent in the appropriate die type for your skill level, 3) Take the highest die result, 4) Compare to Required Check."}
{"input": "I have 2 talent in Social and 4 skill in Persuasion, what do I roll?", "output": "With 2 talent in Social and 4 skill in Persuasion, you roll 2d12. Two dice because of your talent, d12s because skill level 4 uses d12."}
{"input": "My Mind attribute is 3 and I have Logic at skill level 1, what's my dice pool?", "output": "With Mind attribute 3 (talent) and Logic skill 1, you roll 3d6. The 3 dice come from your Mind talent, the d6 from skill level 1."}
{"input": "What do I roll for Stealth with 2 Finesse and skill level 3?", "output": "With 2 Finesse talent and Stealth skill 3, you roll 2d10. Finesse gives you 2 dice to roll, skill level 3 means those dice are d10s."}
{"input": "How does 4 talent and 2 skill translate to dice?", "output": "4 talent and 2 skill means you roll 4d8. The talent (4) tells you to roll four dice, the skill (2) tells you those dice are d8s."}
{"input": "I'm rolling Might with 1 Physique talent and 5 skill, what's my pool?", "output": "With 1 Physique talent and Might skill 5, you roll 1d16. Just one die due to low talent, but it's a d16 because you're highly skilled."}
{"input": "What dice for 3 talent, 0 skill?", "output": "With 3 talent and 0 skill, you roll 3d4. Three dice from talent, but only d4s because you're untrained (skill 0)."}
{"input": "Calculate my dice pool: Knowledge 2, Medicine 3", "output": "Knowledge 2 (talent) and Medicine 3 (skill) gives you 2d10. Roll two d10s and take the highest."}
{"input": "I have Finesse 4 and Coordination 6, what do I roll?", "output": "With Finesse 4 and Coordination 6 (mastery), you roll 4d20. Four dice from exceptional talent, d20s from mastered skill."}
{"input": "What's my Academics check with 3 Knowledge and skill 2?", "output": "With Knowledge 3 and Academics skill 2, you roll 3d8. Three d8s, taking the highest result."}
{"input": "How many d6s do I roll with 2 talent and skill level 1?", "output": "With 2 talent and skill level 1, you roll 2d6. The talent gives you two dice, skill level 1 makes them d6s."}
{"input": "My Physique is 1 and Endurance is 4, what's my dice pool?", "output": "With Physique 1 and Endurance 4, you roll 1d12. Only one die due to low Physique talent, but it's a d12 from good skill."}
{"input": "I have 3 talent, 3 skill, and 2 bonus dice - what do I roll?", "output": "With 3 talent, 3 skill, and +2 bonus dice, you roll 5d10. Your base 3d10 plus 2 extra d10s from bonuses."}
{"input": "What happens with 2 talent, 1 skill, and 3 penalty dice?", "output": "With 2 talent and 1 skill, you start at 2d6. With -3 penalty, you're reduced to 1d6, then must roll 2d6 taking the lowest."}
{"input": "I get +1 bonus die on my 4d12 roll, what's my new pool?", "output": "With +1 bonus die added to 4d12, you now roll 5d12, still taking the highest result."}
{"input": "My 3d8 check has -2 penalty dice, what do I actually roll?", "output": "Starting with 3d8 and -2 penalty reduces you to 1d8. You roll a single d8."}
{"input": "How do I roll 1d10 with -3 penalty dice?", "output": "With 1d10 and -3 penalty, you can't go below 1 die. You roll 3d10 and take the lowest result."}
{"input": "I have 2d16 and get both +2 bonus and -1 penalty, what's my roll?", "output": "With 2d16, +2 bonus, and -1 penalty, they cancel to +1 net bonus. You roll 3d16."}
{"input": "What skills use the Mind attribute for their talent?", "output": "Mind attribute provides talent for four skills: Resilience (mental fortitude), Concentration (maintaining focus), Senses (perception), and Logic (problem-solving)."}
{"input": "List all skills under Physique", "output": "Physique attribute covers: Fitness (running/jumping/climbing), Deflection (blocking attacks), Might (feats of strength), and Endurance (resisting fatigue)."}
{"input": "What skills can I use my Knowledge talent for?", "output": "Knowledge talent applies to: Wildcraft (survival/nature), Academics (history/research), Magic (magical theory), and Medicine (healing/anatomy)."}
{"input": "Which attribute governs Persuasion?", "output": "Persuasion is a Social skill. Your Social attribute determines how many dice you roll for Persuasion checks."}
{"input": "What attribute do I use for Evasion checks?", "output": "Evasion is a Finesse skill. Your Finesse attribute determines your talent (number of dice) for Evasion rolls."}
{"input": "Is Concentration under Mind or Knowledge?", "output": "Concentration is a Mind skill. It represents maintaining focus and resisting distractions, using your Mind attribute for talent."}
{"input": "Someone with d12 Thievery wants help from my d10 Thievery, can I help?", "output": "No, you cannot help with the same skill unless your skill level is equal or higher. Your d10 is lower than their d12, so you can't assist with Thievery."}
{"input": "I want to help a Medicine check with my Logic skill, how does that work?", "output": "Roll a single Logic die (or 2 take lowest if GM rules it's not clearly relevant). If your result meets the Required Check, the person making the Medicine check gets a bonus die."}
{"input": "Can someone with d8 Academics help me with my d8 Academics check?", "output": "Yes, someone with equal skill (both d8 Academics) can help you. You automatically get a bonus die to your Academics check."}
{"input": "Two people want to help my Fitness check, what happens?", "output": "Only one person can help per check. Choose which helper you want - either someone with equal/higher Fitness for automatic bonus, or someone using a different relevant skill."}
{"input": "I have d4 in a skill, can I help someone with d6 in that skill?", "output": "No, to help with the same skill you need equal or higher skill level. Your d4 is lower than their d6, so you cannot help with that skill."}
{"input": "What die types can you roll in Anyventure?", "output": "The standard dice progression is: d4 (skill 0), d6 (skill 1), d8 (skill 2), d10 (skill 3), d12 (skill 4), d16 (skill 5), d20 (skill 6)."}
{"input": "Is there anything higher than a d20?", "output": "In the base progression, d20 is the highest at skill level 6 (mastery). However, upgraded skills at level 6 can use d30."}
{"input": "What's the average roll for a d16?", "output": "A d16 has an average roll of 8.5. This is the die type for skill level 5 (expert)."}
{"input": "Can I roll a d2?", "output": "A d2 only appears with downgraded skill level 0. It's not part of the normal progression but can occur with size penalties or other downgrades."}
{"input": "What skill level gives me d10s?", "output": "Skill level 3 (journeyman) uses d10s. This represents competent professional ability in that skill."}
{"input": "When do I start rolling d12s?", "output": "You roll d12s at skill level 4 (proficient). This is also when critical hits become possible (rolling a 12)."}
{"input": "What's a Required Check?", "output": "A Required Check (RC) is the target number set by the GM that your highest die must meet or exceed for success. It represents the difficulty of the task."}
{"input": "Do I need to roll exactly the Required Check or higher?", "output": "You need to meet or exceed the Required Check. Rolling exactly the RC is a success, as is rolling higher."}
{"input": "What's a DC 10 check in Anyventure terms?", "output": "A DC 10 check means Required Check 10 - a hard difficulty task. Your highest die result must be 10 or higher to succeed."}
{"input": "The GM says RC 4, is that easy or hard?", "output": "RC 4 is easy difficulty. It's achievable even with modest dice pools and represents tasks that require some effort but aren't particularly challenging."}
{"input": "What Required Check is considered extreme difficulty?", "output": "Extreme difficulty is RC 13-16. These are tasks that require exceptional rolls even with good dice pools, like interpreting dead languages or incredible feats."}
{"input": "Can I roll above 20?", "output": "With a standard d20 (mastery), 20 is the maximum. However, upgraded mastery skills use d30, allowing rolls up to 30."}
{"input": "What's the minimum I can roll on any check?", "output": "The minimum single die result is 1, regardless of die type. However, with multiple dice taking lowest (from penalties), your effective result is still just 1."}
{"input": "Is rolling a 1 an automatic failure?", "output": "No, there are no automatic failures. A 1 might still succeed if the Required Check is 1 (trivial difficulty)."}
{"input": "What's the highest possible roll with 4d20?", "output": "With 4d20, the highest possible roll is 20. You roll four d20s but only take the single highest result."}
{"input": "Can I roll a 15 with d12s?", "output": "No, d12s only go up to 12. To roll 15+, you need at least d16s (skill level 5)."}
{"input": "What happens if I roll all 1s?", "output": "If all your dice show 1, your result is 1. There's no special critical failure - you simply get the lowest possible result."}
{"input": "I rolled 3, 7, 5 on my 3d8. What's my result?", "output": "Your result is 7. When rolling multiple dice for a skill check, you always take the highest individual die."}
{"input": "My dice show 12, 8, 11, 6. What do I use?", "output": "You use 12, the highest die shown. The other results don't matter for a standard skill check."}
{"input": "I'm taking the lowest due to penalties and rolled 4, 9, 2. My result?", "output": "When taking the lowest due to penalty dice, your result is 2. Penalty dice beyond your base make you take the worst result."}
{"input": "Rolled 6, 6, 6 on my check. What's my result?", "output": "Your result is 6. Even with three sixes, you only use one die's value - the highest (which is 6 in this case)."}
{"input": "Do tied dice matter? I rolled two 8s and a 5.", "output": "Your result is 8. Tied highest dice don't provide any special benefit - you simply use 8 as your check result."}
{"input": "How do you resolve a tie in a contested check?", "output": "In contested checks, ties mean 'no change' occurs. Neither character gains advantage and the situation remains as it was."}
{"input": "We both rolled 11 on our contested Coordination check, who wins?", "output": "Neither wins - it's a tie. By the 'no change' rule, whatever you were competing for remains unresolved or unclaimed."}
{"input": "I rolled 14 on Persuasion, they rolled 12 on Insight. What happens?", "output": "You succeed in deceiving them. Your 14 beats their 12, so your lie or bluff is believed."}
{"input": "Both of us got 7 on our Might contest. Who wins the arm wrestle?", "output": "Neither wins yet. The tie means no progress is made. You'd typically continue rolling until someone wins."}
{"input": "Can I win a contested check by 1 point?", "output": "Yes, any amount of winning counts the same. Whether you beat them by 1 or 10, you succeed and they fail."}
{"input": "I have 0 talent in Knowledge. Can I make an Academics check?", "output": "No, with 0 talent you cannot attempt any Knowledge-based skills including Academics. You lack the innate ability to make these checks."}
{"input": "What if I have talent but 0 skill?", "output": "With talent but 0 skill, you can attempt the check rolling d4s. You're untrained but have natural ability, so you roll your talent in d4s."}
{"input": "Can I default to rolling if I don't have a skill?", "output": "Only if you have talent in that attribute. No talent means no roll. Having talent with 0 skill means rolling d4s."}
{"input": "I have Social 0, can someone help me make a Persuasion check?", "output": "No, with 0 talent in Social you cannot make Social-based checks at all, even with help. You fundamentally lack social aptitude."}
{"input": "What's the maximum dice pool I can have?", "output": "The theoretical maximum is 4 talent plus multiple bonus dice. With 4 talent and several bonuses, you could roll 6, 7, or more dice."}
{"input": "How do I calculate penalty dice when I have bonus dice too?", "output": "Add all bonus dice and subtract all penalty dice for the net modifier. +3 bonus and -2 penalty equals +1 net bonus."}
{"input": "I have Presence d8 and want to intimidate someone. What do I roll against?", "output": "For intimidation using Presence, you roll against their Resilience check. It's a contested check - your Presence vs their mental fortitude."}
{"input": "Someone is lying to me. What check do I make?", "output": "You make an Insight check contested against their Persuasion. If your Insight beats their Persuasion, you detect the lie."}
{"input": "We're both grabbing for the same item. What skills do we use?", "output": "Both roll Coordination in a contested check. Highest roll gets the item. A tie means neither grabs it successfully."}
{"input": "Large creature vs small creature in Might, what changes?", "output": "The large creature's Might checks are upgraded (d8→d10 at skill 2) while the small creature's are downgraded (d8→d6 at skill 2)."}
{"input": "I'm small sized. How does this affect my skill checks?", "output": "Size affects certain physical skills. Small creatures typically have downgraded Might checks but might have upgraded Stealth or Evasion."}
{"input": "Does being large affect all my skills?", "output": "No, size only affects specific physical skills. A large creature has upgraded Might but normal dice for skills like Academics or Persuasion."}
{"input": "How do I know what skills are affected by size?", "output": "Physical skills like Might are commonly affected. The GM determines which skills are impacted based on the narrative logic of size advantages/disadvantages."}
{"input": "Can I ever roll more than 4 dice from talent alone?", "output": "No, 4 is the maximum talent (attribute) during character creation. You can only exceed 4 dice total by adding bonus dice from help, conditions, or abilities."}
{"input": "Is there a limit to bonus dice?", "output": "There's no strict limit to bonus dice, but they must come from specific sources like help, magic, conditions, or items. The GM controls what bonuses stack."}
{"input": "What's the easiest Required Check?", "output": "RC 1 is trivial difficulty - tasks like tying your shoes. Most characters succeed automatically unless severely penalized."}
{"input": "What Required Check is impossible without magic or help?", "output": "RC 21+ is impossible without magical enhancement or assistance, since the highest normal roll is 20 (with mastery d20 skill)."}
{"input": "Do different skills under the same attribute roll the same?", "output": "They use the same number of dice (talent) but can have different skill levels. Someone might roll 3d10 for Logic but 3d6 for Resilience despite both using Mind."}
{"input": "I have Mind 2. Do all my Mind skills start at the same level?", "output": "No, Mind 2 means you roll 2 dice for all Mind skills, but each skill has its own level determining die type. You might have Senses d8 and Logic d4."}
{"input": "What's the difference between skill dice and talent dice?", "output": "Talent determines quantity (how many dice), skill determines quality (what type). 3 talent with 2 skill = 3d8. More talent = more chances to roll high, higher skill = higher potential."}
{"input": "I roll 2d12 and get 7, 11. What happens next?", "output": "Your check result is 11 (the higher die). Compare this to the Required Check the GM set. If 11 meets or beats the RC, you succeed."}
{"input": "Can untrained characters attempt all checks?", "output": "Only if they have talent in the relevant attribute. 0 talent = impossible. Having talent but 0 skill = roll d4s for that check."}
{"input": "What makes a skill check harder or easier?", "output": "The GM adjusts the Required Check. RC 2-3 is easy, RC 6-8 is moderate, RC 13+ is extreme. Bonus/penalty dice also help or hinder your chances."}
{"input": "Does rolling multiple high dice give me extra benefits?", "output": "No, skill checks only use your single highest die. Multiple successes matter for weapon attacks but not standard skill checks."}
{"input": "Can I take 10 or take 20 like in other RPGs?", "output": "No, Anyventure doesn't have take 10 or take 20 mechanics. Every check requires rolling dice - no automatic results."}