{"input": "How do I cast a spell in Anyventure?", "output": "To channel a spell, roll your magic skill check (talent × skill dice). If your highest die meets or exceeds the spell's Required Check, the spell succeeds. Success is pass/fail, not degrees."}
{"input": "What are the five types of magic?", "output": "The five magic types are: Black (Necromancy/Witchcraft), Primal (Elemental/Nature), Metamagic (Transmutation/Illusion), Divine (Abjuration/Radiant), and Mysticism (Spirit/Divination)."}
{"input": "What is an exotic magic school?", "output": "Each magic type has an exotic school: Black→Fiend, Primal→Draconic, Metamagic→Fey, Divine→Celestial, Mysticism→Cosmic. These require special modules or traits to learn from."}
{"input": "Do I need components to cast spells?", "output": "Yes, all spells have components that are consumed when channeling (success or failure). You can cast without components using Manaburn, but this damages you."}
{"input": "What is Manaburn?", "output": "Manaburn lets you channel without components by taking true damage equal to the spell's Required Check. If you fail, the damage doubles. Reaching 0 health from Manaburn disables magic until your next full rest."}
{"input": "How does charging a spell work?", "output": "Declare charging before channeling. It increases Required Check by +2 but adds the spell's charge effect. You must use components (or a focus) when charging - no Manaburn allowed."}
{"input": "Can I cast spells silently?", "output": "You can channel spells without speaking, but you take a penalty die to your spell check. This makes silent casting more difficult but still possible."}
{"input": "How do spell rituals work?", "output": "Rituals take 1 hour, require components, and automatically charge the spell on success without the +2 Required Check increase. Others can assist to improve success chances."}
{"input": "How can others help with rituals?", "output": "Helpers can roll the spell's magic school (add +1 if they get half the Required Check) or roll Magic knowledge skill (add +1 if they meet full Required Check). Failures add -1."}
{"input": "How many spells can I know?", "output": "Default spell capacity is 10 spells. This can be increased through modules. If at capacity, you must forget an old spell to learn a new one."}
{"input": "How do I learn new spells?", "output": "To learn a spell, perform its ritual with Required Check +2 higher than normal. You need valid targets/conditions and components. The spell isn't charged when learned."}
{"input": "What are spell focuses?", "output": "Focuses are items that replace the need for specific components. For example, a silver idol replaces silver shards. Focuses can break when you fail to channel while using them."}
{"input": "Can I learn exotic school spells?", "output": "No, you cannot learn exotic school spells unless you have a specific module or trait that grants access to that exotic school. Normal characters are limited to the two subschools."}
{"input": "What's the energy cost for spells?", "output": "Channeling spells costs energy, which varies by spell. You must spend the energy to attempt casting, whether you succeed or fail at the channel check."}
{"input": "Do spell checks affect spell power?", "output": "No, spell effectiveness is fixed. Your channel check only determines success/failure. A spell that deals 5 damage always deals 5 damage, regardless of how well you roll."}
{"input": "Can I cast a damaging spell as a ritual?", "output": "Yes, but it's impractical in combat since rituals take 1 hour. Rituals are best for utility spells, learning new spells, or powerful effects outside of combat."}
{"input": "What spells should I start with as a new caster?", "output": "GMs typically allow new casters to start with 5 spells that have Required Checks at least 2 lower than their maximum possible roll in that magic school."}
{"input": "Can I contribute to a ritual if I don't know that type of magic?", "output": "Yes, you can help using Magic knowledge skill instead of the specific magic school. You need to meet the full Required Check to add +1, but you can still contribute."}
{"input": "What happens to components when channeling?", "output": "Components are always consumed when you attempt to channel, whether you succeed or fail. This makes repeated attempts costly and encourages preparation."}
{"input": "If I have 3 talent and 3 skill in Primal magic, what's the highest Required Check spell I can learn alone?", "output": "With 3 talent and 3 skill, you roll 3d10 for a maximum of 10. Since learning requires Required Check +2, you can learn spells with Required Check 8 or lower without assistance."}