{"input": "What are the creature tiers in Anyventure?", "output": "Creature tiers from weakest to strongest: Non-Combatant, Minion, Grunt, Standard, Champion, Elite, Legend, Mythic. Each tier represents increasing power and threat level."}
{"input": "How many actions does a minion get per turn?", "output": "Minions get 1 action and movement per turn. They're weak creatures meant to be dispatched easily, so they have limited action economy."}
{"input": "How many actions does a grunt get?", "output": "Grunts get 1 action and movement per turn, same as minions. While stronger than minions, they still have the basic action economy of lesser creatures."}
{"input": "What about standard tier creatures?", "output": "Standard tier creatures get 2 actions and movement per turn, same as player characters. They represent an even match for beginning adventurers."}
{"input": "How many actions do champion tier creatures get?", "output": "Champion tier creatures get 2 actions and movement per turn. They represent the peak of what humanoids can achieve but still follow PC action economy."}
{"input": "What's special about elite creature actions?", "output": "Elite creatures get 1 action during each phase of combat (Early, Middle, Late) for a total of 3 actions per round. This makes them extremely dangerous opponents requiring teamwork."}
{"input": "How many actions do legendary creatures get?", "output": "Legendary creatures get 1 action during each phase of combat for 3 total actions per round, same as elites. Their power comes from raw stats rather than more actions."}
{"input": "What about mythic tier creatures?", "output": "Mythic creatures get 1 action during each phase of combat for 3 total actions per round. They're meant to be defeated by special means rather than direct combat."}
{"input": "Do minions and grunts roll initiative?", "output": "No, minions and grunts do not roll initiative. They always act in the Late phase of combat, making them predictable and easier to plan around."}
{"input": "What creatures roll initiative?", "output": "Standard tier and above creatures roll initiative to determine their phase. Only minions and grunts automatically go in the Late phase without rolling."}
{"input": "What's an example of a minion tier creature?", "output": "Minion tier creatures include wolves, runty kobolds, dryads, rats, or weak skeletons. They're easily dispatched and pose little individual threat."}
{"input": "Give me examples of grunt tier creatures", "output": "Grunt tier creatures include bandits, squires, regular skeletons, harpies, and basic guards. Dangerous in numbers but an adventurer should handle several."}
{"input": "What are some standard tier creatures?", "output": "Standard tier creatures include lions, knights, velociraptors, and trained soldiers. They match a starting adventurer's capabilities in favorable conditions."}
{"input": "What creatures are champion tier?", "output": "Champion tier includes archmages, renowned gladiators, treants, and veteran warriors. They represent the peak of humanoid achievement and training."}
{"input": "Give examples of elite tier creatures", "output": "Elite tier creatures include wyverns, liches, devils, young dragons, and powerful demons. They require a full party of adventurers to defeat safely."}
{"input": "What are some legendary creatures?", "output": "Legendary creatures include ancient dragons, krakens, balors, and legendary heroes. Defeating them makes you the stuff of history books and epic tales."}
{"input": "What counts as mythic tier?", "output": "Mythic tier includes demi-gods, avatars, primal forces, and cosmic entities. They're not meant to be defeated by normal combat but through special rituals or artifacts."}
{"input": "What's the elite star system?", "output": "Elite creatures have a star rating from 1-5 stars, with 1-star being the weakest elites and 5-star being the strongest. This helps scale encounters within the broad elite tier."}
{"input": "What creature types exist in Anyventure?", "output": "The creature types are: Humanoid, Beast, Monster, Plantoid, Elemental, Dark, Divine, Undead, Construct, and Fey. Each type has different vulnerabilities and interactions."}
{"input": "What defines a humanoid creature?", "output": "Humanoids are bipedal, language-speaking creatures with culture. This includes all playable ancestries and many intelligent enemies like humans, elves, orcs, and goblins."}
{"input": "What are beast type creatures?", "output": "Beasts are unintelligent animals focused on survival. This includes tigers, mammoths, wolves, and even mythical creatures like griffons if they're animal-like."}
{"input": "What's the difference between beast and monster types?", "output": "Beasts are natural animals while monsters have different origins - magical mutations, extraplanar creatures, or aberrant beings. Dragons, hydras, and giants are monsters."}
{"input": "What are dark type creatures?", "output": "Dark creatures are associated with evil and typically come from malevolent planes or forces. This includes demons, devils, and void spawn."}
{"input": "What defines divine type creatures?", "output": "Divine creatures are celestials from heavenly realms. This includes valkyries, angels, pegasi, and the mythical phoenix - beings of light and good."}
{"input": "What are undead creatures?", "output": "Undead are creatures that have been raised from death, usually through magic or curses. This includes liches, zombies, ghouls, skeletons, and vampires."}
{"input": "What counts as a construct?", "output": "Constructs are built or animated creatures that serve as servants or guardians. This ranges from clockwork minions to massive stone golems and magical automatons."}
{"input": "What are fey creatures?", "output": "Fey creatures come from the feywild and are often curious, chaotic, or mischievous. This includes sprites, satyrs, pumpklings, and other fairy-tale beings."}
{"input": "What are plantoid creatures?", "output": "Plantoids are sentient plants of various forms. This includes treants, dryads, venus mantraps, and other plant-based life forms with consciousness."}
{"input": "What are elemental creatures?", "output": "Elementals are primal creatures that embody the classical elements. They can be made of fire, water, earth, air, ice, lightning, or other elemental forces."}
{"input": "Can a goblin be different tiers?", "output": "Yes! A runty kobold might be minion tier, a regular goblin could be grunt tier, a goblin warrior might be standard tier, and a goblin chieftain could be champion tier."}
{"input": "How do I determine what tier a custom creature should be?", "output": "Consider the creature's role: cannon fodder (minion/grunt), equal opponent (standard), skilled adversary (champion), boss fight (elite), legendary foe (legend), or god-like entity (mythic)."}
{"input": "What happens when you defeat an elite creature?", "output": "Defeating an elite tier creature awards Wonder, representing the triumph you can draw upon later. It's a significant achievement worthy of mechanical recognition."}
{"input": "Do creature types affect spells and abilities?", "output": "Yes, certain spells and abilities only work on specific creature types. For example, some spells only affect humanoids, while others might specifically target undead or constructs."}
{"input": "Can creatures have multiple types?", "output": "Typically creatures have one primary type, but some might have hybrid natures. For example, a vampire might be both humanoid and undead, depending on the specific lore."}
{"input": "What's a non-combatant creature?", "output": "Non-combatants are creatures not expected to meaningfully contribute to combat. This includes small animals like rabbits, cats, or snakes - usually valued for skills rather than fighting."}
{"input": "How do I scale creatures within a tier?", "output": "Within tiers, adjust health, damage, special abilities, and dice pools. A weak grunt might have 2d6 attacks while a strong grunt has 3d8 attacks, but both stay grunt tier."}
{"input": "What makes a creature elite tier vs champion tier?", "output": "Champions represent peak humanoid achievement (solo skilled opponents), while elites require teamwork to defeat and get 3 actions per round. Elites are beyond normal humanoid limits."}
{"input": "Can player characters become different tiers?", "output": "Player characters are typically considered standard tier at start, potentially growing to champion tier with experience. They don't follow monster tier action rules though."}
{"input": "What's the difference between legend and mythic tiers?", "output": "Legends are epic creatures that make history when defeated through exceptional combat prowess. Mythics transcend normal combat and require special rituals or artifacts to defeat."}
{"input": "How many minions equal one standard creature?", "output": "There's no exact formula, but roughly 3-4 minions might challenge a standard creature, depending on tactics, terrain, and specific stats. Use tier as a guideline, not strict math."}
{"input": "Do all dragons have to be the same tier?", "output": "No! A dragon wyrmling might be standard tier, a young dragon could be elite, an adult dragon might be legend tier, and an ancient dragon could be mythic."}
{"input": "What tier should a lich be?", "output": "Liches are typically elite tier creatures due to their magical power, undead nature, and threat level requiring a party to defeat. However, an archlich might be legendary."}
{"input": "How do I handle swarms of creatures?", "output": "Swarms can be treated as single creatures of higher tiers. A swarm of rats (individually non-combatant) might function as a grunt or standard tier creature mechanically."}
{"input": "What tier are most town guards?", "output": "Most basic town guards are grunt tier - trained enough to handle common threats but not exceptional. Elite guards or captains might be standard or champion tier."}
{"input": "Can constructs be any tier?", "output": "Yes, constructs can range from minion tier (clockwork mice) to mythic tier (ancient divine guardians). Their tier depends on their creator's skill and intended purpose."}
{"input": "What tier should a vampire be?", "output": "Most vampires are elite tier due to their supernatural abilities, regeneration, and threat level. An ancient vampire lord might be legendary tier."}
{"input": "How do creature tiers affect treasure?", "output": "Higher tier creatures typically guard better treasure or have more valuable parts. Elite+ creatures might have magical items or components worth significant gold."}
{"input": "What's the weakest creature that can threaten a party?", "output": "Elite tier creatures are specifically designed to threaten parties, though large numbers of lower-tier creatures or environmental advantages can make anything dangerous."}
{"input": "Do summoned creatures follow tier rules?", "output": "Yes, summoned creatures follow the same tier rules for actions and abilities. A summoned grunt elemental gets 1 action, while a summoned elite demon gets 3 actions across phases."}
{"input": "What tier should most bandits be?", "output": "Regular bandits are typically grunt tier, bandit leaders might be standard tier, and a notorious bandit king could be champion tier. Adjust based on their role and threat."}
{"input": "Can the same creature type appear in multiple tiers?", "output": "Absolutely! Skeletons can range from grunt tier (basic undead) to elite tier (skeletal champions) to legendary tier (ancient bone lords), depending on their power and abilities."}