{"input": "What resources do characters have?", "output": "Characters have four main resources: Health (physical durability, default 20), Resolve (mental health, default 20), Energy (action economy, default 5), and Morale (buffer for health/resolve, default 0 max 20)."}
{"input": "How do I recover health?", "output": "Full rest in favorable conditions (inn, shelter) recovers 4 health. Unfavorable conditions (tent, ground) recovers 2 health. Also: potions, medical treatment, magic, or special abilities."}
{"input": "What is Resolve used for?", "output": "Resolve represents mental health. It's damaged by psychic attacks and fear. At 0 health, you can spend 2 resolve to keep fighting. Reaching 0 resolve causes the Broken condition."}
{"input": "How does energy regeneration work?", "output": "Characters have 5 maximum energy by default and regenerate 3 energy per combat round. This limits how many actions and reactions you can take each turn."}
{"input": "What is morale?", "output": "Morale is a buffer that absorbs damage before it hits health or resolve. Characters start with 0 morale but can gain up to 20 through abilities, items, or effects."}
{"input": "What happens with the Broken condition?", "output": "Broken occurs at 0 resolve. You cannot regain resolve, take -1 die penalty to all Mind checks, and need a DC 10 check during favorable rest to recover."}
{"input": "What does the Winded condition do?", "output": "Winded prevents energy regeneration. It's removed by taking the Rest action, which also grants +2 energy. You risk becoming Winded when going negative energy."}
{"input": "How does the Prone condition affect combat?", "output": "While Prone: movement is halved, melee attackers gain +1 die against you, ranged attackers have disadvantage. Useful defensively against ranged attacks."}
{"input": "What conditions prevent me from acting?", "output": "Stunned prevents actions and reactions until you pass a DC 10 check. Incapacitated prevents all actions, reactions, and movement while auto-failing physical defenses."}
{"input": "What's the difference between Impaired and Incapacitated?", "output": "Impaired prevents movement and reactions with -1 die to attacks/defenses. Incapacitated is worse - no actions, reactions, or movement plus auto-fail physical defenses."}
{"input": "How does Bleeding work?", "output": "Bleeding causes 1 damage at the end of your turn. It continues until stopped by a successful Medicine check or magical healing."}
{"input": "What does Obscured do?", "output": "Obscured makes you undetected - you can't be directly targeted unless detected. Attackers have disadvantage, but your attacks gain +1 die if still undetected."}
{"input": "How long does Dazed last?", "output": "Dazed prevents using Concentration and reactions. It ends automatically at the end of your next turn, making it a short but impactful condition."}
{"input": "What is Wonder and Woe?", "output": "Wonder and Woe are meta-currencies. You can hold 1 of each. Wonder gives benefits and 1 resolve per rest. Woe gives powerful desperate abilities but costs 1 resolve per rest."}
{"input": "When do I gain Wonder?", "output": "Wonder is awarded for: defeating Elite tier creatures, completing important goals, making epic discoveries, or performing heroic deeds. It represents triumph you can draw upon."}
{"input": "When do I gain Woe?", "output": "Woe comes from: ally death, goal failure, serious betrayal, or recovering from Broken condition. It represents accumulated grief that can fuel desperate actions."}
{"input": "What can I do with Wonder?", "output": "Wonder can: give 10 immediate morale, remove mental conditions, guarantee overcraft when crafting, or learn/upgrade Song of Inspiration. Provides hope-based benefits."}
{"input": "What can I do with Woe?", "output": "Woe can: double a performance check, learn/upgrade Song of Lament, grant Desperate Flurry (extra attack action for 2 resolve), or guarantee a spell with doubled Manaburn damage."}
{"input": "How does the Afraid condition work?", "output": "Afraid prevents reactions. Must roll DC 12 Resilience to use actions - on failure, you flee half the difference in units. DC reduces by 1 per failure. Success ends condition."}
{"input": "What does Energized do?", "output": "Energized grants +1 energy regeneration per round and optionally +1 movement speed. Lasts 2 rounds or until becoming Winded. Helps maintain action economy."}
{"input": "How much health do I start with?", "output": "Player characters start with 20 health by default. This can be increased through modules, traits, equipment, or other character options."}
{"input": "What happens when I reach 0 health?", "output": "At 0 health, you can spend 2 resolve at the start of your turn to stay conscious and act normally. This puts you in 'lifeline' - a dangerous state."}
{"input": "I'm at 0 health and take 6 damage, what happens?", "output": "Taking 5+ damage while in lifeline forces a roll on the lifeline table (1d8). Results range from death checks to cosmetic injuries to falling unconscious."}
{"input": "Can I go below 0 health?", "output": "No, health doesn't go below 0. You're either at positive health, 0 health (lifeline), or unconscious/dead from lifeline table results."}
{"input": "How do I regain consciousness after falling unconscious?", "output": "Regain consciousness by either: gaining at least 10 health within 1 hour, or following the standard unconscious recovery rules from conditions."}
{"input": "What's my default energy per turn?", "output": "You start each combat round with your maximum energy (default 5) plus regeneration (+3). So typically 8 energy to spend on actions and reactions."}
{"input": "Can I go into negative energy?", "output": "Yes, but it's risky. Going negative energy requires an Endurance check DC 10 or you become Winded, which prevents energy regeneration until you Rest."}
{"input": "How much energy do basic actions cost?", "output": "Attack costs 0 energy (always available), Rest costs 0 (removes Winded, +2 energy), Sprint costs 1 energy, most reactions cost 1 energy."}
{"input": "What happens if I'm Winded?", "output": "Winded prevents energy regeneration each round. You're stuck with whatever energy you have until you take the Rest action to remove the condition."}
{"input": "How much resolve do I lose when an ally dies?", "output": "The amount isn't fixed - it depends on circumstances and GM judgment. Ally death typically awards Woe, which costs 1 resolve per rest while held."}
{"input": "Can I spend resolve for things other than staying up at 0 health?", "output": "Yes, some abilities and effects let you spend resolve. Desperate Flurry (from Woe) costs 2 resolve per extra attack. Check your modules for other uses."}
{"input": "What removes the Broken condition?", "output": "During a favorable rest, make a DC 10 Resilience or Concentration check. Success removes Broken and lets you regain resolve normally again."}
{"input": "How long does Stunned last?", "output": "Stunned requires a DC 10 check (Resilience, Concentration, or Endurance) to recover. The DC reduces by 1 after each failed attempt, so you'll eventually recover."}
{"input": "What's the difference between Dazed and Stunned?", "output": "Dazed prevents Concentration use and reactions, ends automatically next turn. Stunned prevents all actions and reactions, requires a check to recover."}
{"input": "Can I act while Incapacitated?", "output": "No, Incapacitated prevents all actions, reactions, and movement. You also automatically fail physical defense checks. It's a complete shutdown condition."}
{"input": "Does Impaired prevent all movement?", "output": "Yes, Impaired prevents movement and reactions. You can still take actions but with -1 die penalty to attacks and defenses. Less severe than Incapacitated."}
{"input": "How do I cure Bleeding?", "output": "Bleeding stops with a successful Medicine check or magical healing. Until cured, you take 1 damage at the end of each turn."}
{"input": "What happens if I'm Blinded?", "output": "Blinded gives -1 die on all attack and defense rolls (Evasion/Deflection). You also cannot make checks that require vision."}
{"input": "Does Weakened affect spell damage?", "output": "Yes, Weakened reduces damage from all attacks and abilities by 1, including spells. It represents overall reduced effectiveness in combat."}
{"input": "How long does Energized last?", "output": "Energized lasts 2 rounds or until you become Winded, whichever comes first. It grants +1 energy regeneration and possibly +1 movement speed."}
{"input": "Can I target someone who is Obscured?", "output": "Not directly. You must first succeed on a detection check (Senses, Magic, etc.) to locate them. Until detected, they can't be targeted by attacks or spells."}
{"input": "What's the maximum morale I can have?", "output": "20 morale is the maximum. Characters start with 0 morale but can gain it through various effects, abilities, or consumables."}
{"input": "Does morale protect against all damage?", "output": "Yes, morale absorbs damage before it affects health or resolve. It's a universal buffer regardless of damage type or source."}
{"input": "Can I spend Wonder and Woe on the same turn?", "output": "Yes, you can use Wonder and Woe abilities even when it's not your turn. Having both lets you access different abilities as needed."}
{"input": "What's Desperate Flurry from Woe?", "output": "Desperate Flurry gives you an extra action each turn for 1 minute, usable only to attack. Each use costs 2 resolve. It's a powerful but costly ability."}
{"input": "Can Wonder remove the Broken condition?", "output": "Wonder's Immediate Morale Boost removes numb or broken conditions while granting 10 morale. It's one of the most powerful immediate recovery options."}
{"input": "What counts as a favorable rest for health recovery?", "output": "Favorable rest includes inns, safe shelters, or comfortable conditions. This grants 4 health recovery vs 2 health for unfavorable rest (tents, rough ground)."}
{"input": "How does the Numbed condition work?", "output": "Numbed prevents gaining or losing resolve through normal means. You also cannot use resolve to stay up at 0 health. It blocks resolve management entirely."}
{"input": "What's the Charmed condition do?", "output": "Charmed means you're under another creature's influence. You cannot target them with hostile actions and may be compelled to obey their commands."}
{"input": "How does Confused affect my actions?", "output": "Each turn while Confused, roll 1d4: (1) attack random target, (2) move randomly, (3) lose your action, (4) act normally. It's unpredictable chaos."}
{"input": "What does Maddened do to me?", "output": "Maddened makes you unable to distinguish friends from enemies. You treat all targets as hostile and will attack allies as readily as foes."}
{"input": "How do I recover from Afraid?", "output": "Roll DC 12 Resilience to use actions. Success ends Afraid. Failure makes you flee half the difference in units and reduces the DC by 1 for next attempt."}
{"input": "Can I use reactions while Afraid?", "output": "No, Afraid specifically prevents using reactions. You're too focused on the source of fear to respond to other threats effectively."}
{"input": "What mental conditions exist in Anyventure?", "output": "Mental conditions include: Broken, Numbed, Dazed, Stunned, Afraid, Maddened, Charmed, and Confused. They affect your ability to think and act rationally."}
{"input": "What physical conditions can I get?", "output": "Physical conditions include: Winded, Prone, Bleeding, Blinded, Incapacitated, Impaired, Weakened, and Energized. They affect your body's capabilities."}
{"input": "Is there a condition for being invisible?", "output": "Invisibility falls under the Obscured condition, which covers being undetected by normal senses through any means - magic, stealth, or environmental concealment."}
{"input": "What's the worst condition I can have?", "output": "Incapacitated is often the worst - no actions, reactions, or movement, plus auto-fail physical defenses. Broken is also severe for resolve-dependent characters."}
{"input": "Do conditions stack with each other?", "output": "Yes, you can have multiple conditions simultaneously. Their effects combine, potentially creating very dangerous situations requiring immediate attention."}
{"input": "Can magic remove conditions?", "output": "Yes, many spells can remove specific conditions. The specific spell determines which conditions it affects - check individual spell descriptions for details."}
{"input": "How much resolve does Wonder give per rest?", "output": "Having Wonder grants 1 resolve at the end of each full rest. This helps maintain mental health over long campaigns with accumulated stress."}
{"input": "Can conditions affect my dice pools?", "output": "Yes, several conditions modify dice: Broken gives -1 die to Mind checks, Blinded gives -1 die to attacks/defenses, Impaired gives -1 die to attacks/defenses."}