
{
  "id": 105,
  "name": "Loyalist",
  "mtype": "personality",
  "ruleset": 1,
  "stressors":["You experience betrayal from an ally","You break a promise","You abandon an ally"],
 "options": [
      {
      "name": "Loyalist",
      "description": "You are a loyalist, steadfast in your dedication to friends, causes, or ideals, even when doing so puts you at personal risk or disadvantage. Your unwavering loyalty makes you both a treasured ally and sometimes a person whose judgment can be clouded by your bonds. You value dedication, trust, and sacrifice above all else.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "AE=1"
    },
   
    {
      "name": "Dedicated Loyalty",
      "description": "Your loyalty to your friends transcends magical effects. You gain +1 skill with concentration. Additionally, when you attack an ally as a result of being charmed, confused or maddened, you only roll 1 dice despite your talents.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Trusting",
      "description": "Your trusting nature has made you naturally more likeable. Gain +1 skill with presence. Additionally, you once per day, you can substitute a wildcraft check involving an animal with your presence skill.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Downtime Action : Strengthen Bonds",
      "description": "You spend time strengthing the bond between you and an ally. While you are within a moderate range (20 units) from your ally, resolve checks that either individual makes are rolled by both, and the higher value is used. This bond lasts until this downtime action is used again.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Reaction : Shared Burden",
      "description": "In response to you or your bonded ally taking psychic damage, your mental connection shares the pain. The original damage is reduced by half, but both you and your bonded ally take this reduced amount.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "ZX"
    },
    {
      "name": "Action : Coordinated Flank",
      "description": "You coordinate a flank with your ally, both making a melee attack against the same target. You make your attack with a bonus dice and your ally makes theirs with a penalty dice. Your ally must be able to use a reaction, but it does not have a cost.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "XX"
    },
    {
      "name": "WIP",
      "description": "This is currently not implemented",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": ""
    },
    {
      "name": "WIP",
      "description": "This is currently not implemented",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "WIP",
      "description": "This is currently not implemented",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Unbreakable Bonds",
      "description": "Gain +1 talent with social and +1 skill with insight.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "ST5=1:SSS=1"
    }
  ]
}
