
{
  "id": 105,
  "name": "Mediator",
  "mtype": "personality",
  "ruleset": 1,
  "stressors":["You fail a social check severely","You witness injustice","You face public mockery or accusation"],
 "options": [
      {
      "name": "Mediator",
      "description": "You are a mediator, naturally drawn to resolve conflicts through patient negotiation and careful understanding of all perspectives involved. Your balanced approach allows you to find common ground where others see only irreconcilable differences, though you sometimes struggle with the moral ambiguity of compromise. You value harmony, fairness, and mutual understanding above all else.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "AE=1"
    },
   
    {
      "name": "Patient Negotiator",
      "description": "You are calculated and don't let emotions get in the way of solving problems. Gain +1 to your logic skill. Additionally, once per day, you can use your logic skill to replace a persuasion check.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Diplomat",
      "description": "You are skilled in understanding people and their needs. Gain +1 skill with insight. Additionally, gain +2 language points.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Downtime Action : Call Meeting",
      "description": "You meticulously send written invitations for a meeting at a location of your choosing. The location and nature of this meeting is not discoverable by non-magical means. The attendence is based on the quality of your invitations; A persuasion check of an 6-9 is midly successful and invitees may attend or send a represtative, while a 10 or higher is very successful all invitees will attend or send a representative. On a perfect check, the invitees will all attend personally.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Action : Talk Down",
      "description": "When an ally within a short (10 unit) distance is suffering from a mental effect that requires them to make a descending check, you can attempt to talk them down. Until the condition is removed, the check descends by 2 every time they fail instead of 1.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "ZX"
    },
    {
      "name": "Action : Calm",
      "description": "You target a creature that is currently acting aggressively towards you and attempt to calm them by using either persuasion if relying on words or presence if relying on body language. On a check of 12 or higher, a creature who is not normally hostile or is acting in a hostile manner due to being affected by the maddened, confused or charmed conditions will lose that condition and become non-hostile.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "XX"
    },
    {
      "name": "Persuasive Mediator",
      "description": "Your mediation skills enhance your ability to persuade others toward compromise. Gain +1 skill with persuasion. When you diffuse a fight or conflict, you gain 2 resolve.",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "SST=1"
    },
    {
      "name": "Smooth Over",
       "description": "In response to an ally rolling less than a 7 on a persuasion check, you can interject and replace their roll with your own but with a penalty dice added.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Mutual Aid",
      "description": "When you recover from a mental condition besides being broken or numbed, you can choose an ally with a short (10 unit) distance who is suffering from the same condition and end it at the same time.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Skilled Negotiator",
      "description": "Gain +1 talent with social.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "ST5=1"
    }
  ]
}
