{
  "id": 105,
  "name": "Outsider",
  "mtype": "personality",
  "ruleset": 1,
  "options": [
    {
      "name": "Outsider",
      "description": "You are an outsider, never quite fitting in with established social groups and viewing societies from a perspective that others cannot share. Your position on the margins grants you unique insights and adaptability, though it often leaves you searching for acceptance or purpose. You value independence, authenticity, and adaptability above all else.",
      "location": "1",
      "data": "TP"
    },
    {
      "name": "Chameleon",
      "description": "You have skill with masking the fact that you are an outsider and can often hide yourself in plain sight. Gain +1 to your stealth skill. When rolling a stealth check as part of a group, your stealth check becomes equal to the highest roll of the group.",
      "location": "2a",
      "data": "TP:SSF=1"
    },
    {
      "name": "Polyglot",
      "description": "You pick up the local language quickly and make an effort to adapt to local customs. Gain +1 skill with persuasion. Additionally, gain +2 language points.",
      "location": "2b",
      "data": "TP:SST=1"
    },
    {
      "name": "Perceptive Outsider",
      "description": "Your position on the margins grants you unique insights into others' motivations. Gain +1 skill with insight. Whenever you make an insight check against a humanoid, you can determine if they are an outsider as well by rolling a successful check of 8 or higher.",
      "location": "3",
      "data": "TP:SSS=1"
    },
    {
      "name": "Action : Slip Away",
      "description": "You slip away from combat or a social situation if you are at least a short distance (10 units) away from the nearest enemy and are within 2 units of an object or creature that grants you at least half-cover.",
      "location": "4a",
      "data": "XINE=1"
    },
    {
      "name": "Reaction : Adapt",
      "description": "In response to taking damage of the same type you've already taken since the end of your last turn, gain 2d6 mitigation to that type before calculating damage.",
      "location": "4b",
      "data": "ZINE=1"
    },
    {
      "name": "Sovereign Stranger",
      "description": "Gain +1 talent with social.",
      "location": "5",
      "data": "ST5=1"
    },
    {
      "name": "No One's Pawn",
      "description": "When you gain the confused, charmed, or maddened condition, roll a 1d12. On an 8 or higher, the effect is removed at the start of your next turn.",
      "location": "6a",
      "data": "TP"
    },
    {
      "name": "Lone Wolf",
      "description": "You can only rely on yourself. You gain +3 psychic mitigation and +3 maximum resolve, but your maximum morale is lowered by 5.",
      "location": "6b",
      "data": "M8=3:A2=3:A8=-5"
    },
    {
      "name": "Downtime Action : Vanish",
      "description": "You take some time and scrub any existence or record of your existence in an area, the size of which is determined by a persuasion check; A check of an 6-9 is mildly successful and allows you to convince those within a small area like a village or city block, while a 10 or higher is very successful and expands over a large town. On a perfect check, your effort is wide spread and can expand over a larg city.",
      "location": "7",
      "data": "YDNE=0"
    }
  ]
}