{
  "id": 105,
  "name": "Perfectionist",
  "mtype": "personality",
  "ruleset": 1,
"stressors":["You fail a crucial check","You fail to craft an item","You lose a competition"], "options": [
      {
      "name": "Perfectionist",
      "description": "You are a perfectionist, driven by an unrelenting desire to achieve flawless results in everything you attempt, often at great personal cost. Your exacting standards push you to excel where others would settle for adequacy, though your pursuit of perfection can lead to burnout and dissatisfaction. You value excellence, precision, and mastery above all else.",
      "mtype": "core",
      "location": "1",
      "cost": 2,
      "data": "AE=1"
    },
   
    {
      "name": "Perfectionist's Focus",
      "description": "Perfection requires constant focus. You gain +1 skill with concentration. Additionally, once per day, you can reroll one concentration check.",
      "mtype": "core",
      "location": "2a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Creative Vision",
      "description": "Gain +1 skill with expression. Additionally, once per day when you successfully craft something that you did not overcraft, you can roll an expression check in a second attempt at overcrafting.",
      "mtype": "core",
      "location": "2b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Downtime Action : Obscessive Perfection",
      "description": "Spend 1 Resolve over the next day and make either a knowledge or craft skill check, recording the final result. After your next full rest, you may attempt to recapture that moment of inspiration. Roll a d12: on a 1, your check automatically becomes a 1; on a 12, it automatically becomes a 20. Otherwise, reuse your previously recorded check result as a static value.",
      "mtype": "core",
      "location": "3",
      "cost": 2,
      "data": "Y"
    },
    {
      "name": "Daily Craft : Create",
      "description": "You put your soul into the next object you craft, gaining a bonus dice on your check. If the recipe fails, you lose 5 resolve.",
      "mtype": "core",
      "location": "4a",
      "cost": 2,
      "data": "CD"
    },
    {
      "name": "Action : Optimized Attacks",
      "description": "You make a probing attack with a weapon or spell but with a penalty dice. If the attack hits or misses, you can discover one talent, skill, mitigation or invulnerability of the creature.",
      "mtype": "core",
      "location": "4b",
      "cost": 2,
      "data": "XX"
    },
    {
      "name": "Expressive Perfectionist",
      "description": "Your pursuit of perfection enhances your ability to express yourself artistically and creatively. Gain +1 skill with expression. Additionally, if you've seen art, architecture or a crafted item created by an individual, you can ",
      "mtype": "core",
      "location": "5",
      "cost": 2,
      "data": "SSQ=1"
    },
    {
      "name": "Um, Actually",
      "description": "Once per day, when another character makes a skill check for a skill you have equal or higher level in, you can immediately make the same check. If your result is higher, you gain 3 resolve as you correct their technique. The subject of this criticism can have your check replace theirs, but they lose 2 resolve.",
      "mtype": "core",
      "location": "6a",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Meticulous Detail",
      "description": "Gain +1 skill with all crafting skills, but all of your crafting recipes take twice as long, and failing any recipe causes you to lose all of your morale.",
      "mtype": "core",
      "location": "6b",
      "cost": 2,
      "data": ""
    },
    {
      "name": "Strive for Excellence",
      "description": "Gain +1 talent with social.",
      "mtype": "core",
      "location": "7",
      "cost": 3,
      "data": "ST5=1"
    }
  ]
}
