{
  "id": 3,
  "name": "Undead",
  "description": "Your creature type becomes Undead, granting you Immunity to the Diseased, Poisoned, Bleeding and Exhausted Condition. You can not benefit from Consumables such as Potions, Food and Snacks or be affected by magic that restores Health.",
  "options": [
    {
      "name": "Undead",
      "description": "Core undead traits - creature type change, condition immunities, and consumable restrictions.",
      "data": "TA"
    },
    {
      "name": "Curse of Gloombarrow",
      "description": "When you reach 0 Health, you do not enter Lifeline. Instead, you die and reanimate with full health in 1d4 days. When you complete a full rest, you lose any conditions affecting you, gain full health and you regenerate any lost body parts unless your body was completely destroyed.",
      "data": "TA"
    },
    {
      "name": "Reaction [Daily] : Still As Death",
      "description": "In response to taking Damage, you fall down in a heap, indistinguishable from real death. After 1 Minute, you recover half of your maximum Health.",
      "data": "ZD1"
    },
    {
      "name": "Grotesque Form",
      "description": "Your body has become grotesque due to the curse, but more durable. You gain +8 health but suffer a -2 Penalty to your Persuasion.",
      "data": "AH=8:ASC=-2"
    },
    {
      "name": "Ancient Knowledge",
      "description": "Learn 1 Magical Language and 1 Non-Magical Language. Additionally, gain +1 magic and +1 academics.",
      "data": "AS7=1:AS9=1"
    },
    {
      "name": "Deadskin",
      "description": "You gain Immunity to the Wounded Condition and Gain +1 Physical and +2 Dark Mitigation.",
      "data": "AD4=1:AD7=2:I=26"
    },
    {
      "name": "Action : Detatchable Parts",
      "description": "You detatch either a hand or eyeball from your body. When the hand is detatched in this way, it takes on the Undead Hand Statblock which you control. An eye detatched in this way grants you Sight in a 4 unit radius from the location of the eyeball when it is less than 100 Units away. A body part can be reattached by using this Action again.",
      "data": "XX3"
    },
    {
      "name": "Ghoulish Desires",
      "description": "You can spend 1 Minute consuming a Medium or smaller Beast or Humanoid corpse, gaining morale equal to twice it's level that lasts until the end of your next full rest.",
      "data": "TA"
    }
  ]
}