{
  "id": 1,
  "name": "Dragonkind",
  "description": "Dragonkind are humanoids with draconic features, sharing a mix of physical traits from their draconic ancestors. These individuals are often imposing, with scaled skin, claws, and sometimes tails or horns. Dragonkind are the only humanoids to live on the surface of Kragfel - their ancestral blood seemingly keeping them safe from the mindless dragons that patrol the barren moon. Dragonkind live extremely long lives, with their youth spent in small tribes before they are encouraged to travel the other worlds when they reach adulthood.",
  "img": "img/ancestries/dragonkind.webp",
  "portrait": "img/ancestries/portraits/dragonkind.png",
  "homeworld": "Kragfel",
  "lifespan": "average 300 years, mature at 20",
  "height": "",
  "size": "Large",
  "home": "",
  "language": "Draconic",
  "options": [
    {
      "name": "Large",
      "description": "Dragonkind are large creatures. All of your physique skills are upgraded and your finesse skills downgraded. Additionally, you take up a 2x2 unit area.",
      "data": "SSA=X:SSB=X:SSC=X:SSD=X:SSE=Y:SSF=Y:SSG=Y:SSH=Y:TA"
    },
    {
      "name": "Draconic Heritage",
      "description": "Choose your draconic lineage, determining your breath weapon element and natural resistances.",
      "data": "",
      "subchoices": [
        {
          "id": "red",
          "name": "Red Dragon Heritage",
          "description": "Descended from red dragons, your Dragon Breath deals heat damage. Gain +1 physical mitigation and +3 heat mitigation.",
          "data": "TA:M1=2:M2=4"
        },
        {
          "id": "blue",
          "name": "Blue Dragon Heritage",
          "description": "Descended from blue dragons, your Dragon Breath deals lightning damage. Gain +1 physical mitigation and +3 lightning mitigation.",
          "data": "TA:M1=2:M4=4"
        },
        {
          "id": "white",
          "name": "White Dragon Heritage",
          "description": "Descended from white dragons, your Dragon Breath deals cold damage. Gain +1 physical mitigation and +3 cold mitigation.",
          "data": "TA:M1=2:M3=4"
        }
      ],
      "requiresChoice": true,
      "choiceType": "Dragon Heritage Selection"
    },
    {
      "name": "Action : Dragon Breath",
      "description": "You spew damaging breath in a cone using your might as an attack check. The length of the cone is equal in units to the amount of talent dice of your check, dealing damage based on your draconic heritage.",
      "data": "X"
    },
    {
      "name": "Draconic Horde",
      "description": "Your lineage allows you to benefit from accumulating wealth in a static, enclosed area that you designate as your horde. For each 100 gold within your horde, you gain 1 temporary health at the end of a full rest to a maximum of 10. For each 1000 gold within your horde, you regenerate an additional resolve at the end of a favorable full rest.",
      "data": "TYD"
    },
    {
      "name": "Ancient Hunger",
      "description": "Dragonkind, like their ancestors, require a tremendous amount of upkeep. In order to benefit from a full rest, a dragonkind must sleep for 8 hours without interruption and must consume 6 meals. Failing either requirement causes a loss of 1 resolve each day.",
      "data": "TYD"
    }
  ]
}
