{
  "id": 10,
  "name": "Elf",
  "description": "Elves are wild humanoids, distinguishable by their long, pointed ears and skin tones which range from light blue to dark green. They typically live hard, long lives in small settlements in the most dangerous of the Fonteran jungles as a result of their displacement from their wars with the Orcs.",
  "img": "img/ancestries/elf.webp",
  "portrait": "img/ancestries/portraits/elf.png",
  "homeworld": "Fonteras",
  "lifespan": "average 250 years, mature at 18",
  "height": "",
  "size": "Medium",
  "home": "",
  "language": "Elven",
  "options": [
    {
      "name": "Medium",
      "description": "Elves are medium-sized creatures and suffer no penalty or benefits.",
      "data": "TA"
    },
    {
      "name": "Keydaran Blood",
      "description": "The blood of the first Keyadar runs through the Elves, granting +4 mitigation to both dark and divine damage. They are also immune to effects that would prematurely age them, but take double damage from aetheric sources before calculating mitigation.",
      "data": "SSI=1:TA"
    },
    {
      "name": "Daily Action : Silver Eater",
      "description": "You consume up to 5 silver shards, granting you one health for each shard consumed. Each shard also counts as a full meal and removes the penalty you receive from aetheric sources until you complete a full rest.",
      "data": "XDME=1"
    },
    {
      "name": "Cosmic Lineage",
      "description": "Elves are descended from an ancient race of complex breeding castes that have cultivated specific traits for millennia.",
      "data": "",
      "subchoices": [
        {
          "id": "starelf",
          "name": "Star Elf",
          "description": "Your lineage ties you directly to the castes that bred the star-shaman, those who unlocked the mysteries of the cosmos in ancient times. You can research and channel spells from the exotic cosmic subschool.",
          "data": "TA"
        },
        {
          "id": "sunelf",
          "name": "Sun Elf",
          "description": "Your lineage ties you directly to the castes that bred the sun-knife, those who served the vanguard in ancient times. Your coordination is unmatched, upgrading the skill.",
          "data": "TA:SSG=X"
        },
        {
          "id": "moonelf",
          "name": "Moon Elf",
          "description": "Your lineage ties you directly to the castes that bred the moon-sculptors, those who shaped beasts and elves alike to serve them in ancient times. Your biosculpting skill is upgraded.",
          "data": "TA:CS6=X"
        }
      ]
    }
  ]
}
