{
  "id": 19,
  "name": "Gloxy",
  "description": "Gloxy are small, fox-like humanoids gifted with intelligence and magic as they were awakened long ago by the Vethi. They are known for their quick wits and helpful nature. Gloxy are typically named for the conditions during their birth rather than their clan name, with Snowborn accounting for a majority of surnames as most are born during the ceaseless snow on Yyeshi.",
  "img": "img/ancestries/gloxy.webp",
  "portrait": "img/ancestries/portraits/gloxy.png",
  "homeworld": "Yyeshi",
  "lifespan": "average 60 years, mature at 14",
  "height": "",
  "size": "Small",
  "home": "",
  "language": "Vethan",
  "options": [
    {
      "name": "Small",
      "description": "Gloxies are small creatures. All of your finesse skills are upgraded and your physique skills downgraded. You also have a -1 penalty to movement speed.",
      "data": "SSA=Y:SSB=Y:SSC=Y:SSD=Y:SSE=X:SSF=X:SSG=X:SSH=X:A4=-1:TA"
    },
    {
      "name": "Vethi's Gift",
      "description": "The awakening by the Vethi left a lasting magical imprint on all Gloxies, making them retain information quite effectively. Gain +1 skill with academics and they have near-perfect memories, able to recall any information perfectly they encountered within the last month.",
      "data": "AS9=1:TA"
    },
    {
      "name": "Action : Burrow",
      "description": "You burrow into soft ground such as loose rocks, dirt, snow or sand and move up to 3 Units. While Burrowed in this way, you have a Burrow Speed equal to your Movement Speed and do not leave any noticeable marks on your entry point. This Action can be used again to Unburrow.",
      "data": "XX3"
    },
    {
      "name": "Weakness for Compliments",
      "description": "The magic that was used to awaken the Gloxy had the unintended consequence of making them very susceptible to praise and compliments. You have a penalty dice when making insight checks against creatures who compliment or praise you as well as checks against being charmed.",
      "data": "TA:AZ2=1"
    }
  ]
}
