{
  "id": 16,
  "name": "Stout-Folk",
  "homeworld": "Kragfel",
  "description": "Stout-Folk are smaller humanoids with sturdy builds and a strong connection to their homeworld of Kragfel, where they have long been forced to live beneath the surface. They are industrious, often excelling in mining, underground farming, and crafting. Stout-Folk communities are known for their hospitality and resilience, never turning away a stranger or outsider.",
  "img": "img/ancestries/stout-folk.webp",
  "portrait": "img/ancestries/portraits/stout-folk.png",
  "lifespan": "average 85 years, mature at 18",
  "height": "",
  "size": "Small to Medium",
  "home": "",
  "language": "Underspeak",
  "options": [
    {
      "name": "Variable Size",
      "description": "Stout-Folk come in a variety of sizes. Choose yours:",
      "data": "",
      "subchoices": [
        {
          "id": "small_size",
          "name": "Small",
          "description": "You are a small creature. All of your finesse skills are upgraded and your physique skills downgraded. You also have a -1 penalty to movement speed.",
          "data": "SSA=Y:SSB=Y:SSC=Y:SSD=Y:SSE=X:SSF=X:SSG=X:SSH=X:A4=-1:TA"
        },
        {
          "id": "medium_size",
          "name": "Medium",
          "description": "You are a medium creature, suffering no penalty or bonus related to your size.",
          "data": "TA"
        }
      ],
      "requiresChoice": true,
      "choiceType": "Size Selection"
    },
    {
      "name": "Stout-Folk Skin",
      "description": "The Stout-Folk have extremely resilient skin that offers protection from the elements and corrosive effects. Gain +1 toxic, electric, cold and heat mitigation.",
      "data": "M9=1:M4=1:M3=1:M2=1:TA"
    },
    {
      "name": "Reaction : Strong Chin",
      "description": "In response to failing a check that results in you becoming dazed or stunned, roll a d20. On a 12 or higher, you ignore the condition.",
      "data": "ZX2"
    },
    {
      "name": "Sunblind",
      "description": "Generations underground have left your eyes poorly adapted to bright light. You roll with a penalty die on senses checks that use vision while in daylight or similarly bright conditions.",
      "data": "TA"
    }
  ]
}
